[
  {
    "title": "A Phase 1/2 Study of Bleximenib in Participants With Acute Leukemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=38937&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Phase 1: * Relapsed or refractory (R/R) acute leukemia and has exhausted, or is ineligible for, available therapeutic options * Participants greater than or equal (\\>=)12 and less than (\\ =) 50 milliliter per minute (mL/min) per four variable modified diet in renal disease (MDRD) equation * Eastern Cooperative Oncology Group (ECOG) performance status grade of 0, 1 or 2. Adolescent participants only: Performance status \\>=70 by Lansky scale (for participants less than \\[\\ =70 Karnofsky scale (for participants \\>=16 years of age) * A female of childbearing potential must have a negative highly sensitive serum beta-human chorionic gonadotropin at screening and within 48 hours prior to the first dose of study treatment * Participant must agree to all protocol required contraception requirements and avoid sperm or egg donations or freezing for future reproductive use while on study and for 90 days (males) or 6 months (females) after the last dose of study treatment Exclusion Criteria: * Acute promyelocytic leukemia, diagnosis of Down syndrome associated leukemia or juvenile myelomonocytic leukemia according to World Health Organization (WHO) 2016 criteria * Active central nervous system (CNS) disease * Prior solid organ transplantation * QTc according to Fridericia's formula (QTcF) for males \\>= 450 millisecond (msec) or for females \\>= 470 msec. Participants with a family history of Long QT syndrome are excluded * Exclusion criteria related to stem cell transplant: a. Received prior treatment with allogenic bone marrow or stem cell transplant \\ You can take part if: Inclusion Criteria: Phase 1: * Relapsed or refractory (R/R) acute leukemia and has exhausted, or is ineligible for, available therapeutic options * Participants greater than or equal (>=)12 and less than (<) 18 years of age are only eligible for the Phase 1 adolescent cohort * Acute leukemia harboring histone-lysine N-methyltransferase 2A (KMT2A), nucleophosmin 1 gene (NPM1) or nucleoporin 98 gene or nucleoporin 214 gene (NUP98 or NUP214) alterations Phase: 2 * Participants greater than 18 years are eligible * Must have had an initial diagnosis of acute myeloid leukemia (AML) per the WHO 2022 classification criteria and have relapsed/refractory disease * AML harboring KMT2A-r (gene rearrangement/translocation) or NPM1 mutations only For Both Phase 1 and 2: * Pretreatment clinical laboratory values meeting the following criteria: (a) Hematology: white blood cell (WBC) count less than or equal to (<=) 20*10^9/liter (L) and (b) renal function; Estimated or measured glomerular filtration rate greater than or equal to (>=) 50 milliliter per minute (mL/min) per four variable modified diet in renal disease (MDRD) equation * Eastern Cooperative Oncology Group (ECOG) performance status grade of 0, 1 or 2. Adolescent participants only: Performance status >=70 by Lansky scale (for participants less than [<]16 years of age) or >=70 Karnofsky scale (for participants >=16 years of age) * A female of childbearing potential must have a negative highly sensitive serum beta-human chorionic gonadotropin at screening and within 48 hours prior to the first dose of study treatment * Participant must agree to all protocol required contraception requirements and avoid sperm or egg donations or freezing for future reproductive use while on study and for 90 days (males) or 6 months (females) after the last dose of study treatment Exclusion Criteria: * Acute promyelocytic leukemia, diagnosis of Down syndrome associated leukemia or juvenile myelomonocytic leukemia according to World Health Organization (WHO) 2016 criteria * Active central nervous system (CNS) disease * Prior solid organ transplantation * QTc according to Fridericia's formula (QTcF) for males >= 450 millisecond (msec) or for females >= 470 msec. Participants with a family history of Long QT syndrome are excluded * Exclusion criteria related to stem cell transplant: a. Received prior treatment with allogenic bone marrow or stem cell transplant <=3 months before the first dose of study treatment; b. Has evidence of graft versus host disease; c. Received donor lymphocyte infusion <=1 month before the first dose of study treatment; d. Requires immunosuppressant therapy (exception: daily doses <=10 milligrams (mg) prednisone or equivalent are allowed for adrenal replacement) * Prior cancer immunotherapy within 4 weeks prior to enrollment or blinatumomab within 2 weeks prior to enrollment. Additional prior cancer therapies must not be given within 4 weeks prior to enrollment or 5 half-lives of the agent (whichever is shorter)",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A study of bleximenib in combination with acute myeloid leukemia-directed therapies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=10056&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of Bleximenib in Combination With Acute Myeloid Leukemia (AML) Directed Therapies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=48603&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Adolescent participants (defined as greater than or equal to \\[\\>=\\] 12 and less than \\[\\ 70 by Lansky scale (for participants \\ 70 Karnofsky scale (for participants \\>16 years of age) * A female of childbearing potential must have a negative highly sensitive serum beta-human chorionic gonadotropin at screening and within 48 hours prior to the first dose of study treatment * Must sign an informed consent form (ICF) indicating participant (or their legally authorized representative) understands the purpose of the study and procedures required for the study and is willing to participate in the study * Willing and able to adhere to the prohibitions and restrictions specified in this protocol Exclusion Criteria: * Acute promyelocytic leukemia, diagnosis of Down syndrome associated leukemia or juvenile myelomonocytic leukemia according to WHO 2016 criteria * Leukemic involvement of the central nervous system * Recipient of solid organ transplant * Cardiovascular disease that is uncontrolled, increases risk for Torsades de Pointes or that was diagnosed within 6 months prior to the first dose of study treatment including, but not limited to: (a) Myocardial infarction; (b) Severe or unstable angina; (c) Clinically significant cardiac arrhythmias, including bradycardia (\\ \\] 140/90 millimeters of mercury \\[mm Hg\\]; (e) Acute neurologic events such as stroke or transient ischemic attack, intracranial or subarachnoid hemorrhage, intracranial trauma; (f) Venous thromboembolic events (example, pulmonary embolism) within 1 month prior to the first dose of study treatment ;(g) Congestive heart failure (NYHA class III to IV); (h) Pericarditis or clinically significant pericardial effusion; (i) Myocarditis; (j) Endocarditis (k) Clinically significant hypokalemia, hypomagnesemia, hypocalcemia (corrected for hypoalbuminemia) * Any toxicity (except for alopecia, stable peripheral neuropathy, thrombocytopenia, neutropenia, anemia) from previous anticancer therapy that has not resolved to baseline or to grade 1 or less * Pulmonary compromise that requires the need for supplemental oxygen use to maintain adequate oxygenation * Participants with diagnosis of Fanconi anemia, Kostmann syndrome, Shwachman diamond syndrome, or any other known bone marrow failure syndrome}') You can take part if: Inclusion Criteria: * Adolescent participants (defined as greater than or equal to [>=] 12 and less than [<] 18 years of age) are only eligible for the relapsed/refractory (R/R) cohort (Arm A, cohort A4) * Diagnosis of AML according to World Health Organization (WHO) criteria: a) De novo or secondary AML; b) relapsed/refractory (Arm A only); c) harboring KMT2A, NPM1, NUP98, or NUP214 alterations; d) Participants may receive emergency leukapheresis and/or cytarabine as cytoreductive therapy according to local practice guidelines * Pretreatment clinical laboratory values meeting the following criteria -listed below: White blood cell (WBC) count: less than or equal to (<=) 25*10^9 per liter (/L), adequate liver and renal function * Eastern Cooperative Oncology Group (ECOG) performance status grade of 0, 1 or 2. Adolescent participants only: Performance status >70 by Lansky scale (for participants <16 years of age) or >70 Karnofsky scale (for participants >16 years of age) * A female of childbearing potential must have a negative highly sensitive serum beta-human chorionic gonadotropin at screening and within 48 hours prior to the first dose of study treatment * Must sign an informed consent form (ICF) indicating participant (or their legally authorized representative) understands the purpose of the study and procedures required for the study and is willing to participate in the study * Willing and able to adhere to the prohibitions and restrictions specified in this protocol Exclusion Criteria: * Acute promyelocytic leukemia, diagnosis of Down syndrome associated leukemia or juvenile myelomonocytic leukemia according to WHO 2016 criteria * Leukemic involvement of the central nervous system * Recipient of solid organ transplant * Cardiovascular disease that is uncontrolled, increases risk for Torsades de Pointes or that was diagnosed within 6 months prior to the first dose of study treatment including, but not limited to: (a) Myocardial infarction; (b) Severe or unstable angina; (c) Clinically significant cardiac arrhythmias, including bradycardia (<50 beats per minute); (d) Uncontrolled (persistent) hypertension: (example, blood pressure greater than [>] 140/90 millimeters of mercury [mm Hg]; (e) Acute neurologic events such as stroke or transient ischemic attack, intracranial or subarachnoid hemorrhage, intracranial trauma; (f) Venous thromboembolic events (example, pulmonary embolism) within 1 month prior to the first dose of study treatment ;(g) Congestive heart failure (NYHA class III to IV); (h) Pericarditis or clinically significant pericardial effusion; (i) Myocarditis; (j) Endocarditis (k) Clinically significant hypokalemia, hypomagnesemia, hypocalcemia (corrected for hypoalbuminemia) * Any toxicity (except for alopecia, stable peripheral neuropathy, thrombocytopenia, neutropenia, anemia) from previous anticancer therapy that has not resolved to baseline or to grade 1 or less * Pulmonary compromise that requires the need for supplemental oxygen use to maintain adequate oxygenation * Participants with diagnosis of Fanconi anemia, Kostmann syndrome, Shwachman diamond syndrome, or any other known bone marrow failure syndrome",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "First in Human Study of Ziftomenib in Relapsed or Refractory Acute Myeloid Leukemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=50389&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Patients with refractory or relapsed AML defined as the reappearance of ≥ 5% blasts in the bone marrow and who have also failed or are ineligible for any approved standard of care therapies, including HSCT. 1. Phase 1b: 1. Patients with a documented lysine\\[K\\]-specific methyltransferase 2-rearrangement (KMT2A-r), or 2. Patients with a documented nucleophosmin 1 mutation (NPM1-m) 2. Phase 2: a. Patients with a documented nucleophosmin 1 mutation (NPM1-m) 3. ≥ 18 years of age. 4. Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2, and a life expectancy of at least 2 months. 5. Adequate liver and kidney function according to protocol requirements. 6. Peripheral white blood cell (WBC) counts ≤ 30,000/μL. Patients may receive hydroxyurea to control and maintain white blood cell count prior to enrollment. 7. Women of childbearing potential must be willing to use a highly effective method of contraception throughout the study and for at least 180 days after the last dose of study treatment. 8. Males with female partners of childbearing potential must agree to use a highly effective method of contraception throughout the study and for at least 90 days after the last dose of study treatment. Key Exclusion Criteria: 1. Diagnosis of acute promyelocytic leukemia. 2. Diagnosis of chronic myelogenous leukemia in blast crisis. 3. Donor lymphocyte infusion \\ 480 ms on triplicate ECG. 16. Major surgery within 4 weeks prior to the first dose of study treatment. 17. Women who are pregnant or lactating. All female patients with reproductive potential must have a negative serum pregnancy test within 72 hours prior to starting treatment.}') You can take part if: Key Inclusion Criteria: Patients with refractory or relapsed AML defined as the reappearance of ≥ 5% blasts in the bone marrow and who have also failed or are ineligible for any approved standard of care therapies, including HSCT. 1. Phase 1b: 1. Patients with a documented lysine[K]-specific methyltransferase 2-rearrangement (KMT2A-r), or 2. Patients with a documented nucleophosmin 1 mutation (NPM1-m) 2. Phase 2: a. Patients with a documented nucleophosmin 1 mutation (NPM1-m) 3. ≥ 18 years of age. 4. Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2, and a life expectancy of at least 2 months. 5. Adequate liver and kidney function according to protocol requirements. 6. Peripheral white blood cell (WBC) counts ≤ 30,000/μL. Patients may receive hydroxyurea to control and maintain white blood cell count prior to enrollment. 7. Women of childbearing potential must be willing to use a highly effective method of contraception throughout the study and for at least 180 days after the last dose of study treatment. 8. Males with female partners of childbearing potential must agree to use a highly effective method of contraception throughout the study and for at least 90 days after the last dose of study treatment. Key Exclusion Criteria: 1. Diagnosis of acute promyelocytic leukemia. 2. Diagnosis of chronic myelogenous leukemia in blast crisis. 3. Donor lymphocyte infusion < 30 days prior to study entry. 4. Clinically active central nervous system (CNS) leukemia. 5. Undergone HSCT and have not had adequate hematologic recovery. 6. Receiving immunosuppressive therapy post HSCT within 2 weeks of Cycle 1 Day 1. 7. Grade ≥ 2 active graft-versus-host disease (GVHD), moderate or severe limited chronic GVHD, or extensive chronic GVHD of any severity. 8. Received chemotherapy immunotherapy, radiotherapy, or any ancillary therapy that is considered to be investigational (i.e., used for non-approved indications(s) and in the context of a research investigation) < 14 days prior to the first dose of ziftomenib or within 5 drug half-lives prior to the first dose of study drug. 9. Not recovered to < Grade 2 (National Cancer Institute Common Terminology Criteria for Adverse Events v5.0) from all acute toxicities or deemed back to a stable baseline. 10. Treatment with concomitant drugs that are strong inhibitors or inducers of cytochrome P450-isozyme 3A4 (CYP3A4) with the exception of antibiotics, antifungals, and antivirals that are used as standard of care or to prevent or treat infections and other such drugs that are considered absolutely essential for the care of the patient. 11. Detectable viral load for human immunodeficiency virus, hepatitis C, or hepatitis B surface antigen indicative of active infection. Patients with controlled disease will not be excluded from study enrollment. 12. Pre-existing disorder predisposing the patient to a serious or life-threatening infection (e.g. cystic fibrosis, congenital or acquired immunodeficiency, bleeding disorder, or cytopenias not related to AML). 13. Active uncontrolled acute or chronic systemic fungal, bacterial, viral, or other infection. 14. Significant cardiovascular disease including unstable angina pectoris, uncontrolled hypertension or arrhythmia, history of cerebrovascular accident including transient ischemic attack within the past 6 months, congestive heart failure (NYHA Class III or IV) related to primary cardiac disease, ischemic or severe valvular heart disease, or a myocardial infarction within 6 months prior to the first dose of study treatment. 15. Mean QTcF >480 ms on triplicate ECG. 16. Major surgery within 4 weeks prior to the first dose of study treatment. 17. Women who are pregnant or lactating. All female patients with reproductive potential must have a negative serum pregnancy test within 72 hours prior to starting treatment.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Phase 1a/1b Study of ELVN-001 for the Treatment Chronic Myeloid Leukemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56177&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* BCR-ABL1 positive CML in chronic phase, with or without T315I mutation. * The patient has failed, is intolerant to, or not a candidate for, available therapies known to be active for treatment of their CML. * ECOG performance status of 0 to 2. * Adequate hematologic, hepatic and renal function. * Prior bone marrow transplant allowed if ≥ 6 months prior to the first dose of ELVN-001. Exclusion Criteria: * Treatment with anti-cancer or anti-CML therapy within 7 days or 5 half-lives, whichever is longer. * History of acute tyrosine kinase inhibitor (TKI)-related pancreatitis within 6 months of study entry. Active chronic pancreatitis, or pancreatic disease due to any cause. * QTc \\>470 ms.}') You can take part if: Inclusion Criteria: * BCR-ABL1 positive CML in chronic phase, with or without T315I mutation. * The patient has failed, is intolerant to, or not a candidate for, available therapies known to be active for treatment of their CML. * ECOG performance status of 0 to 2. * Adequate hematologic, hepatic and renal function. * Prior bone marrow transplant allowed if ≥ 6 months prior to the first dose of ELVN-001. Exclusion Criteria: * Treatment with anti-cancer or anti-CML therapy within 7 days or 5 half-lives, whichever is longer. * History of acute tyrosine kinase inhibitor (TKI)-related pancreatitis within 6 months of study entry. Active chronic pancreatitis, or pancreatic disease due to any cause. * QTc >470 ms.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of JNJ-89853413 for Relapsed or Refractory Acute Myeloid Leukemia or Myelodysplastic Neoplasms",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=57287&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Have a diagnosis, per World Health Organization (WHO) 2022 criteria of: 1. relapsed/refractory acute myeloid leukemia (AML) 2. relapsed/refractory moderate high, high, or very high risk myelodysplastic neoplasms (MDS) per Molecular International Prognostic Scoring System (IPSS-M) * Body weight greater than or equals to (\\>=) 40 kilograms (kg) * Have an Eastern Cooperative Oncology Group (ECOG) performance status of 0 - 2 * Have adequate renal function defined as Chronic Kidney Disease Epidemiology Collaboration (CKD-EPI) Estimated Glomerular Filtration Rate (eGFR) \\>=40 milligrams per minute (mL/min) * Participants must have laboratory parameters in the required range Exclusion Criteria: * Has a medical history of clinically significant pulmonary compromise, particularly the need for current supplemental oxygen use to maintain adequate oxygenation * Has evidence of an uncontrolled systemic viral, bacterial, or fungal infection * Has known allergies, hypersensitivity, or intolerance to the excipients of JNJ-89853413 * Had major surgery or had significant traumatic injury within 14 days of planned first dose of JNJ-89853413 * Has known active central nervous system involvement}') You can take part if: Inclusion Criteria: * Have a diagnosis, per World Health Organization (WHO) 2022 criteria of: 1. relapsed/refractory acute myeloid leukemia (AML) 2. relapsed/refractory moderate high, high, or very high risk myelodysplastic neoplasms (MDS) per Molecular International Prognostic Scoring System (IPSS-M) * Body weight greater than or equals to (>=) 40 kilograms (kg) * Have an Eastern Cooperative Oncology Group (ECOG) performance status of 0 - 2 * Have adequate renal function defined as Chronic Kidney Disease Epidemiology Collaboration (CKD-EPI) Estimated Glomerular Filtration Rate (eGFR) >=40 milligrams per minute (mL/min) * Participants must have laboratory parameters in the required range Exclusion Criteria: * Has a medical history of clinically significant pulmonary compromise, particularly the need for current supplemental oxygen use to maintain adequate oxygenation * Has evidence of an uncontrolled systemic viral, bacterial, or fungal infection * Has known allergies, hypersensitivity, or intolerance to the excipients of JNJ-89853413 * Had major surgery or had significant traumatic injury within 14 days of planned first dose of JNJ-89853413 * Has known active central nervous system involvement",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A study of JNJ-89853413 for relapsed or refractory acute myeloid leukemia or myelodysplastic neoplasms",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56110&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of BGB-16673 Compared to Investigator's Choice in Participants With Chronic Lymphocytic Leukemia or Small Lymphocytic Lymphoma Previously Exposed to Both Bruton Tyrosine Kinase (BTK) and B-cell Leukemia/Lymphoma 2 Protein (BCL2) Inhibitors",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56785&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Confirmed diagnosis of CLL or SLL, requiring treatment, based on 2018 international workshop on chronic lymphocytic leukemia (iwCLL) criteria. 2. Previously received treatment for CLL/SLL with both a BTKi and a BCL2i. 3. Participants with SLL must have measurable disease by computer tomography (CT)/magnetic resonance imaging (MRI) 4. Eastern Cooperative Oncology Group (ECOG) score 0, 1, or 2 5. Adequate liver function 6. Adequate blood clotting function Exclusion Criteria: 1. Known prolymphocytic leukemia or history of, or currently suspected, Richter's transformation 2. Prior autologous stem cell transplant or chimeric antigen receptor-T cell therapy in the last 3 months 3. Known central nervous system involvement 4. Prior exposure to any BTK protein degraders 5. Active fungal, bacterial and/or viral infection requiring parenteral systemic therapy 6. Clinically significant cardiovascular disease NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.}') You can take part if: Inclusion Criteria: 1. Confirmed diagnosis of CLL or SLL, requiring treatment, based on 2018 international workshop on chronic lymphocytic leukemia (iwCLL) criteria. 2. Previously received treatment for CLL/SLL with both a BTKi and a BCL2i. 3. Participants with SLL must have measurable disease by computer tomography (CT)/magnetic resonance imaging (MRI) 4. Eastern Cooperative Oncology Group (ECOG) score 0, 1, or 2 5. Adequate liver function 6. Adequate blood clotting function Exclusion Criteria: 1. Known prolymphocytic leukemia or history of, or currently suspected, Richter's transformation 2. Prior autologous stem cell transplant or chimeric antigen receptor-T cell therapy in the last 3 months 3. Known central nervous system involvement 4. Prior exposure to any BTK protein degraders 5. Active fungal, bacterial and/or viral infection requiring parenteral systemic therapy 6. Clinically significant cardiovascular disease NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Safety and Efficacy Study of Epcoritamab in Subjects With Relapsed/Refractory Chronic Lymphocytic Leukemia and Richter's Syndrome",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=49332&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Eastern Cooperative Oncology Group (ECOG) performance status score of 0, 1 or 2. 2. Evidence of CD20 positivity in a sample representative of the disease at Screening. 3. Acceptable hematology parameters and organ function based on baseline bloodwork. 4. Life expectancy \\>3 months on standard of care (SOC) for CLL, \\>3 months for RS. 5. For R/R CLL arms - Must have active CLL/SLL disease requiring treatment per iwCLL 2018 criteria. 6. For R/R CLL monotherapy arms - Received at least 2 prior lines of systemic anti-neoplastic therapy including a Bruton's tyrosine kinase (BTK) inhibitor or at least 1 prior line of systemic antineoplastic therapy, including treatment with (or intolerance of) a covalent BTK inhibitor (cBTKi) and a B-cell lymphoma 2 (BCL-2) inhibitor. 7. For all RS arms - Have tumor biopsy-proven CD20+ Diffuse large B-cell Lymphoma (DLBCL) and a clinical history of CLL/SLL. 8. For all RS arms - Must have measurable disease by fluorodeoxyglucose-positron emission tomography (FDG-PET) and computed tomography (CT) or magnetic resonance imaging (MRI) scan. 9. For all RS arms - Must provide mandatory formalin-fixed, paraffin-embedded (FFPE) tumor biopsy sample. 10. For RS - monotherapy arm: Deemed as ineligible for chemoimmunotherapy at investigator's discretion or participant who refuses to receive intensive chemotherapy 11. For RS - lenalidomide combination therapy arm * Deemed as ineligible for chemoimmunotherapy at the investigator's discretion, or participant who refuses to receive intensive chemotherapy. * Eligible for treatment with lenalidomide. * Must be willing to use contraception and adhere to the Lenalidomide Pregnancy Risk Minimization Plan * A woman must agree not to breastfeed a child during treatment and for at least 28 days after discontinuation from study. 12. For RS - R-CHOP combination Therapy Arm - * Eligible for treatment with R-CHOP. * Females of childbearing potential must use highly effective contraceptive measures while taking R-CHOP and for 12 months after stopping treatment. * A woman must agree not to breastfeed a child during treatment or until 12 months after last treatment. 13. For R/R CLL - venetoclax combination Therapy arm - after receiving at least 1 prior line of systemic antineoplastic therapy. * Presence of measurable disease. * Must take prophylaxis for tumor lysis syndrome (TLS). 14. For R/R CLL pirtobrutinib combination Therapy arm: * Must have active CLL/SLL disease requiring treatment per iwCLL 2018 criteria. * Presence of measurable disease. * Previous treatment with at least one and a maximum 3 prior lines of therapy including a cBTKi. * Diagnosis of CLL/SLL that met published iwCLL criteria. 15. Participants with TN HR CLL - Pirtobrutinib Combination Therapy Expansion: * Diagnosis of CLL/SLL that met published iwCLL criteria 2018. * Must have active CLL/SLL disease that needs treatment per iwCLL * Must take prophylaxis for TLS based on their TLS risk evaluation upon initiation of trial drug. * Must have one or more high-risk features. * Presence of measurable disease. Key Exclusion Criteria 1. Received prior treatment with a CD3×CD20 bispecific antibody. 2. Received any prior allogeneic hematopoietic stem cell transplantation (HSCT) or solid organ transplantation. 3. Received chimeric antigen receptor (CAR) T-cell therapy within 100 days or an investigational drug within 4 weeks, prior to first dose of trial drug. 4. Autoimmune disease or other diseases that require permanent or high-dose immunosuppressive therapy. 5. Received vaccination with live vaccines within 28 days. 6. Clinically significant cardiac disease. 7. Known current malignancy other than inclusion diagnosis. 8. Has had major surgery within 4 weeks. 9. Known history of human immunodeficiency virus (HIV). 10. For R/R CLL arms - Any history of RS or evidence indicating a potential Richter's transformation. 11. For R/R CLL - Venetoclax Combination Therapy arm: received venetoclax within 24 months prior to beginning venetoclax ramp-up for this trial or has progressed on venetoclax treatment. 12. For all RS arms - Diagnosis of Richter's syndrome not of the DLBCL subtype such as Hodgkin's lymphoma, prolymphocytic leukemia. 13. RS - Lenalidomide Combination Therapy and RS Monotherapy Arms - received more than 2 prior lines of therapy for RS. 14. R/R CLL - Pirtobrutinib Combination Therapy Arm - Prior exposure to a non-covalent (reversible) BTK inhibitor or a BTK degrader. 15. Pirtobrutinib Combination Therapy Expansion Arms: * History of bleeding disorders or participants requiring therapeutic anticoagulation with warfarin or another vitamin K antagonist * Require continuous treatment with or have received strong cytochrome P450 (CYP) 3A inhibitors or strong/moderate CYP3A inducers within 4 to 5 half-lives or 14 days prior to the first dose of pirtobrutinib. NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.}') You can take part if: Key Inclusion Criteria 1. Eastern Cooperative Oncology Group (ECOG) performance status score of 0, 1 or 2. 2. Evidence of CD20 positivity in a sample representative of the disease at Screening. 3. Acceptable hematology parameters and organ function based on baseline bloodwork. 4. Life expectancy >3 months on standard of care (SOC) for CLL, >3 months for RS. 5. For R/R CLL arms - Must have active CLL/SLL disease requiring treatment per iwCLL 2018 criteria. 6. For R/R CLL monotherapy arms - Received at least 2 prior lines of systemic anti-neoplastic therapy including a Bruton's tyrosine kinase (BTK) inhibitor or at least 1 prior line of systemic antineoplastic therapy, including treatment with (or intolerance of) a covalent BTK inhibitor (cBTKi) and a B-cell lymphoma 2 (BCL-2) inhibitor. 7. For all RS arms - Have tumor biopsy-proven CD20+ Diffuse large B-cell Lymphoma (DLBCL) and a clinical history of CLL/SLL. 8. For all RS arms - Must have measurable disease by fluorodeoxyglucose-positron emission tomography (FDG-PET) and computed tomography (CT) or magnetic resonance imaging (MRI) scan. 9. For all RS arms - Must provide mandatory formalin-fixed, paraffin-embedded (FFPE) tumor biopsy sample. 10. For RS - monotherapy arm: Deemed as ineligible for chemoimmunotherapy at investigator's discretion or participant who refuses to receive intensive chemotherapy 11. For RS - lenalidomide combination therapy arm * Deemed as ineligible for chemoimmunotherapy at the investigator's discretion, or participant who refuses to receive intensive chemotherapy. * Eligible for treatment with lenalidomide. * Must be willing to use contraception and adhere to the Lenalidomide Pregnancy Risk Minimization Plan * A woman must agree not to breastfeed a child during treatment and for at least 28 days after discontinuation from study. 12. For RS - R-CHOP combination Therapy Arm - * Eligible for treatment with R-CHOP. * Females of childbearing potential must use highly effective contraceptive measures while taking R-CHOP and for 12 months after stopping treatment. * A woman must agree not to breastfeed a child during treatment or until 12 months after last treatment. 13. For R/R CLL - venetoclax combination Therapy arm - after receiving at least 1 prior line of systemic antineoplastic therapy. * Presence of measurable disease. * Must take prophylaxis for tumor lysis syndrome (TLS). 14. For R/R CLL pirtobrutinib combination Therapy arm: * Must have active CLL/SLL disease requiring treatment per iwCLL 2018 criteria. * Presence of measurable disease. * Previous treatment with at least one and a maximum 3 prior lines of therapy including a cBTKi. * Diagnosis of CLL/SLL that met published iwCLL criteria. 15. Participants with TN HR CLL - Pirtobrutinib Combination Therapy Expansion: * Diagnosis of CLL/SLL that met published iwCLL criteria 2018. * Must have active CLL/SLL disease that needs treatment per iwCLL * Must take prophylaxis for TLS based on their TLS risk evaluation upon initiation of trial drug. * Must have one or more high-risk features. * Presence of measurable disease. Key Exclusion Criteria 1. Received prior treatment with a CD3×CD20 bispecific antibody. 2. Received any prior allogeneic hematopoietic stem cell transplantation (HSCT) or solid organ transplantation. 3. Received chimeric antigen receptor (CAR) T-cell therapy within 100 days or an investigational drug within 4 weeks, prior to first dose of trial drug. 4. Autoimmune disease or other diseases that require permanent or high-dose immunosuppressive therapy. 5. Received vaccination with live vaccines within 28 days. 6. Clinically significant cardiac disease. 7. Known current malignancy other than inclusion diagnosis. 8. Has had major surgery within 4 weeks. 9. Known history of human immunodeficiency virus (HIV). 10. For R/R CLL arms - Any history of RS or evidence indicating a potential Richter's transformation. 11. For R/R CLL - Venetoclax Combination Therapy arm: received venetoclax within 24 months prior to beginning venetoclax ramp-up for this trial or has progressed on venetoclax treatment. 12. For all RS arms - Diagnosis of Richter's syndrome not of the DLBCL subtype such as Hodgkin's lymphoma, prolymphocytic leukemia. 13. RS - Lenalidomide Combination Therapy and RS Monotherapy Arms - received more than 2 prior lines of therapy for RS. 14. R/R CLL - Pirtobrutinib Combination Therapy Arm - Prior exposure to a non-covalent (reversible) BTK inhibitor or a BTK degrader. 15. Pirtobrutinib Combination Therapy Expansion Arms: * History of bleeding disorders or participants requiring therapeutic anticoagulation with warfarin or another vitamin K antagonist * Require continuous treatment with or have received strong cytochrome P450 (CYP) 3A inhibitors or strong/moderate CYP3A inducers within 4 to 5 half-lives or 14 days prior to the first dose of pirtobrutinib. NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Safety and Efficacy of Quizartinib in Children and Young Adults With Acute Myeloid Leukemia (AML), a Cancer of the Blood",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=32072&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Participants must meet all of the following criteria to be eligible for enrollment into the study: * Has diagnosis of AML according to the World Health Organization (WHO) 2008 classification with ≥5% blasts in bone marrow, with or without extramedullary disease * In first relapse or refractory to first-line high-dose chemotherapy with no more than 1 attempt (1 to 2 cycles of induction chemotherapy) at remission induction - prior HSCT is permitted * Has presence of the FLT3-ITD activating mutation in bone marrow or peripheral blood as defined in the protocol * Is between 1 month and 21 years of age at the time the Informed Consent/Assent form is signed * Has protocol-defined adequate performance status score * Has fully recovered from the acute clinically significant toxicity effects of all prior chemotherapy, immunotherapy, or radiotherapy, per protocol guidelines * Has protocol-defined adequate renal, hepatic and cardiac functions * If of reproductive potential, is permanently sterile or agrees to use highly effective birth control upon enrollment, during the period of therapy, and for 6 months following the last dose of quizartinib, etoposide, fludarabine, methotrexate, or cytarabine, whichever is later * If female of child-bearing potential, tests negative for pregnancy and agrees not to breast feed * Male participants must be surgically sterile or willing to use highly effective birth control during the treatment period, and for 6 months following the last dose of quizartinib, etoposide, fludarabine, methotrexate, or cytarabine, whichever is later. * Participant/legal representative is capable of understanding the investigational nature of the study, potential risks, and benefits, and the patient (and/or legal representative) signs a written assent/informed consent Exclusion Criteria: Participants who meet any of the following criteria will be disqualified from entering the study: * Has been diagnosed with isolated central nervous system relapse, acute promyelocytic leukemia (APL), juvenile myelomonocytic leukemia, French-American-British classification M3 or WHO classification of APL with translocation, or with myeloid proliferations related to Down syndrome * Has uncontrolled or pre-defined significant cardiovascular disease as detailed in the protocol * Has systemic fungal, bacterial, viral or other infection that is exhibiting ongoing signs/symptoms related to the infection without improvement despite appropriate antibiotics or other treatment. The patient must be off vasopressors and have negative blood cultures for at least 48 hours prior to the start of systematic protocol therapy. * Has known active clinically relevant liver disease (e.g., active hepatitis B or active hepatitis C) * Has known history of human immunodeficiency virus (HIV) * Has history of hypersensitivity to any of the study medications or their excipients * Is receiving or is anticipated to receive concomitant chemotherapy, radiation, or immunotherapy other than as specified in the protocol * Has any significant concurrent disease, illness, psychiatric disorder or social issue that would compromise subject safety or compliance, interfere with consent/assent, study participation, follow up, or interpretation of study results * Is currently participating in another investigative interventional procedure (observational or long-term interventional follow-up is allowed) * Is otherwise considered inappropriate for the study by the Investigator}') You can take part if: Inclusion Criteria: Participants must meet all of the following criteria to be eligible for enrollment into the study: * Has diagnosis of AML according to the World Health Organization (WHO) 2008 classification with ≥5% blasts in bone marrow, with or without extramedullary disease * In first relapse or refractory to first-line high-dose chemotherapy with no more than 1 attempt (1 to 2 cycles of induction chemotherapy) at remission induction - prior HSCT is permitted * Has presence of the FLT3-ITD activating mutation in bone marrow or peripheral blood as defined in the protocol * Is between 1 month and 21 years of age at the time the Informed Consent/Assent form is signed * Has protocol-defined adequate performance status score * Has fully recovered from the acute clinically significant toxicity effects of all prior chemotherapy, immunotherapy, or radiotherapy, per protocol guidelines * Has protocol-defined adequate renal, hepatic and cardiac functions * If of reproductive potential, is permanently sterile or agrees to use highly effective birth control upon enrollment, during the period of therapy, and for 6 months following the last dose of quizartinib, etoposide, fludarabine, methotrexate, or cytarabine, whichever is later * If female of child-bearing potential, tests negative for pregnancy and agrees not to breast feed * Male participants must be surgically sterile or willing to use highly effective birth control during the treatment period, and for 6 months following the last dose of quizartinib, etoposide, fludarabine, methotrexate, or cytarabine, whichever is later. * Participant/legal representative is capable of understanding the investigational nature of the study, potential risks, and benefits, and the patient (and/or legal representative) signs a written assent/informed consent Exclusion Criteria: Participants who meet any of the following criteria will be disqualified from entering the study: * Has been diagnosed with isolated central nervous system relapse, acute promyelocytic leukemia (APL), juvenile myelomonocytic leukemia, French-American-British classification M3 or WHO classification of APL with translocation, or with myeloid proliferations related to Down syndrome * Has uncontrolled or pre-defined significant cardiovascular disease as detailed in the protocol * Has systemic fungal, bacterial, viral or other infection that is exhibiting ongoing signs/symptoms related to the infection without improvement despite appropriate antibiotics or other treatment. The patient must be off vasopressors and have negative blood cultures for at least 48 hours prior to the start of systematic protocol therapy. * Has known active clinically relevant liver disease (e.g., active hepatitis B or active hepatitis C) * Has known history of human immunodeficiency virus (HIV) * Has history of hypersensitivity to any of the study medications or their excipients * Is receiving or is anticipated to receive concomitant chemotherapy, radiation, or immunotherapy other than as specified in the protocol * Has any significant concurrent disease, illness, psychiatric disorder or social issue that would compromise subject safety or compliance, interfere with consent/assent, study participation, follow up, or interpretation of study results * Is currently participating in another investigative interventional procedure (observational or long-term interventional follow-up is allowed) * Is otherwise considered inappropriate for the study by the Investigator",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Study of Sonrotoclax (BGB-11417) Plus Zanubrutinib (BGB-3111) Compared With Venetoclax Plus Obinutuzumab in Participants With Chronic Lymphocytic Leukemia (CLL)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=51137&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Cll, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Treatment-naïve (TN) adults with confirmed diagnosis of CLL which requires treatment * Eastern Cooperative Oncology Group (ECOG) score 0, 1, or 2 * Measurable disease by Computer Tomography/Magnetic Resonance Imaging * Adequate liver function as indicated by aspartate aminotransferase (AST) and alanine aminotransferase (ALT) ≤ 2.5 x the institutional upper limits of normal (ULNs) value; serum total bilirubin \\ You can take part if: Inclusion Criteria: * Treatment-naïve (TN) adults with confirmed diagnosis of CLL which requires treatment * Eastern Cooperative Oncology Group (ECOG) score 0, 1, or 2 * Measurable disease by Computer Tomography/Magnetic Resonance Imaging * Adequate liver function as indicated by aspartate aminotransferase (AST) and alanine aminotransferase (ALT) ≤ 2.5 x the institutional upper limits of normal (ULNs) value; serum total bilirubin < 3.0 x ULN * Adequate renal function as defined as creatinine clearance ≥ 50 milliliters per minute Exclusion Criteria: * Previous systemic treatment for CLL * Known prolymphocytic leukemia or history of, or currently suspected, Richter's transformation * Known central nervous system involvement * History of confirmed progressive multifocal leukoencephalopathy (PML) * Uncontrolled hypertension Note: Other protocol defined criteria may apply",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study Evaluating the Efficacy and Safety of Pirtobrutinib in Participants With Relapsed or Refractory Chronic Lymphocytic Leukemia/Small Lymphocytic Lymphoma",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56271&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Have confirmed diagnosis of CLL/SLL as defined by these iwCLL 2018 criteria. * Have received prior CLL/SLL treatment * Have received at least 1, but not more than 3 lines of prior treatment for CLL/SLL * Have received a covalent BTK inhibitor * Have a requirement for therapy consistent with iwCLL 2018 criteria for initiation of therapy * Capable of swallowing oral study medication. * Have an Eastern Cooperative Oncology Group Performance Status (ECOG) score of 0 to 2. Exclusion Criteria: * Have received prior treatment with a BTK degrader and a noncovalent BTK inhibitor * Have a history of greater than or equal to (\\>=) Grade 3 bleeding due to treatment with a BTK inhibitor * Have known or suspected Richter's transformation * Have known or suspected history of central nervous system involvement by CLL/SLL * Previous or concurrent cancer distinct from CLL/SLL within 3 years before randomization. Exceptions may occur with documented sponsor approval. Examples include: * nonmelanoma skin cancer or lentigo maligna melanoma * cervical carcinoma in situ * localized prostate cancer undergoing active surveillance, and * localized (for example, lymph node negative) breast cancer with no evidence of active disease present for more than 3 years. Individual may be receiving adjuvant hormonal therapy}') You can take part if: Inclusion Criteria: * Have confirmed diagnosis of CLL/SLL as defined by these iwCLL 2018 criteria. * Have received prior CLL/SLL treatment * Have received at least 1, but not more than 3 lines of prior treatment for CLL/SLL * Have received a covalent BTK inhibitor * Have a requirement for therapy consistent with iwCLL 2018 criteria for initiation of therapy * Capable of swallowing oral study medication. * Have an Eastern Cooperative Oncology Group Performance Status (ECOG) score of 0 to 2. Exclusion Criteria: * Have received prior treatment with a BTK degrader and a noncovalent BTK inhibitor * Have a history of greater than or equal to (>=) Grade 3 bleeding due to treatment with a BTK inhibitor * Have known or suspected Richter's transformation * Have known or suspected history of central nervous system involvement by CLL/SLL * Previous or concurrent cancer distinct from CLL/SLL within 3 years before randomization. Exceptions may occur with documented sponsor approval. Examples include: * nonmelanoma skin cancer or lentigo maligna melanoma * cervical carcinoma in situ * localized prostate cancer undergoing active surveillance, and * localized (for example, lymph node negative) breast cancer with no evidence of active disease present for more than 3 years. Individual may be receiving adjuvant hormonal therapy",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of Siremadlin Alone and in Combination With Donor Lymphocyte Infusion in Acute Myeloid Leukemia Post-allogeneic Stem Cell Transplant",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=47506&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "- Participants with AML diagnosis, who underwent one allo-SCT to treat AML and are currently at ≥ Day 60 but no later than Day 120 (≤ Day 120) post allo-SCT. - Pre-allo-SCT - Participants must have any of the following risk factors that put them at high risk for relapse: • AML in first CR (CR1) prior to allo-SCT with one of the following: - Adverse risk genetic abnormalities per 2017 ELN risk stratification. Patients with TP53 mutant AML at diagnosis are eligible if they meet eligibility criteria. - Therapy-related AML (t-AML). - Secondary AML (sAML) [AML secondary to antecedent myelodysplastic syndrome (MDS) or AML secondary to myeloproliferative neoplasm (MPN)]. • AML in second or greater CR (≥CR2) prior to allo-SCT. - Allo-SCT must have the following characteristics: - Unmanipulated/T cell-replete bone marrow or peripheral blood stem cells as a graft source. - Matched related (family) donor (MFD) or matched unrelated donor (MUD): Human Leukocyte Antigen (HLA) matching of donor and recipient should be at a minimum of 8/8 antigen or allele matched at HLA-A, -B, -C, -DRB1 loci. - Any conditioning regimen intensity is permitted, the use of anti-thymocyte globulin (ATG) or alemtuzumab or post-transplant cyclophosphamide as a part of conditioning is allowed. - Donor lymphocytes are collected, cryopreserved and available for infusion (DLI), or obtaining donor lymphocytes for DLI is feasible (applicable only for part 2) - Post-allo-SCT, participants must have achieved CR or CRi with no current evidence of hematologic relapse - Eastern Cooperative Oncology Group (ECOG ) performance status 0, 1 or 2. - Laboratory test results indicating adequate liver and kidney function laboratory test results - Evidence of adequate engraftment: Absolute Neutrophil Count (ANC) ≥ 1.0x109/L, Platelets (PLT) ≥ 75x109/L, Hemoglobin (Hgb) ≥ 8 g/dL (within 14 days prior to start of study treatment) Exclusion criteria: - Prior exposure to MDM-inhibitor - Active acute GvHD (aGvHD) of any grade (per Harris et al 2016) and/or active chronic GvHD (cGvHD ) of any grade (per NIH criteria (Jagasia et al 2015)) requiring systemic therapy at time of study treatment initiation - Past history of grade III or IV aGvHD and/or past history of moderate or severe cGvHD. History of lower grades of GvHD is permitted if GvHD resolved to grade 0 for at least 4 weeks prior to start of study treatment. - Recipient of allo-SCT from MUD with ≥1 antigen or allele mismatch at HLA-A, -B, -C, -DRB1 locus (HLA matching You can take part if: Inclusion Criteria: - Participants with AML diagnosis, who underwent one allo-SCT to treat AML and are currently at ≥ Day 60 but no later than Day 120 (≤ Day 120) post allo-SCT. - Pre-allo-SCT - Participants must have any of the following risk factors that put them at high risk for relapse: • AML in first CR (CR1) prior to allo-SCT with one of the following: - Adverse risk genetic abnormalities per 2017 ELN risk stratification. Patients with TP53 mutant AML at diagnosis are eligible if they meet eligibility criteria. - Therapy-related AML (t-AML). - Secondary AML (sAML) [AML secondary to antecedent myelodysplastic syndrome (MDS) or AML secondary to myeloproliferative neoplasm (MPN)]. • AML in second or greater CR (≥CR2) prior to allo-SCT. - Allo-SCT must have the following characteristics: - Unmanipulated/T cell-replete bone marrow or peripheral blood stem cells as a graft source. - Matched related (family) donor (MFD) or matched unrelated donor (MUD): Human Leukocyte Antigen (HLA) matching of donor and recipient should be at a minimum of 8/8 antigen or allele matched at HLA-A, -B, -C, -DRB1 loci. - Any conditioning regimen intensity is permitted, the use of anti-thymocyte globulin (ATG) or alemtuzumab or post-transplant cyclophosphamide as a part of conditioning is allowed. - Donor lymphocytes are collected, cryopreserved and available for infusion (DLI), or obtaining donor lymphocytes for DLI is feasible (applicable only for part 2) - Post-allo-SCT, participants must have achieved CR or CRi with no current evidence of hematologic relapse - Eastern Cooperative Oncology Group (ECOG ) performance status 0, 1 or 2. - Laboratory test results indicating adequate liver and kidney function laboratory test results - Evidence of adequate engraftment: Absolute Neutrophil Count (ANC) ≥ 1.0x109/L, Platelets (PLT) ≥ 75x109/L, Hemoglobin (Hgb) ≥ 8 g/dL (within 14 days prior to start of study treatment) Exclusion criteria: - Prior exposure to MDM-inhibitor - Active acute GvHD (aGvHD) of any grade (per Harris et al 2016) and/or active chronic GvHD (cGvHD ) of any grade (per NIH criteria (Jagasia et al 2015)) requiring systemic therapy at time of study treatment initiation - Past history of grade III or IV aGvHD and/or past history of moderate or severe cGvHD. History of lower grades of GvHD is permitted if GvHD resolved to grade 0 for at least 4 weeks prior to start of study treatment. - Recipient of allo-SCT from MUD with ≥1 antigen or allele mismatch at HLA-A, -B, -C, -DRB1 locus (HLA matching < 8/8 antigens) - Recipient of allo-SCT from a haploidentical family donor; and recipients of cord blood transplant as a graft source - Prior systemic AML-directed treatments given at any time after allo-SCT (including DLI) - Prior systemic cancer-directed treatments or investigational modalities ≤ 5 half-lives or 4 weeks prior to starting study, whichever is longer - GI disorders that may prevent the intake and absorption of oral siremadlin (eg, diarrhea, uncontrolled nausea/vomiting, GI bleeding, etc). - Any concurrent severe and/or active uncontrolled bacterial, viral or fungal infection requiring parenteral antibacterial, antiviral or antifungal therapy. Prophylactic antimicrobial use (oral or parenteral) is allowed. - Participants who require treatment with moderate or strong CYP3A inducers within 14 days prior to starting study treatment, or are expected to receive moderate or strong CYP3A inducers during the entire study - Cardiac or cardiac repolarization abnormality, that are clinically significant Other protocol defined inclusion/exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Study to Assess Change in Disease Activity and Adverse Events of Oral Venetoclax With Intravenous (IV) Obinutuzumab in Adult Participants With Recurring Chronic Lymphocytic Leukemia (CLL)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=51005&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Cll, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Documented diagnosis of chronic lymphocytic leukemia (CLL) that requires treatment for CLL according to International Workshop for Chronic Lymphocytic Leukemia (iwCLL) 2018 criteria. * Previously completed venetoclax + anti-CD20 antibody +/- X regimen as a fixed duration first-line (1L) therapy and achieved documented response, defined as complete remission, complete remission with incomplete marrow recovery, partial remission, or nodular partial remission. * More than 24 months (Cohort 1) or 12-24 months (Cohort 2) have elapsed between last dose of venetoclax and disease progression after completion of 1L treatment. Exclusion Criteria: - Received intervening treatment for CLL after completing previous treatment with a venetoclax + anti-CD20 antibody +/- X regimen.}') You can take part if: Inclusion Criteria: * Documented diagnosis of chronic lymphocytic leukemia (CLL) that requires treatment for CLL according to International Workshop for Chronic Lymphocytic Leukemia (iwCLL) 2018 criteria. * Previously completed venetoclax + anti-CD20 antibody +/- X regimen as a fixed duration first-line (1L) therapy and achieved documented response, defined as complete remission, complete remission with incomplete marrow recovery, partial remission, or nodular partial remission. * More than 24 months (Cohort 1) or 12-24 months (Cohort 2) have elapsed between last dose of venetoclax and disease progression after completion of 1L treatment. Exclusion Criteria: - Received intervening treatment for CLL after completing previous treatment with a venetoclax + anti-CD20 antibody +/- X regimen.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Study Comparing Blinatumomab Alternating With Low-intensity Chemotherapy Versus Standard of Care Chemotherapy for Older Adults With Newly Diagnosed Philadelphia-negative B-cell Precursor Acute Lymphoblastic Leukemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=50598&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "- Age ≥ 55 years at the time of informed consent. OR Age 40 to \\ 10 x upper limit of normal (ULN) (liver cirrhosis must be confirmed by biopsy) * body mass index (BMI) ≥ 40 combined with relevant comorbidities such as metabolic syndrome * Any further combination of documented severe comorbidities that the investigator judges to be incompatible with administering an intensive pediatric based, adult adapted standard chemotherapy regimen but still compatible with the suggested protocol for older participants in both the experimental and the SOC arm. The participant history will be reviewed by the medical monitor during screening to determine enrollment acceptability based on a standard list with types of comorbidities allowed. * Participants with newly diagnosed Philadelphia (Ph)-negative B-cell precursor acute lymphoblastic leukemia (ALL) * Eastern Cooperative Oncology Group (ECOG) performance status ≤ 2, higher ECOG score allowed if due to underlying leukemia * All participants must have adequate organ function as defined below: * renal: estimated glomerular filtration rate based on MDRD calculation ≥ 50 mL/min/1.73 m\\^2 * liver function: total bilirubin ≤ 2x upper limit of normal (ULN; unless Gilbert's Disease or if liver involvement with leukemia); exception for participants 40 to \\ 10 x ULN (liver cirrhosis must be confirmed by biopsy) * cardiac: left ventricular ejection fraction (LVEF) ≥ 50% and no clinically significant, uncontrolled, or active cardiovascular disease (eg, myocardial infarction or stroke within 3 months). Consult with medical monitor as needed. Exclusion Criteria: * Active central nervous system (CNS) leukemia (i.e., CNS 3 leukemia, confirmed by lumbar puncture) not resolved with IT chemotherapy during screening. * History of other malignancy within the past 3 years, with the following exceptions: * Malignancy treated with curative intent and with no known active disease present for ≥ 3 years before enrollment and felt to be at low risk for recurrence by the treating physician * Adequately treated non-melanoma skin cancer or lentigo maligna without evidence of disease * Adequately treated cervical carcinoma in situ without evidence of disease * Adequately treated breast ductal carcinoma in situ without evidence of disease * Prostatic intraepithelial neoplasia without evidence of prostate cancer * Adequately treated urothelial papillary noninvasive carcinoma or carcinoma in situ * Clinically relevant CNS pathology or event such as epilepsy, childhood or adult seizure, paresis, aphasia, stroke, severe brain injuries, dementia, Parkinson's disease, cerebellar disease, organic brain syndrome, or psychiatric conditions that preclude the use of high dose of corticosteroids * Current autoimmune disease or history of autoimmune disease with potential CNS involvement * Known infection with human immunodeficiency virus (HIV) * Known infection with chronic or active infection with hepatitis B (eg, hepatitis b surface \\[HBs\\] antigen reactive or quantifiable hepatitis b virus \\[HBV\\] viral load) or hepatitis C virus (HCV) (eg, HCV RNA \\[qualitative\\] is detected). Active hepatitis B and C based on the following results: * positive for hepatitis B surface antigen (HepBsAg) (indicative of chronic hepatitis B or recent acute hepatitis B) * negative HepBsAg and positive for hepatitis B core antibody: negative HBV DNA by PCR result is necessary to enroll. * positive Hepatitis C virus antibody (HepCAb): negative hepatitis C virus RNA by PCR result is necessary to enroll. * Participant with symptoms and/or clinical signs and/or radiographic and/or sonographic signs that indicate an acute or uncontrolled chronic infection. * Cancer chemotherapy for this newly diagnosed B cell ALL before the start of protocol-required therapy with the exception of IT chemotherapy or optional pre-phase (debulking) chemotherapy. Radiation to a spot lesion such as chloroma or lytic lesion of bone or vertebrae for pain or vertebral stabilization is allowed.}') You can take part if: Inclusion Criteria: - Age ≥ 55 years at the time of informed consent. OR Age 40 to < 55 years of age if at least 1 of the following comorbidities at the time of informed consent: * history of grades 3 and 4 pancreatitis * diabetes mellitus with end-organ damage * severe liver disease such as cirrhosis stage 2 with portal hypertension or history of esophageal variceal bleeding and aspartate transaminase (AST)/alanine aminotransferase (ALT) > 10 x upper limit of normal (ULN) (liver cirrhosis must be confirmed by biopsy) * body mass index (BMI) ≥ 40 combined with relevant comorbidities such as metabolic syndrome * Any further combination of documented severe comorbidities that the investigator judges to be incompatible with administering an intensive pediatric based, adult adapted standard chemotherapy regimen but still compatible with the suggested protocol for older participants in both the experimental and the SOC arm. The participant history will be reviewed by the medical monitor during screening to determine enrollment acceptability based on a standard list with types of comorbidities allowed. * Participants with newly diagnosed Philadelphia (Ph)-negative B-cell precursor acute lymphoblastic leukemia (ALL) * Eastern Cooperative Oncology Group (ECOG) performance status ≤ 2, higher ECOG score allowed if due to underlying leukemia * All participants must have adequate organ function as defined below: * renal: estimated glomerular filtration rate based on MDRD calculation ≥ 50 mL/min/1.73 m^2 * liver function: total bilirubin ≤ 2x upper limit of normal (ULN; unless Gilbert's Disease or if liver involvement with leukemia); exception for participants 40 to < 55 years of age if they have a comorbidity listed above: severe liver disease such as cirrhosis stage 2 with portal hypertension or history of esophageal variceal bleeding and AST/ALT > 10 x ULN (liver cirrhosis must be confirmed by biopsy) * cardiac: left ventricular ejection fraction (LVEF) ≥ 50% and no clinically significant, uncontrolled, or active cardiovascular disease (eg, myocardial infarction or stroke within 3 months). Consult with medical monitor as needed. Exclusion Criteria: * Active central nervous system (CNS) leukemia (i.e., CNS 3 leukemia, confirmed by lumbar puncture) not resolved with IT chemotherapy during screening. * History of other malignancy within the past 3 years, with the following exceptions: * Malignancy treated with curative intent and with no known active disease present for ≥ 3 years before enrollment and felt to be at low risk for recurrence by the treating physician * Adequately treated non-melanoma skin cancer or lentigo maligna without evidence of disease * Adequately treated cervical carcinoma in situ without evidence of disease * Adequately treated breast ductal carcinoma in situ without evidence of disease * Prostatic intraepithelial neoplasia without evidence of prostate cancer * Adequately treated urothelial papillary noninvasive carcinoma or carcinoma in situ * Clinically relevant CNS pathology or event such as epilepsy, childhood or adult seizure, paresis, aphasia, stroke, severe brain injuries, dementia, Parkinson's disease, cerebellar disease, organic brain syndrome, or psychiatric conditions that preclude the use of high dose of corticosteroids * Current autoimmune disease or history of autoimmune disease with potential CNS involvement * Known infection with human immunodeficiency virus (HIV) * Known infection with chronic or active infection with hepatitis B (eg, hepatitis b surface [HBs] antigen reactive or quantifiable hepatitis b virus [HBV] viral load) or hepatitis C virus (HCV) (eg, HCV RNA [qualitative] is detected). Active hepatitis B and C based on the following results: * positive for hepatitis B surface antigen (HepBsAg) (indicative of chronic hepatitis B or recent acute hepatitis B) * negative HepBsAg and positive for hepatitis B core antibody: negative HBV DNA by PCR result is necessary to enroll. * positive Hepatitis C virus antibody (HepCAb): negative hepatitis C virus RNA by PCR result is necessary to enroll. * Participant with symptoms and/or clinical signs and/or radiographic and/or sonographic signs that indicate an acute or uncontrolled chronic infection. * Cancer chemotherapy for this newly diagnosed B cell ALL before the start of protocol-required therapy with the exception of IT chemotherapy or optional pre-phase (debulking) chemotherapy. Radiation to a spot lesion such as chloroma or lytic lesion of bone or vertebrae for pain or vertebral stabilization is allowed.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study Evaluating the Safety, Efficacy, and Pharmacokinetics of Mosunetuzumab and a Combined Regimen of Mosunetuzumab and Venetoclax in Participants With Relapsed or Refractory Chronic Lymphocytic Leukemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=26326&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Have a diagnosis of CLL requiring treatment according to the International Workshop on CLL (iwCLL) criteria (Hallek et al 2018) * Eastern Cooperative Oncology Group (ECOG) performance score (PS) of ≤ 2 * Adequate bone marrow (BM) function independent of growth factor or transfusion support, within 2 weeks of screening, at screening as defined by the protocol unless cytopenia is clearly due to marrow involvement of CLL * Adequate liver function unless directly attributable to the participant's CLL * Life expectancy \\> 6 months * For women of childbearing potential: agreement to remain abstinent (refrain from heterosexual intercourse) or use contraceptive methods that result in a failure rate of \\ You can take part if: Inclusion Criteria: * Have a diagnosis of CLL requiring treatment according to the International Workshop on CLL (iwCLL) criteria (Hallek et al 2018) * Eastern Cooperative Oncology Group (ECOG) performance score (PS) of ≤ 2 * Adequate bone marrow (BM) function independent of growth factor or transfusion support, within 2 weeks of screening, at screening as defined by the protocol unless cytopenia is clearly due to marrow involvement of CLL * Adequate liver function unless directly attributable to the participant's CLL * Life expectancy > 6 months * For women of childbearing potential: agreement to remain abstinent (refrain from heterosexual intercourse) or use contraceptive methods that result in a failure rate of < 1% per year, and agreement to refrain from donating eggs during the treatment period and for at least 3 months after the last dose of mosunetuzumab and 3 months after the last dose of tocilizumab (if applicable) * For men: agreement to remain abstinent (refrain from heterosexual intercourse) or use a condom, and agreement to refrain from donating sperm as defined by the protocol Inclusion Criteria Specific to Arm B: * Participants must have been taking a BTKi for at least 12 months, have demonstrated evidence of progressive disease while receiving the BTKi and require additional salvage therapy as assessed by their treating physician. Participants should be able to continue their previously prescribed BTKi at a stable dose throughout the study screening period and for the first two cycles of mosunetuzumab administration Inclusion Criteria Specific to Arm C: * Non-US participants only Exclusion Criteria: * Pregnant or breastfeeding, or intending to become pregnant during the study or within 3 months after the final dose of mosunetuzumab and tocilizumab or within 30 days after the final dose of venetoclax (if applicable) * Participants who have received any of the following treatments prior to study entry: treatment with mosunetuzumab or other CD20/CD3-directed bispecific antibodies; allogenic stem cell transplant * Participants who have received any of the following treatments, whether investigational or approved, within the respective time periods prior to initiation of study treatment: radiotherapy within 2 weeks prior to the first dose of study treatment; autologous stem cell transplant within 100 days prior to first study treatment; CAR T-cell therapy within 30 days before first study treatment; prior use of any monoclonal antibodies, radioimmunoconjugates, or antibody-drug conjugates for anti-CLL treatment within 4 weeks before first dose of study treatment; systemic immunosuppressive medications (including but not limited to cyclophosphamide, azathioprine, methotrexate, thalidomide, and anti-tumor necrosis factor agents) within 2 weeks prior to the first dose of study treatment; any other anti-cancer therapy, whether investigational or approved, including but not limited to chemotherapy within 4 weeks prior to initiation of study treatment (except for participants enrolled in Arm B, where overlapping therapy is permitted; other prior cancer immunotherapy not explicitly defined by the protocol is to be discussed with the medical monitor to determine eligibility * Received a live, attenuated vaccine within 4 weeks before the first dose of study treatment, or in whom it is anticipated that such a vaccine will be required during the study period or within 5 months after the final dose of study treatment * Transformation of CLL to aggressive non-Hodgkin's lymphoma (NHL) * History of severe allergic or anaphylactic reactions to humanized or murine monoclonal antibody therapy (or recombinant antibody-related fusion proteins) * Contraindication to tocilizumab * History of prior malignancy except for conditions defined by the protocol * Participants with infections requiring intravenous (IV) treatment with antibiotics or hospitalization within the last 4 weeks prior to enrollment or known active bacterial, viral (including SARS-CoV-2), fungal, mycobacterial, parasitic, or other infection (excluding fungal infections of nail beds) at study enrollment * Evidence of any significant concomitant disease that could affect compliance with the protocol or interpretation of results * Recent major surgery within 4 weeks prior to first study treatment administration, with the exception of protocol-mandated procedures (e.g., tumor biopsies and bone marrow biopsies) * Positive SARS-CoV-2 test within 7 days prior to enrollment Exclusion Criteria Specific to Arm C: * Have received venetoclax therapy within 12 months prior to first study treatment administration * Participants with known infection with HIV or human T-cell leukemia virus 1 (HTLV1) * HIV testing will be performed in countries where mandatory testing by health authorities is required * HTLV testing is required in participants from endemic countries * Participants with uncontrolled autoimmune hemolytic anemia or immune thrombocytopenia * Participants who have received the following: strong and moderate CYP3A inhibitors within 7 days prior to the initiation of study treatment; strong and moderate CYP3A inducers within 7 days prior to the initiation of study treatment; steroid therapy for anti-neoplastic intent with the exception of inhaled steroids for asthma, topical steroids, or replacement/stress corticosteroids within 7 days prior to the first dose of study drug administration * Have consumed grapefruit, grapefruit products, Seville oranges (including marmalade containing Seville oranges), or star fruit within 3 days prior to the first dose of study drug and throughout venetoclax administration * Inability to swallow a large number of tablets * Malabsorption syndrome or other condition that precludes enteral route of administration * Known allergy to both xanthine oxidase inhibitors and rasburicase",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Phase III placebo-controlled efficacy and safety study of mocravimod as an adjunctive and maintenance treatment in acute myeloid leukemia patients undergoing allogeneic hematopoietic cell transplantation",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=2841&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Leukemia",
    "locations": "Multiple healthcare locations around the world",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Subjects with a diagnosis of AML (excluding acute promyelocytic leukemia) according to the World Health Organization (WHO) 2022 classification of AML and related precursor neoplasms, including AML with myelodysplasia-related gene mutations. 2. Subjects with European LeukemiaNet (ELN) high-risk or intermediate-risk AML in CR1, intermediate-risk AML in CR1, or AML of any risk in CR2. (Complete remission with incomplete count recovery [CRi] is also allowable). 3. Subjects planned to undergo allogeneic HCT 4. Life expectancy ≥6 months at screening 5. Eastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 6. Male or female, age ≥18 years and ≤75 years Previous inclusion criteria: 1. Subjects with a diagnosis of AML (excluding acute promyelocytic leukemia) according to the World Health Organization (WHO) 2016 classification of AML and related precursor neoplasms, including secondary AML after an antecedent hematological disease (e.g. myelodysplastic syndrome) and therapy-related AML 2. Subjects with European LeukemiaNet (ELN) high risk AML in CR1, intermediate-risk AML in CR1 if MRDpos, or AML of any risk in CR2. Complete remission is defined as: You can take part if: Current inclusion criteria: 1. Subjects with a diagnosis of AML (excluding acute promyelocytic leukemia) according to the World Health Organization (WHO) 2022 classification of AML and related precursor neoplasms, including AML with myelodysplasia-related gene mutations. 2. Subjects with European LeukemiaNet (ELN) high-risk or intermediate-risk AML in CR1, intermediate-risk AML in CR1, or AML of any risk in CR2. (Complete remission with incomplete count recovery [CRi] is also allowable). 3. Subjects planned to undergo allogeneic HCT 4. Life expectancy ≥6 months at screening 5. Eastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 6. Male or female, age ≥18 yea",
    "location_panel": "Multiple healthcare locations around the world"
  },
  {
    "title": "Study to Evaluate Safety and Tolerability of CC-91633 (BMS-986397) in Participants With Relapsed or Refractory Acute Myeloid Leukemia or Relapsed or Refractory Higher-Risk Myelodysplastic Syndromes",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=25851&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Myelodysplastic Syndrome, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Participants must satisfy the criteria below to be enrolled in the Dose Escalation (Part A) or the Dose Expansion (Part B) of this study. * Participant is ≥ 18 years of age, at the time of signing the ICF. * Participant must understand and voluntarily sign an ICF prior to any study-related assessments/procedures being conducted. * Participant is willing and able to adhere to the study visit schedule and other protocol requirements. * Relapsed or refractory acute myeloid leukemia (R/R AML) and relapsed or refractory higher-risk myelodysplastic syndromes (R/R HR-MDS) as defined by the World Health Organization (WHO) criteria who have failed or are ineligible for all available therapies which may provide clinical benefit * Participant has Eastern Cooperative Oncology Group Performance Status of 0 to 2. * Participants must have the following screening laboratory values: * Total White Blood Cell count (WBC) \\ You can take part if: Inclusion Criteria: Participants must satisfy the criteria below to be enrolled in the Dose Escalation (Part A) or the Dose Expansion (Part B) of this study. * Participant is ≥ 18 years of age, at the time of signing the ICF. * Participant must understand and voluntarily sign an ICF prior to any study-related assessments/procedures being conducted. * Participant is willing and able to adhere to the study visit schedule and other protocol requirements. * Relapsed or refractory acute myeloid leukemia (R/R AML) and relapsed or refractory higher-risk myelodysplastic syndromes (R/R HR-MDS) as defined by the World Health Organization (WHO) criteria who have failed or are ineligible for all available therapies which may provide clinical benefit * Participant has Eastern Cooperative Oncology Group Performance Status of 0 to 2. * Participants must have the following screening laboratory values: * Total White Blood Cell count (WBC) < 25 x 109/L prior to first infusion. * Aspartate aminotransferase (AST)/serum glutamic oxaloacetic transaminase (SGOT) and alanine aminotransferase (ALT)/serum glutamic pyruvic transaminase (SGPT) ≤ 3.0 x upper limit of normal (ULN), unless considered due to leukemic organ involvement, in which case AST and ALT can be ≤ 5.0 x ULN. * Uric acid ≤ 7.5 mg/dL (446 μmol/L). * Serum total bilirubin ≤ 1.5 x ULN, unless considered due to Gilbert's syndrome * Estimated serum creatinine clearance of ≥ 60 mL/min using the Cockcroft-Gault equation. Measured creatinine clearance from a 24-hour urine collection is acceptable if clinically indicated. * INR < 1.5 x ULN and partial thromboplastin time (PTT) < 1.5 x ULN. Exclusion Criteria: The presence of any of the following will exclude a participant from enrollment: * Participant has any condition, including active or uncontrolled infection, or the presence of laboratory abnormalities, which places the participant at unacceptable risk if the participant were to participate in the study. * Any other significant medical condition, laboratory abnormality, or psychiatric illness which places the participant at unacceptable risk if he/she were to participate in the study or that would prevent the participant from complying with the study. * Participant has any condition that confounds the ability to interpret data from the study. * Participants with acute promyelocytic leukemia. * Participants with clinical symptoms suggesting active central nervous system (CNS) leukemia or known CNS leukemia. * Participants with immediately life-threatening, severe complications of leukemia such as disseminated/uncontrolled infection, uncontrolled bleeding, and/or uncontrolled disseminated intravascular coagulation. * Participants with impaired cardiac function or clinically significant cardiac diseases, * Participants who have undergone major surgery ≤ 2 weeks prior to starting CC-91633. Participants must have recovered from any clinically significant effects of recent surgery. * Pregnant or nursing individuals. * Participants with known human immunodeficiency virus infection. * Participants with known chronic, active hepatitis B virus or hepatitis C virus C (HCV) infection. * Participants with ongoing treatment with chronic, therapeutic dosing of anticoagulants (eg, warfarin, low molecular weight heparin, Factor Xa inhibitors). * Participants with history of concurrent second cancers requiring active, ongoing systemic treatment * Participants with clinically significant diarrhea, vomiting or malabsorption felt to limit absorption of orally administered medications. * Participants with known or suspected hypersensitivity to any of the components or excipients of the study treatment or to similar class drugs (eg, lenalidomide).",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of Nemtabrutinib Plus Venetoclax vs Venetoclax + Rituximab (VR) in Second-line (2L) + Relapsed/Refractory (R/R) Chronic Lymphocytic Leukemia/Small Lymphocytic Lymphoma (CLL/SLL) (MK-1026-010/BELLWAVE-010).",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=50376&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Cll, Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Confirmed diagnosis of chronic lymphocytic leukemia/small lymphocytic lymphoma (CLL/SLL) and active disease clearly documented to initiate therapy. * Deletion (Del) (17p) status, tumor protein 53 (TP53) mutation status, immunoglobulin heavy chain gene (IGHV) mutation status and Bruton's tyrosine kinase (BTK)-C481 mutation status results required before randomization for Part 2 participants only. * Relapsed or refractory to at least 1 prior available therapy. * Have at least 1 marker of disease burden. * Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days before randomization. * Has a life expectancy of at least 3 months. * Has the ability to swallow and retain oral medication. * Participants who are hepatitis B surface antigen (HBsAg) positive are eligible if they have received hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV deoxyribonucleic acid (DNA) viral load before randomization. * Participants with history of hepatitis C virus (HCV) infection are eligible if HCV ribonucleic acid (RNA) viral load is undetectable at screening. * Participants with human immunodeficiency virus (HIV) who meet ALL eligibility criteria. * Participants with adequate organ function with specimens collected within 7 days before the start of study intervention. * If capable of producing sperm, participant agrees to eliminate Nemtabrutinib: 12 days, Venetoclax: 1 month (30 days), Rituximab (rituximab biosimilar): not applicable; abstains from penile-vaginal intercourse as their preferred and usual lifestyle; OR uses prescribed contraception. * Participant assigned female sex at birth are eligible to participate if not pregnant or breastfeeding and are not a person of childbearing potential (POCBP) OR is a POCBP and uses a contraceptive method that is highly effective, has a negative highly sensitive pregnancy test, and abstains from breastfeeding. Exclusion Criteria: * Has an active hepatitis B virus/ hepatitis C virus (HBV/HCV) infection. * Has gastrointestinal (GI) dysfunction that may affect drug absorption. * Has a known additional malignancy that is progressing or has required active treatment within the past 3 years. * Has diagnosis of Richter Transformation or active central nervous system (CNS) involvement by CLL/SLL. * Has an active infection requiring systemic therapy, such as intravenous (IV) antibiotics, during screening. * HIV-infected participants with a history of Kaposi's sarcoma and/or Multicentric Castleman's Disease and/or acquired immune deficiency syndrome (AIDS)-defining opportunistic infection in the past 12 months before screening. * Has QT interval corrected (QTc) prolongation or other significant electrocardiogram (ECG) abnormalities. * Has a known allergy/sensitivity to nemtabrutinib or contraindication to venetoclax/rituximab (or rituximab biosimilar), or any of the excipients. * Has history of severe bleeding disorders (eg, hemophilia). * Has received prior systemic anticancer therapy within 5 half-lives or 4 weeks (if prior therapy was a monoclonal antibody) before randomization. * Has received prior B-cell lymphoma 2 inhibitor(s) (BCL2i) including venetoclax or Non-covalent Bruton's tyrosine kinase inhibitor (BTKi). * Is currently being treated with p-glycoprotein (P-gp) substrates with a narrow therapeutic index, cytochrome P450 3A (CYP3A) strong or moderate inducers or CYP3A strong inhibitors. * Has received a live or live attenuated vaccine within 30 days before the first dose of study intervention. * Has received an investigational agent or has used an investigational device within 4 weeks before study intervention administration. * Has a known psychiatric or substance use disorder that would interfere with the participant's ability to cooperate with the requirements of the study. * Participants who have not adequately recovered from major surgery or have ongoing surgical complications.}') You can take part if: Inclusion Criteria: * Confirmed diagnosis of chronic lymphocytic leukemia/small lymphocytic lymphoma (CLL/SLL) and active disease clearly documented to initiate therapy. * Deletion (Del) (17p) status, tumor protein 53 (TP53) mutation status, immunoglobulin heavy chain gene (IGHV) mutation status and Bruton's tyrosine kinase (BTK)-C481 mutation status results required before randomization for Part 2 participants only. * Relapsed or refractory to at least 1 prior available therapy. * Have at least 1 marker of disease burden. * Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days before randomization. * Has a life expectancy of at least 3 months. * Has the ability to swallow and retain oral medication. * Participants who are hepatitis B surface antigen (HBsAg) positive are eligible if they have received hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV deoxyribonucleic acid (DNA) viral load before randomization. * Participants with history of hepatitis C virus (HCV) infection are eligible if HCV ribonucleic acid (RNA) viral load is undetectable at screening. * Participants with human immunodeficiency virus (HIV) who meet ALL eligibility criteria. * Participants with adequate organ function with specimens collected within 7 days before the start of study intervention. * If capable of producing sperm, participant agrees to eliminate Nemtabrutinib: 12 days, Venetoclax: 1 month (30 days), Rituximab (rituximab biosimilar): not applicable; abstains from penile-vaginal intercourse as their preferred and usual lifestyle; OR uses prescribed contraception. * Participant assigned female sex at birth are eligible to participate if not pregnant or breastfeeding and are not a person of childbearing potential (POCBP) OR is a POCBP and uses a contraceptive method that is highly effective, has a negative highly sensitive pregnancy test, and abstains from breastfeeding. Exclusion Criteria: * Has an active hepatitis B virus/ hepatitis C virus (HBV/HCV) infection. * Has gastrointestinal (GI) dysfunction that may affect drug absorption. * Has a known additional malignancy that is progressing or has required active treatment within the past 3 years. * Has diagnosis of Richter Transformation or active central nervous system (CNS) involvement by CLL/SLL. * Has an active infection requiring systemic therapy, such as intravenous (IV) antibiotics, during screening. * HIV-infected participants with a history of Kaposi's sarcoma and/or Multicentric Castleman's Disease and/or acquired immune deficiency syndrome (AIDS)-defining opportunistic infection in the past 12 months before screening. * Has QT interval corrected (QTc) prolongation or other significant electrocardiogram (ECG) abnormalities. * Has a known allergy/sensitivity to nemtabrutinib or contraindication to venetoclax/rituximab (or rituximab biosimilar), or any of the excipients. * Has history of severe bleeding disorders (eg, hemophilia). * Has received prior systemic anticancer therapy within 5 half-lives or 4 weeks (if prior therapy was a monoclonal antibody) before randomization. * Has received prior B-cell lymphoma 2 inhibitor(s) (BCL2i) including venetoclax or Non-covalent Bruton's tyrosine kinase inhibitor (BTKi). * Is currently being treated with p-glycoprotein (P-gp) substrates with a narrow therapeutic index, cytochrome P450 3A (CYP3A) strong or moderate inducers or CYP3A strong inhibitors. * Has received a live or live attenuated vaccine within 30 days before the first dose of study intervention. * Has received an investigational agent or has used an investigational device within 4 weeks before study intervention administration. * Has a known psychiatric or substance use disorder that would interfere with the participant's ability to cooperate with the requirements of the study. * Participants who have not adequately recovered from major surgery or have ongoing surgical complications.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of Nemtabrutinib (MK-1026) Versus Comparator (Investigator's Choice of Ibrutinib or Acalabrutinib) in First Line (1L) Chronic Lymphocytic Leukemia (CLL)/ Small Lymphocytic Lymphoma (SLL) (MK-1026-011/BELLWAVE-011)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=49869&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Cll, Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "The main inclusion criteria include but are not limited to the following: * Confirmed diagnosis of CLL/SLL and active disease clearly documented to have a need to initiate therapy. * Has at least 1 marker of disease burden. * Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days before randomization. * Has the ability to swallow and retain oral medication. * Participants who are hepatitis B surface antigen (HBsAg) positive are eligible if they have received hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV deoxyribonucleic acid (DNA) viral load before randomization. * Participants with history of hepatitis C virus (HCV) infection are eligible if HCV ribonucleic acid (RNA) viral load is undetectable at screening. * Participants with human immunodeficiency virus (HIV) who meet ALL eligibility criteria. Exclusion Criteria: The main exclusion criteria include but are not limited to the following: * Has an active hepatitis B virus/ hepatitis C virus (HBV/HCV) infection. * Has gastrointestinal (GI) dysfunction that may affect drug absorption. * Has diagnosis of Richter Transformation or active central nervous system (CNS) involvement by CLL/SLL. * Has had acquired immune deficiency syndrome (AIDS)-defining opportunistic infection in the past 12 months before screening. * Has clinically significant cardiovascular disease. * Has hypersensitivity to nemtabrutinib or contraindication to ibrutinib or acalabrutinib, or any of the excipients. * Has history of severe bleeding disorder. * Has history of second malignancy, unless potentially curative treatment has been completed with no evidence of malignancy for 2 years. * Has received any systemic anticancer therapy for CLL/SLL. * Is currently being treated with p-glycoprotein (P-gp) substrates with a narrow therapeutic index, cytochrome P450 3A (CYP3A) strong or moderate inducers or CYP3A strong inhibitors. * Received prior radiotherapy within 2 weeks of start of study intervention, or radiation-related toxicities, requiring corticosteroids. * Received a live or live-attenuated vaccine within 30 days before the first dose of study intervention. Administration of killed vaccines are allowed. * Has received an investigational agent or has used an investigational device within 4 weeks before study intervention administration. * Has active infection requiring systemic therapy. * Participants who have not adequately recovered from major surgery or have ongoing surgical complications.}') You can take part if: Inclusion Criteria: The main inclusion criteria include but are not limited to the following: * Confirmed diagnosis of CLL/SLL and active disease clearly documented to have a need to initiate therapy. * Has at least 1 marker of disease burden. * Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days before randomization. * Has the ability to swallow and retain oral medication. * Participants who are hepatitis B surface antigen (HBsAg) positive are eligible if they have received hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV deoxyribonucleic acid (DNA) viral load before randomization. * Participants with history of hepatitis C virus (HCV) infection are eligible if HCV ribonucleic acid (RNA) viral load is undetectable at screening. * Participants with human immunodeficiency virus (HIV) who meet ALL eligibility criteria. Exclusion Criteria: The main exclusion criteria include but are not limited to the following: * Has an active hepatitis B virus/ hepatitis C virus (HBV/HCV) infection. * Has gastrointestinal (GI) dysfunction that may affect drug absorption. * Has diagnosis of Richter Transformation or active central nervous system (CNS) involvement by CLL/SLL. * Has had acquired immune deficiency syndrome (AIDS)-defining opportunistic infection in the past 12 months before screening. * Has clinically significant cardiovascular disease. * Has hypersensitivity to nemtabrutinib or contraindication to ibrutinib or acalabrutinib, or any of the excipients. * Has history of severe bleeding disorder. * Has history of second malignancy, unless potentially curative treatment has been completed with no evidence of malignancy for 2 years. * Has received any systemic anticancer therapy for CLL/SLL. * Is currently being treated with p-glycoprotein (P-gp) substrates with a narrow therapeutic index, cytochrome P450 3A (CYP3A) strong or moderate inducers or CYP3A strong inhibitors. * Received prior radiotherapy within 2 weeks of start of study intervention, or radiation-related toxicities, requiring corticosteroids. * Received a live or live-attenuated vaccine within 30 days before the first dose of study intervention. Administration of killed vaccines are allowed. * Has received an investigational agent or has used an investigational device within 4 weeks before study intervention administration. * Has active infection requiring systemic therapy. * Participants who have not adequately recovered from major surgery or have ongoing surgical complications.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study to Evaluate the Risk of Tumor Lysis Syndrome (TLS) in Adult Participants Receiving Oral Venetoclax in Combination With Intravenously Infused Obinutuzumab or Oral Acalabrutinib for Previously Untreated Chronic Lymphocytic Leukemia (CLL)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56783&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Cll, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Diagnosis of documented, previously untreated, chronic lymphocytic leukemia (CLL) requiring treatment according to the 2018 international workshop on chronic lymphocytic leukemia (iwCLL) criteria and have a life expectancy of \\> 6 months. * Previously untreated small lymphocytic lymphoma (SLL) meeting the 2018 iwCLL criteria for treatment will also be equally considered as CLL for eligibility, screening, treatment and evaluation. * Eastern Cooperative Oncology Group (ECOG) performance status \\ = 30 mL/min using the Cockcroft-Gault formula are eligible for inclusion. Exclusion Criteria: - Active/uncontrolled infection, no Richter's transformation, no active immune thrombocytopenia.}') You can take part if: Inclusion Criteria: * Diagnosis of documented, previously untreated, chronic lymphocytic leukemia (CLL) requiring treatment according to the 2018 international workshop on chronic lymphocytic leukemia (iwCLL) criteria and have a life expectancy of > 6 months. * Previously untreated small lymphocytic lymphoma (SLL) meeting the 2018 iwCLL criteria for treatment will also be equally considered as CLL for eligibility, screening, treatment and evaluation. * Eastern Cooperative Oncology Group (ECOG) performance status <= 2. * Adequate marrow function independent of growth factor or transfusion support within 2 weeks of screening, unless cytopenia is due to marrow involvement of CLL as listed in the protocol. * Creatinine clearance (CrCl) >= 30 mL/min using the Cockcroft-Gault formula are eligible for inclusion. Exclusion Criteria: - Active/uncontrolled infection, no Richter's transformation, no active immune thrombocytopenia.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of CD19 Targeted CAR T Cell Therapy in Pediatric Patients With Relapsed or Refractory B Cell Acute Lymphoblastic Leukemia (B ALL) and Aggressive Mature B-cell Non-Hodgkin Lymphoma (B NHL)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=49591&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Male or female patients \\ You can take part if: INCLUSION CRITERIA: * Male or female patients < 18 years old at screening * Patients with ≥ 6 kg body weight at screening B ALL Cohort: r/r CD19-positive B ALL defined as: 1. Primary refractory disease defined as: 1. National Cancer Institute high risk (defined as presenting with white blood cell count ≥ 50 × 10^9 cells/L or aged ≥ 10 years at diagnosis) patients with MRD ≥ 0.01% after first-line induction and consolidation and blinatumomab (if allowed per country specific approvals and treatment guidelines). 2. Refractory B ALL if BM disease ≥ 25% after first line induction and consolidation. 3. KMT2A rearranged infant ALL with MRD ≥ 1% after first line induction and blinatumomab (if allowed per country specific approvals and treatment guidelines) or MRD ≥ 0.01% after first line induction and consolidation. 2. First relapse 1. Children's Oncology Group high risk first relapse involving BM < 36 months after initial diagnosis or an isolated extramedullary relapse < 18 months after initial diagnosis. 2. Patients with Down syndrome and infants with KMT2A rearranged are eligible with first relapse at any time. 3. Refractory disease with MRD ≥ 0.01% after re-induction for first relapse (with or without blinatumomab, if allowed per country specific approvals and treatment guidelines). 3. Second or greater relapse 4. Relapsed or refractory post-SCT: a. Relapsed or refractory disease after allogeneic transplant provided obe cel infusion occurs ≥ 3 months after SCT. 5. Philadelphia chromosome positive (Ph+) ALL: 1. Any of the above with Ph+ ALL where patient is intolerant to or has failed at least one tyrosine kinase inhibitor (TKI) or if TKI therapy is contraindicated. B NHL Cohort: r/r CD19-positive aggressive mature B NHL defined as 1 of the following: 1. Relapsed after one or more prior therapies (can include allogeneic and autologous hematopoietic SCT). 2. Primary refractory (have not achieved a CR or PR after the first line of therapy) with measurable, disease by radiological criteria at screening including the B NHL subtypes: (i) diffuse large B-cell lymphoma (DLBCL), (ii) Burkitt's lymphoma, (iii) primary mediastinal large B-cell lymphoma (PMBCL) and (iv) high-grade B-cell lymphoma (not otherwise specified). * Karnofsky (age ≥ 10 years) or Lansky (age < 10 year) performance status score ≥ 50%. * In patients with B ALL, local documentation of CD19 expression on leukemic blasts in the BM, peripheral blood, or cerebrospinal fluid (CSF) or biopsy done no more than 30 days prior to consent. In patients treated with blinatumomab, testing should be undertaken after blinatumomab therapy has been stopped. In patients with mature B NHL, CD19 expression must be confirmed in a biopsy after any CD19 targeted therapies. * Adequate renal, hepatic, pulmonary, and cardiac function. EXCLUSION CRITERIA: * Diagnosis of chronic myelogenous leukemia lymphoid in blast crisis. * History or presence of clinically relevant central nervous system (CNS) pathology unrelated to CNS leukemia. * Presence of CNS-3 disease or CNS-2 disease with neurological changes at screening. * Presence of active or uncontrolled fungal, bacterial, viral, or other infection requiring systemic antimicrobials for management. * Patients who had prior (< 3 months before obe-cel infusion) stem cell transplant. * Prior CD19 targeted therapy other than blinatumomab. * Patients who have experienced Grade ≥ 3 neurotoxicity following blinatumomab.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study to Investigate Progression-Free Survival With Sonrotoclax Plus Obinutuzumab Or Sonrotoclax Plus Rituximab Compared With Venetoclax Plus Rituximab Treatment In Patients With Relapsed and/or Refractory Chronic Lymphocytic Leukemia/Small Lymphocytic Lymphoma (CELESTIAL-RRCLL)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=57447&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All, Cll, Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Confirmed diagnosis of CLL/SLL that meets the International Workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria * Received one or more prior therapies for CLL/SLL. For each line of therapy, participants must have received at least 2 cycles of the therapy * Participants with prior BCL2i exposure are eligible if remission duration was ≥3 years with ≥2 years from last BCL2i intake * Eastern Cooperative Oncology Group (ECOG) Performance Status score of 0, 1, or 2 * Adequate organ function Exclusion Criteria: * Known active prolymphocytic leukemia or currently suspected Richter's transformation * Prior autologous stem cell transplantation or chimeric antigen receptor T-cell therapy within 3 months before first dose of study drug * Prior allogeneic stem cell transplant with active graft-versus-host disease (GVHD), requiring immunosuppressive drugs for treatment of GVHD, or have taken calcineurin inhibitors within 4 weeks prior to consent * Known central nervous system involvement by CLL/SLL * Severe or debilitating pulmonary disease * Clinically significant cardiovascular disease NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.}') You can take part if: Inclusion Criteria: * Confirmed diagnosis of CLL/SLL that meets the International Workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria * Received one or more prior therapies for CLL/SLL. For each line of therapy, participants must have received at least 2 cycles of the therapy * Participants with prior BCL2i exposure are eligible if remission duration was ≥3 years with ≥2 years from last BCL2i intake * Eastern Cooperative Oncology Group (ECOG) Performance Status score of 0, 1, or 2 * Adequate organ function Exclusion Criteria: * Known active prolymphocytic leukemia or currently suspected Richter's transformation * Prior autologous stem cell transplantation or chimeric antigen receptor T-cell therapy within 3 months before first dose of study drug * Prior allogeneic stem cell transplant with active graft-versus-host disease (GVHD), requiring immunosuppressive drugs for treatment of GVHD, or have taken calcineurin inhibitors within 4 weeks prior to consent * Known central nervous system involvement by CLL/SLL * Severe or debilitating pulmonary disease * Clinically significant cardiovascular disease NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of SNDX-5613 in Combination With Intensive Chemotherapy in Participants With Acute Myeloid Leukemias",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=57148&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Established, pathologically confirmed diagnosis of AML by World Health Organization 2022 criteria. * Previously untreated AML and eligible to receive intensive chemotherapy. * KMT2Ar, NPM1c, or NUP98r mutations identified by local laboratory prior to the first dose of SNDX-5613. * Eastern Cooperative Oncology Group performance status ≤2 and ≤1 if \\>65 years old . * Adequate liver, kidney, and cardiac function. Exclusion Criteria: * Diagnosis of acute promyelocytic leukemia. * Clinically active central nervous system leukemia (blasts detected in cerebrospinal fluid, radiographic or clinical signs and symptoms). * Fridericia's corrected QT interval (QTcF) \\>450 milliseconds (average of triplicate), diagnosis or suspicion of Long QT syndrome or family history of Long QT syndrome. * Any gastrointestinal issue of the upper gastrointestinal tract that might affect oral drug absorption or ingestion. * Cirrhosis with a Child-Pugh score of B or C. * Any of the following within the 6 months prior to study entry: myocardial infarction, uncontrolled/unstable angina, congestive heart failure (New York Heart Association Classification Class ≥II), life-threatening, uncontrolled arrhythmia, cerebrovascular accident, or transient ischemic attack. * Hepatitis B, Hepatitis C, or HIV-positive with detectable viral load. * Documented active, uncontrolled infection. * Uncontrolled disseminated intravascular coagulation. * Lactating/breast feeding or pregnant. * Use of prohibited concomitant chemotherapy, radiation therapy, or immunotherapy. * Use of strong CYP3A4 inducers or inhibitors (except for Itraconazole, Ketoconazole, Posaconazole, or Voriconazole).}') You can take part if: Inclusion Criteria: * Established, pathologically confirmed diagnosis of AML by World Health Organization 2022 criteria. * Previously untreated AML and eligible to receive intensive chemotherapy. * KMT2Ar, NPM1c, or NUP98r mutations identified by local laboratory prior to the first dose of SNDX-5613. * Eastern Cooperative Oncology Group performance status ≤2 and ≤1 if >65 years old . * Adequate liver, kidney, and cardiac function. Exclusion Criteria: * Diagnosis of acute promyelocytic leukemia. * Clinically active central nervous system leukemia (blasts detected in cerebrospinal fluid, radiographic or clinical signs and symptoms). * Fridericia's corrected QT interval (QTcF) >450 milliseconds (average of triplicate), diagnosis or suspicion of Long QT syndrome or family history of Long QT syndrome. * Any gastrointestinal issue of the upper gastrointestinal tract that might affect oral drug absorption or ingestion. * Cirrhosis with a Child-Pugh score of B or C. * Any of the following within the 6 months prior to study entry: myocardial infarction, uncontrolled/unstable angina, congestive heart failure (New York Heart Association Classification Class ≥II), life-threatening, uncontrolled arrhythmia, cerebrovascular accident, or transient ischemic attack. * Hepatitis B, Hepatitis C, or HIV-positive with detectable viral load. * Documented active, uncontrolled infection. * Uncontrolled disseminated intravascular coagulation. * Lactating/breast feeding or pregnant. * Use of prohibited concomitant chemotherapy, radiation therapy, or immunotherapy. * Use of strong CYP3A4 inducers or inhibitors (except for Itraconazole, Ketoconazole, Posaconazole, or Voriconazole).",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Real World Outcomes Using Novel Agents for AML in the UK",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=29506&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Newly diagnosed acute myeloid leukaemia 2. No prior therapies for AML, apart from hydroxyurea (or similar) for cytoreduction. Previous treatments for MDS or other conditions are allowed 3. Treated with venetoclax in combination with either azacitidine or LDAC No exclusion criteria Gilteritinib/FLT3 cohort Inclusion criteria 1. Relapsed acute myeloid leukaemia, including molecular relapse 2. Treated with FLT3 inhibitor No exclusion criteria}') You can take part if: Venetoclax cohort Inclusion criteria 1. Newly diagnosed acute myeloid leukaemia 2. No prior therapies for AML, apart from hydroxyurea (or similar) for cytoreduction. Previous treatments for MDS or other conditions are allowed 3. Treated with venetoclax in combination with either azacitidine or LDAC No exclusion criteria Gilteritinib/FLT3 cohort Inclusion criteria 1. Relapsed acute myeloid leukaemia, including molecular relapse 2. Treated with FLT3 inhibitor No exclusion criteria",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "International Randomised Phase III Clinical Trial in Children With Acute Myeloid Leukaemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=32667&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia, Acute Myeloid Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Inclusion criteria for trial entry * Diagnosis of acute myeloid leukaemia (AML) /high risk Myelodysplastic syndrome (MDS) (\\>10% blasts in the bone marrow)/isolated myeloid sarcoma (MS) (either de novo or secondary). * Age \\ 3 logs after course 2 for those with an informative molecular marker, but without an informative marker of sufficient sensitivity for flow MRD monitoring or * Patients with intermediate risk cytogenetics/molecular genetics with a MRD level \\ 3 logs after course 1 and course 2 for those with an informative molecular marker, but without an informative marker of sufficient sensitivity for flow MRD monitoring. * Written informed consent from the patient and/or parent/legal guardian. Inclusion criteria for participation in R4. * Patient meets the inclusion criteria for trial entry * Induction treatment as per MyeChild 01 protocol or treated with 1 or 2 courses of mitoxantrone \\& cytarabine ± treatment intensification with fludarabine, cytarabine \\& idarubicin (FLA-Ida) off trial. * Patient is in complete remission (CR) or CR with incomplete blood count recovery (CRi) defined as \\ 0.1% after course 1 and 2 measured by flow. If no flow MRD marker of sufficient sensitivity is identified, a molecular MRD marker with a sensitivity of \\>0.1% may be used. * Good risk cytogenetics with flow MRD \\>0.1% confirmed by a decrease in molecular MRD of \\ You can take part if: Inclusion Criteria: Inclusion criteria for trial entry * Diagnosis of acute myeloid leukaemia (AML) /high risk Myelodysplastic syndrome (MDS) (>10% blasts in the bone marrow)/isolated myeloid sarcoma (MS) (either de novo or secondary). * Age <18 years at trial entry. * No prior chemotherapy or biological therapy for AML/high risk MDS/isolated MS other than that permitted in the protocol. * Normal cardiac function defined as fractional shortening ≥28% or ejection fraction ≥55%. * Fit for protocol chemotherapy. * Documented negative pregnancy test for female patients of childbearing potential. * Patient agrees to use effective contraception (patients of child bearing potential). * Written informed consent from the patient and/or parent/legal guardian. Inclusion criteria for participation in the gemtuzumab ozogamicin dose finding study: Centres must be formally activated in order to be take part in the embedded dose escalation study. Please contact the trial office for further information. * Patient meets the inclusion criteria for trial entry. * Age: * ≥12 months for the major dose finding study * ≥ 12 weeks and <12 months for the minor dose finding study * Normal renal function defined as calculated creatinine clearance ≥90ml/min/1.73m2. * Normal hepatic function defined as total bilirubin ≤2.5 upper limit of normal (ULN) for age unless it is caused by leukaemic involvement or Gilbert's syndrome or similar disorder. * Alanine transaminase (ALT) or aspartate transaminase (AST) ≤10 x ULN for age. * Written informed consent from the patient and/or parent/legal guardian. Inclusion criteria for treatment with gemtuzumab ozogamicin for patients not participating in the gemtuzumab ozogamicin dose finding study or R2. * Patient meets the inclusion criteria for trial entry (section 4.1.1) * Age: * ≥12 months * ≥ 12 weeks * ≥28 days and <12 weeks (patients will receive a maximum of one dose of gemtuzumab ozogamicin) * Normal renal function, defined as calculated creatinine clearance ≥90 ml/min/1.73m2 * Normal hepatic function, defined as total bilirubin ≤2.5 upper limit of normal (ULN) for age and not due to leukaemic involvement or Gilbert's syndrome or similar disorder * ALT or AST ≤10 x ULN for age * Written informed consent from the patient and/or parent/legal guardian Inclusion criteria for participation in R2.(once open to randomisation in the applicable age group) • Patient meets the inclusion criteria for trial entry Patient age: * ≥12 months * ≥12 weeks (once R2 open in patients aged ≥12 weeks and <12 months) * Normal renal function defined as calculated creatinine clearance ≥90ml/min/1.73m2. * Normal hepatic function defined as total bilirubin ≤2.5 ULN for age and not due to leukaemic involvement or Gilbert's syndrome or similar disorder. * ALT or AST ≤10 x ULN for age. * Written informed consent from the patient and/or parent/legal guardian. Inclusion criteria for participation in R3. * Patient meets the inclusion criteria for trial entry * Induction treatment as per MyeChild 01 protocol or treated with 2 courses of mitoxantrone & cytarabine off trial. * Minimal residual disease (MRD) response (performed in MyeChild 01 centralised laboratories, see national MyeChild 01 Laboratory Manual): * Patients with good risk cytogenetics/molecular genetics and a MRD level <0.1% by flow after course 2, or a decrease in transcript levels of >3 logs after course 2 for those with an informative molecular marker, but without an informative marker of sufficient sensitivity for flow MRD monitoring or * Patients with intermediate risk cytogenetics/molecular genetics with a MRD level <0.1% by flow after course 1 and course 2, or a decrease in transcript levels of >3 logs after course 1 and course 2 for those with an informative molecular marker, but without an informative marker of sufficient sensitivity for flow MRD monitoring. * Written informed consent from the patient and/or parent/legal guardian. Inclusion criteria for participation in R4. * Patient meets the inclusion criteria for trial entry * Induction treatment as per MyeChild 01 protocol or treated with 1 or 2 courses of mitoxantrone & cytarabine ± treatment intensification with fludarabine, cytarabine & idarubicin (FLA-Ida) off trial. * Patient is in complete remission (CR) or CR with incomplete blood count recovery (CRi) defined as <5% blasts confirmed by flow cytometry/ molecular/FISH in a bone marrow aspirate taken within 6 weeks prior to randomisation to R4. * Patient meets one of the following criteria and is a candidate for HSCT as per the protocol: * High risk after course 1 (all patients with poor risk cytogenetics and patients with intermediate risk cytogenetics who fail to achieve CR/CRi). * Intermediate risk cytogenetics with MRD >0.1% after course 1 and 2 measured by flow. If no flow MRD marker of sufficient sensitivity is identified, a molecular MRD marker with a sensitivity of >0.1% may be used. * Good risk cytogenetics with flow MRD >0.1% confirmed by a decrease in molecular MRD of <3 logs or rising transcript levels after course 3 despite treatment intensification (FLA-Ida) and after discussion with the Clinical Co-ordinators. * Availability of a 9-10/10 human leukocyte antigen (HLA) matched family or unrelated donor or 5-8/8 matched cord blood unit with an adequate cell dose as defined by the protocol section 17.1. * Written informed consent from the patient and/or parent/legal guardian. Exclusion Criteria: Exclusion criteria for all randomisations * Acute Promyelocytic Leukaemia. * Myeloid Leukaemia of Down Syndrome. * Blast crisis of chronic myeloid leukaemia. * Relapsed or refractory AML. * Bone marrow failure syndromes. * Prior anthracycline exposure which would inhibit the delivery of study anthracyclines. * Concurrent treatment or administration of any other experimental drug or with any other biological therapy for AML/high risk MDS/isolated MS. * Pregnant or lactating females.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Quizartinib or Placebo Plus Chemotherapy in Newly Diagnosed Patients With FLT3-ITD Negative AML",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=55636&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Must be competent and able to comprehend, sign, and date an Ethics Committee (EC)- or Institutional Review Board (IRB)-approved Informed Consent Form (ICF) before performance of any trial-specific procedures or tests. * ≥18 years or the minimum legal adult age (whichever is greater) and 70 years (at Screening). * Newly diagnosed, morphologically documented primary AML based on the World Health Organization (WHO) 2016 classification (at Screening) * Eastern Cooperative Oncology Group (ECOG) performance status (at the time the participant signs their ICF) of 0-2. * Participant is receiving standard \"7+3\" induction chemotherapy regimen as specified in the protocol Key Exclusion Criteria: * Diagnosis of acute promyelocytic leukemia (APL), French-American-British classification M3 or WHO classification of APL with translocation, t(15;17)(q22;q12), or BCR-ABL positive leukemia (ie, chronic myelogenous leukemia in blast crisis); participants who undergo diagnostic workup for APL and treatment with all-trans retinoic acid (ATRA), but who are found not to have APL, are eligible (treatment with ATRA must be discontinued before starting induction chemotherapy). * Diagnosis of AML secondary to prior chemotherapy or radiotherapy for other neoplasms or autoimmune/rheumatologic conditions. * Diagnosis of AML secondary to myelodysplastic syndrome (MDS) or a myeloproliferative neoplasm (MPN) or MDS/MPNs including CMML, aCML, JMML and others. * Participants with newly diagnosed AML with FLT3-ITD mutations (FLT3-ITD \\[+\\]) present at ≥5% VAF (or ≥0.05 SR) based on a validated FLT3 mutation assay. * Prior treatment for AML, except for the following allowances: 1. Leukapheresis; 2. Treatment for hyperleukocytosis with hydroxyurea; 3. Cranial radiotherapy for central nervous system (CNS) leukostasis; 4. Prophylactic intrathecal chemotherapy; 5. Growth factor/cytokine support.}') You can take part if: Key Inclusion Criteria: * Must be competent and able to comprehend, sign, and date an Ethics Committee (EC)- or Institutional Review Board (IRB)-approved Informed Consent Form (ICF) before performance of any trial-specific procedures or tests. * ≥18 years or the minimum legal adult age (whichever is greater) and 70 years (at Screening). * Newly diagnosed, morphologically documented primary AML based on the World Health Organization (WHO) 2016 classification (at Screening) * Eastern Cooperative Oncology Group (ECOG) performance status (at the time the participant signs their ICF) of 0-2. * Participant is receiving standard \"7+3\" induction chemotherapy regimen as specified in the protocol Key Exclusion Criteria: * Diagnosis of acute promyelocytic leukemia (APL), French-American-British classification M3 or WHO classification of APL with translocation, t(15;17)(q22;q12), or BCR-ABL positive leukemia (ie, chronic myelogenous leukemia in blast crisis); participants who undergo diagnostic workup for APL and treatment with all-trans retinoic acid (ATRA), but who are found not to have APL, are eligible (treatment with ATRA must be discontinued before starting induction chemotherapy). * Diagnosis of AML secondary to prior chemotherapy or radiotherapy for other neoplasms or autoimmune/rheumatologic conditions. * Diagnosis of AML secondary to myelodysplastic syndrome (MDS) or a myeloproliferative neoplasm (MPN) or MDS/MPNs including CMML, aCML, JMML and others. * Participants with newly diagnosed AML with FLT3-ITD mutations (FLT3-ITD [+]) present at ≥5% VAF (or ≥0.05 SR) based on a validated FLT3 mutation assay. * Prior treatment for AML, except for the following allowances: 1. Leukapheresis; 2. Treatment for hyperleukocytosis with hydroxyurea; 3. Cranial radiotherapy for central nervous system (CNS) leukostasis; 4. Prophylactic intrathecal chemotherapy; 5. Growth factor/cytokine support.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "PUMA (Paediatric Osseous Marrow Assessment)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=30049&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. All patients with relapsed or high risk acute lymphoblastic or myeloblastic leukaemia planned for haemopoietic stem cell transplantation 2. Cooperative paediatric individuals and young adults (5-24-years-old) not requiring general anaesthesia or sedation for the purpose of MRI 3. Able to lie flat throughout the scan Exclusion Criteria: 1. Non cooperative patients 2. Ferromagnetic implants, contraindicating MRI 3. Claustrophobia 4. Unable to lie flat throughout the scan 5. Uncertain histological diagnosis 6. Musculoskeletal disorders 7. Metabolic disorders 8. Lack of signed parental consent and patient's verbal approval}') You can take part if: Inclusion Criteria: 1. All patients with relapsed or high risk acute lymphoblastic or myeloblastic leukaemia planned for haemopoietic stem cell transplantation 2. Cooperative paediatric individuals and young adults (5-24-years-old) not requiring general anaesthesia or sedation for the purpose of MRI 3. Able to lie flat throughout the scan Exclusion Criteria: 1. Non cooperative patients 2. Ferromagnetic implants, contraindicating MRI 3. Claustrophobia 4. Unable to lie flat throughout the scan 5. Uncertain histological diagnosis 6. Musculoskeletal disorders 7. Metabolic disorders 8. Lack of signed parental consent and patient's verbal approval",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Observational Study of Acalabrutinib in Patients With Chronic Lymphocytic Leukaemia in the United Kingdom",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=35293&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia, Chronic Lymphocytic Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Treatment-naïve CLL patients who were initiated on acalabrutinib as part of the UK Early Access Programme * Received their first dose of acalabrutinib between 1 April 2020 and 1 April 2021 * Patients aged ≥18 years old * Note: patients later found to have small lymphocytic lymphoma (SLL) may also be included in the EAP. Exclusion Criteria: - None listed in study protocol}') You can take part if: The study population will include treatment-naïve patients with chronic lymphocytic lymphoma (CLL)* who meet the following inclusion criteria: * Treatment-naïve CLL patients who were initiated on acalabrutinib as part of the UK Early Access Programme * Received their first dose of acalabrutinib between 1 April 2020 and 1 April 2021 * Patients aged ≥18 years old * Note: patients later found to have small lymphocytic lymphoma (SLL) may also be included in the EAP. Exclusion Criteria: - None listed in study protocol",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "AZD0486 as Monotherapy in B-cell Acute Lymphoblastic Leukaemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=49955&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia, Acute Lymphoblastic Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Age: 12 years and above (Parts A, B and C). * Participants with B-cell Acute Lymphoblastic Leukemia with CD19 expression by local lab with: 1. Bone marrow infiltration with \\>/= 5% blasts 2. Either relapsed or refractory after a minimum of 2 prior therapies or after 1 prior line of therapy if no SOC available option. 3. Philadelphia positive participants are allowed in Part A if intolerant or refractory to TKIs. * For participants older than 16 years, Eastern Cooperative Oncology Group (ECOG) Performance Status less than or equal to 2. For Participants 16 years or younger, Lansky score more or equal to 50%. The above is a summary, other inclusion criteria details may apply. Exclusion Criteria: * Active CNS involvement by B-ALL, defined by presence of ALL blasts in CSF (CNS2 and CNS3 criteria). * Isolated extramedullary disease relapse. * Testicular leukemia * History or presence of clinically relevant CNS pathology such as epilepsy, seizure, paresis, aphasia, stroke, severe brain injuries, dementia, Parkinson's disease, cerebellar disease, organic brain syndrome, or psychosis; or prior Grade 4 neurotoxicity with CAR-T or TCE therapy. * History of other malignancy (with certain exceptions). * Unresolved AEs \\>/= Grade 2, from prior therapies * Prior therapy with TCEs within 4 weeks, CAR T-cell therapy or autologous HSCT within 8 weeks or prior alloSCT within 12 weeks of start of therapy. * GVHD requiring immunosuppressive therapy within 3 weeks prior to AZD0486 treatment. The above is a summary, other exclusion criteria details may apply.}') You can take part if: Inclusion Criteria: * Age: 12 years and above (Parts A, B and C). * Participants with B-cell Acute Lymphoblastic Leukemia with CD19 expression by local lab with: 1. Bone marrow infiltration with >/= 5% blasts 2. Either relapsed or refractory after a minimum of 2 prior therapies or after 1 prior line of therapy if no SOC available option. 3. Philadelphia positive participants are allowed in Part A if intolerant or refractory to TKIs. * For participants older than 16 years, Eastern Cooperative Oncology Group (ECOG) Performance Status less than or equal to 2. For Participants 16 years or younger, Lansky score more or equal to 50%. The above is a summary, other inclusion criteria details may apply. Exclusion Criteria: * Active CNS involvement by B-ALL, defined by presence of ALL blasts in CSF (CNS2 and CNS3 criteria). * Isolated extramedullary disease relapse. * Testicular leukemia * History or presence of clinically relevant CNS pathology such as epilepsy, seizure, paresis, aphasia, stroke, severe brain injuries, dementia, Parkinson's disease, cerebellar disease, organic brain syndrome, or psychosis; or prior Grade 4 neurotoxicity with CAR-T or TCE therapy. * History of other malignancy (with certain exceptions). * Unresolved AEs >/= Grade 2, from prior therapies * Prior therapy with TCEs within 4 weeks, CAR T-cell therapy or autologous HSCT within 8 weeks or prior alloSCT within 12 weeks of start of therapy. * GVHD requiring immunosuppressive therapy within 3 weeks prior to AZD0486 treatment. The above is a summary, other exclusion criteria details may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "ACHIEVE - Efficacy and Effectiveness of Adoptive Cellular tHerapy wIth Ex-Vivo Expanded Allogeneic γδ T-lymphocytes (TCB008) for Patients With Refractory or Relapsed Acute Myeloid Leukaemia (AML)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=46490&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml, All, Leukaemia, Acute Myeloid Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Age ≥ 18 at the time of consent 2. Karnofsky performance status ≥ 70% and WHO/ECOG performance status 0 -1 at enrolment and up to 2 at the time of infusion. 3. Must be able to remain free of systemic corticosteroid (e.g., prednisolone) and other immunosuppressive therapy at screening and for at least 5 days prior to the infusion of γδ T cells. Maintenance replacement steroid after assessment of the primary endpoint is permitted. 4. Must be able to understand and sign written informed consent and willing to participate in a clinical trial for an advanced therapy investigational medicinal product (AT(I)MP). 5. For women of childbearing potential, a urine or serum pregnancy test will be performed within 7 days prior to initiating lymphodepletion. A serum pregnancy test will be performed on the day prior to the first infusion of TCB008 (i.e. day -1) and urine or serum pregnancy tests will be performed on the day of subsequent infusions with TCB008 and the results must be negative at all times that these pregnancy tests are performed. For women of childbearing potential, a serum pregnancy test will be performed at visit 17 or early termination. Patient and his/her partner must agree to use adequate contraception from the time of providing written consent through 3 months after the last study drug dose 6. Pathologically confirmed diagnosis of AML or MDS/AML confirmed according to ELN 2022 Criteria (as per International Consensus Classification of AML). 7. For Cohort A1, patients must have AML or MDS/AML that is primary refractory defined as not achieving a CR, CRi or CRh after 2 cycles of intensive or non-intensive induction chemotherapy. 8. For Cohort A2, patients with AML or MDS/AML must have previously achieved a CR, CRi or CRh (including MRD negative CR) to previous intensive or non-intensive therapy, then have experienced relapsed AML. 9. For Cohort B, patients with AML who have achieved CR, CRi or CRh but have persistent MRD by multiparameter flow cytometry-based MRD (MFC-MRD) or molecular MRD (Mol-MRD) assessed by qPCR. Included patients will not be deprived of standard of care by participating in this trial. Exclusion criteria 1. Suspected or proven active CNS disease. 2. Previous reactions to Fludarabine or Cyclophosphamide or patients at risk of Fludarabine related neurotoxicity 3. Acute promyelocytic leukaemia 4. Bisphosphonates (≤8 weeks before study entry), unless continued as a standard of care medication 5. Corticosteroids (cumulative dose of systemic steroids \\>20mg of prednisolone per day or equivalent) that cannot be discontinued 5 days prior to TCB008 infusion. 6. Antihyperlipidemic medications (e.g., statins) that cannot be discontinued prior to enrolment. 7. Cardiac failure: EF \\ 3 × ULN, aspartate aminotransferase (AST) and alanine aminotransferase (ALT) \\> 5 × ULN. 10. Neurological condition(s) which might be exacerbated by therapy or prevent assessments for neurotoxicity/ICANS. 11. GVHD of any grade or anti-GVHD treatment. 12. Lung function: symptoms of respiratory failure or \\ You can take part if: Inclusion Criteria: 1. Age ≥ 18 at the time of consent 2. Karnofsky performance status ≥ 70% and WHO/ECOG performance status 0 -1 at enrolment and up to 2 at the time of infusion. 3. Must be able to remain free of systemic corticosteroid (e.g., prednisolone) and other immunosuppressive therapy at screening and for at least 5 days prior to the infusion of γδ T cells. Maintenance replacement steroid after assessment of the primary endpoint is permitted. 4. Must be able to understand and sign written informed consent and willing to participate in a clinical trial for an advanced therapy investigational medicinal product (AT(I)MP). 5. For women of childbearing potential, a urine or serum pregnancy test will be performed within 7 days prior to initiating lymphodepletion. A serum pregnancy test will be performed on the day prior to the first infusion of TCB008 (i.e. day -1) and urine or serum pregnancy tests will be performed on the day of subsequent infusions with TCB008 and the results must be negative at all times that these pregnancy tests are performed. For women of childbearing potential, a serum pregnancy test will be performed at visit 17 or early termination. Patient and his/her partner must agree to use adequate contraception from the time of providing written consent through 3 months after the last study drug dose 6. Pathologically confirmed diagnosis of AML or MDS/AML confirmed according to ELN 2022 Criteria (as per International Consensus Classification of AML). 7. For Cohort A1, patients must have AML or MDS/AML that is primary refractory defined as not achieving a CR, CRi or CRh after 2 cycles of intensive or non-intensive induction chemotherapy. 8. For Cohort A2, patients with AML or MDS/AML must have previously achieved a CR, CRi or CRh (including MRD negative CR) to previous intensive or non-intensive therapy, then have experienced relapsed AML. 9. For Cohort B, patients with AML who have achieved CR, CRi or CRh but have persistent MRD by multiparameter flow cytometry-based MRD (MFC-MRD) or molecular MRD (Mol-MRD) assessed by qPCR. Included patients will not be deprived of standard of care by participating in this trial. Exclusion criteria 1. Suspected or proven active CNS disease. 2. Previous reactions to Fludarabine or Cyclophosphamide or patients at risk of Fludarabine related neurotoxicity 3. Acute promyelocytic leukaemia 4. Bisphosphonates (≤8 weeks before study entry), unless continued as a standard of care medication 5. Corticosteroids (cumulative dose of systemic steroids >20mg of prednisolone per day or equivalent) that cannot be discontinued 5 days prior to TCB008 infusion. 6. Antihyperlipidemic medications (e.g., statins) that cannot be discontinued prior to enrolment. 7. Cardiac failure: EF < 40%. 8. Kidney function: creatinine clearance ≤ 60 mL/min. 9. Liver function: total bilirubin > 3 × ULN, aspartate aminotransferase (AST) and alanine aminotransferase (ALT) > 5 × ULN. 10. Neurological condition(s) which might be exacerbated by therapy or prevent assessments for neurotoxicity/ICANS. 11. GVHD of any grade or anti-GVHD treatment. 12. Lung function: symptoms of respiratory failure or < 92% oxygen saturation on air. 13. Active infections that are difficult to control, including positive COVID-19 diagnosis at screening. NOTE: Active infections following lymphodepletion may exclude a patient from being able to be dosed with IMP. 14. Received autologous or allogeneic cell therapy within 4 weeks, such as donor lymphocyte infusion. 15. Received autologous or allogeneic gene modified adoptive cell therapy (e.g. CAR-T, TCR-T, CAR-NK cell therapy, etc). 16. Subject received anti-tumour treatment (chemotherapy, monoclonal antibody, or hormone) within one week of screening (hydroxycarbamide is permitted until lymphodepletion). 17. Has a known history of prior malignancy, except for; 17.a. Malignancies that were treated curatively and have not recurred within 2 years prior to study treatment 17.b. Completely resected basal cell and squamous cell skin cancers 17.c. Any malignancy considered to be indolent and that has never required therapy 17.d. Completely resected carcinoma in situ of any type 18. Pregnant or lactating women. 19. Hypersensitivity to iron-dextran or murine antibodies. 20. Patients who are active participants in other interventional clinical trials at the same time. Co-enrolment is permitted for non-interventional studies if approved by the CI. 21. The Investigator believes that there are other factors that are not suitable for inclusion or influence the patient's participation or completion of the study. 22. Considered unsuitable for further intensive therapy or expected to survive less than 3 months with conventional available treatments.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Determining the Mechanisms of Loss of CAR T Cell Persistence",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=51017&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Children and young adults (age 25 years or younger) with relapsed/refractory ALL who are planned to receive licensed CD19-targeted CAR-T cell treatment (Tisagenlecleucel) 2. Written informed consent Exclusion Criteria: 1. Patients receiving an alternate CD19-directed CAR T-cell product on a clinical trial 2. Any reason that in the opinion of the investigator, patients won't be able to adhere to the protocol}') You can take part if: Inclusion Criteria: 1. Children and young adults (age 25 years or younger) with relapsed/refractory ALL who are planned to receive licensed CD19-targeted CAR-T cell treatment (Tisagenlecleucel) 2. Written informed consent Exclusion Criteria: 1. Patients receiving an alternate CD19-directed CAR T-cell product on a clinical trial 2. Any reason that in the opinion of the investigator, patients won't be able to adhere to the protocol",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Asciminib Roll-over Study",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=28286&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Participant with PH+ CML or PH+ ALL currently receiving treatment with asciminib (single agent or in combination with imatinib, nilotinib or dasatinib), imatinib, nilotinib or bosutinib alone within a Novartis-sponsored study and, in the opinion of the Investigator, would benefit from continued treatment. 2. Participant has demonstrated compliance on the parent study protocol and is willing and able to comply with scheduled visits, treatment plans and any other study procedures. Key Exclusion Criteria: 1. Participant has been discontinued from parent study treatment. 2. Participant currently has unresolved toxicities reported as possibly related to study treatment in the parent study. 3. Participant's ongoing treatment is currently approved and reimbursed at country level. 4. Pregnant or nursing (lactating) women. 5. Women of child-bearing potential, unless they are using highly effective methods of contraception and willing to continue while taking study treatment. 6. Sexually active males receiving imatinib, nilotinib, bosutinib or dasatinib unwilling to follow the relevant contraception requirements in the local prescribing information. 7. Applicable for participants on bosutinib treatment at the end of the CABL001A2301 and on other TKIs for CABL001A2202 study that switch to asciminib treatment: * Asymptomatic (grade 2) pancreatitis if not resolved within 28 days * QTcF\\>480msec or inability to determine QTc interval * any grade 3 or 4 toxicity not resolved to grade 2 or lower within 28 days before starting asciminib treatment Other protocol-defined Inclusion/Exclusion criteria may apply.}') You can take part if: Key Inclusion Criteria: 1. Participant with PH+ CML or PH+ ALL currently receiving treatment with asciminib (single agent or in combination with imatinib, nilotinib or dasatinib), imatinib, nilotinib or bosutinib alone within a Novartis-sponsored study and, in the opinion of the Investigator, would benefit from continued treatment. 2. Participant has demonstrated compliance on the parent study protocol and is willing and able to comply with scheduled visits, treatment plans and any other study procedures. Key Exclusion Criteria: 1. Participant has been discontinued from parent study treatment. 2. Participant currently has unresolved toxicities reported as possibly related to study treatment in the parent study. 3. Participant's ongoing treatment is currently approved and reimbursed at country level. 4. Pregnant or nursing (lactating) women. 5. Women of child-bearing potential, unless they are using highly effective methods of contraception and willing to continue while taking study treatment. 6. Sexually active males receiving imatinib, nilotinib, bosutinib or dasatinib unwilling to follow the relevant contraception requirements in the local prescribing information. 7. Applicable for participants on bosutinib treatment at the end of the CABL001A2301 and on other TKIs for CABL001A2202 study that switch to asciminib treatment: * Asymptomatic (grade 2) pancreatitis if not resolved within 28 days * QTcF>480msec or inability to determine QTc interval * any grade 3 or 4 toxicity not resolved to grade 2 or lower within 28 days before starting asciminib treatment Other protocol-defined Inclusion/Exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Study to Evaluate the Safety and Tolerability of EP0042",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=31782&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "General 1. Male or female patients aged ≥ 18 years of age, at the time of informed consent, with histological or cytological confirmation of AML 2. Ability to understand and provide written informed consent before any study-specific procedures, sampling, or analyses, including access to archival tumor tissue 3. Ability to swallow and retain oral medication 4. Sufficient life expectancy to allow the patient to complete at least 1 cycle (28 days) of the treatment period. 5. Eastern Cooperative Oncology Group (ECOG) Performance Status of 0-2 at screening 6. In the opinion of the investigator, all other relevant medical conditions must be well-managed and stable for at least 28 days prior to first administration of study drug 7. Patients with pathologically confirmed/documented AML or MDS, as defined by the 2022 European LeukaemiaNet (ELN) recommendations, or CMML, as defined by World Health Organization (WHO) criteria, who have relapsed from or are refractory to previous therapy and have failed all (or are not eligible for/intolerant to) available approved therapies for their disease. 8. Patients with relapsed/refractory FLT3 WT AML. 9. Previous exposure to venetoclax, hypomethylating agent and/or FLT3 inhibitors (gilteritinib, midostorin, quizartinib, sorafenib) is allowed for relapsed/refractory AML patients. 10. Mutation status of patients must be known at trial entry. 11. Female patients should either be of non-child-bearing potential or must agree to use highly effective methods of contraception from Screening until 6 months following administration of the last dose of study drug 12. Male patients must use double barrier contraception from enrolment through treatment and for 6 months following administration of the last dose of study drug 5.2 Core",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Investigating the Role of Energy Balance Modification on Health Responses in Chronic Lymphocytic Leukaemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=50734&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia, Chronic Lymphocytic Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Confirmed diagnosis of CLL (including small lymphocytic leukaemia) as per the International Workshop on CLL Guidelines. * Male or female ≥ 18 years of age * Able to walk on a treadmill or cycle on an ergometer * Pass the Physical Activity Readiness Questionnaires (PAR-Q and PAR-Q+) Exclusion Criteria: * Corticosteroid therapy initiated less than 7 days before study entry. Prednisone 10mg or less or equivalent is allowed. Topical or inhaled corticosteroids are permitted. * Secondary malignancy within 3 years of study enrollment requiring intervention except for adequately treated basal, squamous cell carcinoma or non-melanomatous skin cancer, carcinoma in situ of the cervix, superficial bladder cancer not treated with intravesical chemotherapy or BCG within 6 months, localised prostate cancer and PSA stable. * Absolute contraindications to exercise: Recent (\\ You can take part if: Inclusion Criteria: * Confirmed diagnosis of CLL (including small lymphocytic leukaemia) as per the International Workshop on CLL Guidelines. * Male or female ≥ 18 years of age * Able to walk on a treadmill or cycle on an ergometer * Pass the Physical Activity Readiness Questionnaires (PAR-Q and PAR-Q+) Exclusion Criteria: * Corticosteroid therapy initiated less than 7 days before study entry. Prednisone 10mg or less or equivalent is allowed. Topical or inhaled corticosteroids are permitted. * Secondary malignancy within 3 years of study enrollment requiring intervention except for adequately treated basal, squamous cell carcinoma or non-melanomatous skin cancer, carcinoma in situ of the cervix, superficial bladder cancer not treated with intravesical chemotherapy or BCG within 6 months, localised prostate cancer and PSA stable. * Absolute contraindications to exercise: Recent (<6 months) acute cardiac event unstable angina, uncontrolled dysrhythmias causing symptoms or hemodynamic compromise, symptomatic aortic stenosis, uncontrolled symptomatic heart failure, acute pulmonary embolus, acute myocarditis or pericarditis, suspected or known dissecting aneurism and acute systemic infection. * Significant orthopaedic limitations, musculoskeletal disease and/or injury. Due to the nature of the study, persons with known joint, muscle or other orthopaedic limitations that restrict physical activity may be excluded. * Type I diabetes mellitus or uncontrolled Type II diabetes mellitus, or chronic obstructive pulmonary disease * Uncontrolled blood pressure (≥180/90) at rest * Known concurrent HIV, Hepatitis B or Hepatitis C * Unable to comply with other study requirements",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "CiproPAL (Ciprofloxacin Prophylaxis in Acute Leukaemia)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=26412&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Paediatric patients (1-17 years inclusive) with de-novo Acute Lymphoblastic Leukaemia treated on ALLTogether-1 in the UK in the first 5 days of therapy, up to 14 days is acceptable. * Written informed consent Exclusion Criteria: * Non-participants of the ALLTogether-1 trial * Patients with Down syndrome who already receive ciprofloxacin prophylaxis * Chronic active arthritis * Other contraindication to fluoroquinolones}') You can take part if: Inclusion Criteria: * Paediatric patients (1-17 years inclusive) with de-novo Acute Lymphoblastic Leukaemia treated on ALLTogether-1 in the UK in the first 5 days of therapy, up to 14 days is acceptable. * Written informed consent Exclusion Criteria: * Non-participants of the ALLTogether-1 trial * Patients with Down syndrome who already receive ciprofloxacin prophylaxis * Chronic active arthritis * Other contraindication to fluoroquinolones",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Acalabrutinib Monotherapy vs Investigator's Choice of Treatment in Patients With CL Leukaemia and Heart Failure",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56166&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Men and women ≥ 18 years of age, at the time of signing the informed consent. 2. Eastern Cooperative Oncology Group performance status of 0 to 3 3. Left ventricular ejection fraction assessed by ECHO \\ 470 ms or QTcF \\ You can take part if: Inclusion Criteria: 1. Men and women ≥ 18 years of age, at the time of signing the informed consent. 2. Eastern Cooperative Oncology Group performance status of 0 to 3 3. Left ventricular ejection fraction assessed by ECHO < 50%. 4. Diagnosis of CLL 5. Treatment naïve or relapsed/refractory patients who received no more than 2 prior lines of systemic anti-CLL treatment. 6. Active disease per iwCLL 2018 criteria that requires treatment. 7. Meet the following laboratory parameters: 1. Absolute neutrophil count (ANC) ≥ 500 cells/μL (0.50 × 109/L). 2. Platelet count ≥ 30,000 cells/μL (30 × 109/L). 3. Serum aspartate aminotransferase and ALT ≤ 3.0 × ULN. 4. Total bilirubin ≤ 1.5 × ULN unless directly attributable to Gilbert's syndrome. 5. Estimated creatinine clearance (ie, estimated glomerular filtration rate [eGFR] using Cockcroft-Gault) ≥ 40 mL/min, or serum creatinine ≤ 2 × ULN. 8. Women and men who are sexually active and can bear children must agree to use highly effective forms of contraception while on the study and for 2 days after the last dose of acalabrutinib. 9. Patients must be willing and able to adhere to the study visit schedule, understand, and comply with other protocol requirements, and provide written informed consent and authorisation to use protected health information (in accordance with national and local patient privacy regulations). Note: vulnerable patients, as defined in the ICH GCP, are not allowed on this protocol (eg, prisoners or institutionalised patients). Exclusion Criteria: 1. Known active CNS leukaemia, leptomeningeal disease or spinal cord compression. In case of R/R patients with prior history of CNS localisation of leukaemia who received treatment are eligible provided that there is no evidence of CNS involvement at study entry as documented by cerebrospinal fluid (CSF) cytology and/or brain MRI. 2. Ongoing Richter's transformation. 3. Prior exposure to a BTKi. 4. Major surgery within 30 days before first dose of study treatment. 5. Uncontrolled haemolytic anaemia. 6. Received any investigational drug within 30 days or 5 half-lives (whichever is shorter) before first dose of study treatment. 7. Received a live virus vaccination within 28 days of first dose of study treatment. 8. History of or ongoing confirmed PML. 9. History of prior malignancy except for the following: 1. Prior history of malignancy with no evidence of active disease present for more than 3 years before screening or felt to be at low risk for recurrence by treating physician. (b) Adequately treated lentigo maligna melanoma without current evidence of disease or adequately resected non-melanomatous skin cancer (ie, basal cell carcinoma or squamous cell carcinoma of the skin). (c) Curatively treated in situ carcinoma of the cervix or carcinoma in situ of the prostate at any time prior to study without current evidence of disease. 10 Unable to swallow tablets or malabsorption syndrome, or disease significantly affecting gastrointestinal function, or resection of the stomach or small bowel or gastric bypass, symptomatic inflammatory bowel disease, or partial or complete bowel obstruction. 11 Active uncontrolled systemic infection (bacterial, fungal, viral or other) or clinically significant localised infection. 12 Known history of infection with human immunodeficiency virus (HIV). 13 Serologic status reflecting active HepB or HepC infection. 1. Patients with HepB core antibody positive who are surface antigen negative or who are HepC antibody positive will need to have a negative polymerase chain reaction (PCR) result before randomisation and must be willing to undergo deoxyribonucleic acid (DNA) PCR testing during the study. 2. Patients who are HepB surface antigen positive or HepB PCR positive and those who are HepC PCR positive will be excluded. 14 History of stroke or intracranial haemorrhage within 6 months prior to randomisation. 15 History of bleeding diathesis (eg, haemophilia, von Willebrand disease). 16 Requires or receiving anticoagulation with warfarin or equivalent vitamin K antagonists (eg, phenprocoumon) within 7 days of first dose of study treatment. Direct anti-X (DOACs) or low molecular weight heparins (LMWH, eg, enoxaparin) on stable dosing schedule is allowed. 17 Requires treatment with a strong cytochrome P450 3A (CYP3A) inhibitor/inducer. The use of strong CYP3A inhibitors within 1 week or strong CYP3A inducers within 3 weeks of the first dose of study treatment is prohibited. 18 Breastfeeding or pregnant. 19 Concurrent participation in another therapeutic clinical trial. 20 Uncontrolled cardiac/cardiovascular disease including the following: * Uncontrolled cardiac tachyarrhythmias (sinus, atrial or ventricular) that require new/additional therapy within the last month. * Clinically significant outlying QT interval corrected by Fridericia's formula (QTcF) values; QTcF > 470 ms or QTcF < 330 ms. * Unstable ischaemic heart disease (IHD), recent (< 3 months): episode of acute coronary syndrome, including acute myocardial infarction and unstable angina pectoris. * Percutaneous coronary intervention, or coronary artery bypass graft within the last month. 21 Uncontrolled hypertension despite optimal management. 22 Current life-threatening illness, medical conditions, organ system dysfunction or lifestyle habits which, in the investigator's opinion, could compromise the patient's safety or ability to adhere to the study protocol.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Intestinal Microbiota Transplant Prior to Allogeneic Stem Cell Transplant (MAST) Trial",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=50629&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. - Patients aged 18 years and over with a morphological documented diagnosis of ALL, acute myeloid leukemia (AML), AL of ambiguous lineage, myelodysplastic syndrome (MDS), chronic myelomonocytic leukemia (CMML), and CML in blast phase (Appendix 2) who are deemed fit for allogenic HCT with one of the following disease characteristics: ALL, AML, AL of ambiguous lineage * Patients in first complete remission (CR1) or second complete remission (CR2) including complete remission with incomplete blood count recovery with \\ You can take part if: Inclusion Criteria: 1. - Patients aged 18 years and over with a morphological documented diagnosis of ALL, acute myeloid leukemia (AML), AL of ambiguous lineage, myelodysplastic syndrome (MDS), chronic myelomonocytic leukemia (CMML), and CML in blast phase (Appendix 2) who are deemed fit for allogenic HCT with one of the following disease characteristics: ALL, AML, AL of ambiguous lineage * Patients in first complete remission (CR1) or second complete remission (CR2) including complete remission with incomplete blood count recovery with < 5% blasts (Appendix 2) * Secondary leukaemia (defined as previous history of MDS, antecedent haematological disease or chemotherapy exposure) in CR1 or CR2 defined as < 5% blasts (Appendix 2) MDS and CMML * Patients with advanced or high risk MDS with an International Prognostic Scoring System (IPSS-M) moderate high or higher including intermediate or high risk CMML who have < 5% blasts at the time of randomisation (Appendix 2) CML in blast phase * Patients with Philadelphia or BCR:ABL1 positive chronic myeloid leukaemia (CML) in blast phase defined by the presence of ≥ 20% blasts in blood or bone marrow who have achieved second chronic phase with < 5% blasts (Appendix 2). 2. Patients must have completed minimum of two cycles of intensive chemotherapy prior to trial enrolment (Appendix 1) 3. Patients must have received broad-spectrum antibiotics within 3 months prior to trial enrolment 4. Patients must be considered suitable/fit to undergo allogeneic hematopoietic cell transplantation (HCT) as clinically judged by the Local investigator 5. Patients with an Karnofsky performance status score 60 or above (Appendix 3) 6. Females of and male patients of reproductive potential (i.e., not post-menopausal or surgically sterilised) must use appropriate, highly effective, contraception from the point of commencing therapy until 6 months after treatment 7. Patients have given written informed consent 8. Patients willing and able to comply with scheduled study visits and laboratory tests Exclusion Criteria: 1. Patients with contraindications to receiving allogeneic HCT. 2. Female patients who are pregnant or breastfeeding. All women of childbearing potential must have a negative pregnancy test before commencing treatment. 3. Adults of reproductive potential not willing to use appropriate, highly effective, contraception during the specified period. 4. Patients with renal or hepatic impairment as clinically judged by the Local Investigator. 5. Patients with active infection, HIV-positive or chronic active hepatitis B virus (HBV) or hepatitis C virus (HCV). 6. Patients with a concurrent active malignancy or a prior malignancy, except lobular breast carcinoma in situ, fully resected basal cell or squamous cell carcinoma of skin or treated cervical carcinoma in situ, incidental histologic finding of prostate cancer (T1a or T1b using the tumour, node, metastasis (TNM) clinical staging system), previous MDS, CMML, Myeloproliferative neoplasms (MPN) resulting in secondary AML. Cancer treated with curative intent ≥ 5 years previously will be allowed. Cancer treated with curative intent < 5 years previously will not be allowed. 7. Swallowing difficulties that may preclude safe use of IMT capsules. 8. Administration of IMT within 3 months prior to enrolment (probiotic administration prior to enrolment is allowed but should be recorded at screening). 9. Patients taking probiotics after enrolment to the trial. 10. Gastrointestinal disorders and diseases, including delayed gastric emptying, coeliac disease, cystic fibrosis, inflammatory bowel disease, irritable bowel syndrome, chronic diarrhoea, and colonic perforation or fistula. 11. Any autoimmune disease requiring, or that may require, systemic treatment with steroids and/or other immunosuppressants/immunomodulators. 12. Significant bleeding disorder (ALL, AML, AL of ambiguous lineage, MDS, CMML, and CML satisfying inclusion criteria are not excluded). 13. Anaphylactic food allergy. 14. Requirement for vasopressors. 15. Valvular heart disease or known structural defects of the heart. 16. Known severe allergy to capsule components.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Base Edited CAR7 T Cells to Treat T Cell Malignancies (TvT CAR7)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=31331&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Demographic characteristics: 1. Male or female patients 2. Age ranging between 6 months and <16 years Medical and therapeutic criteria: 1. Relapsed/refractory T cell malignancy ahead of planned allogeneic haematopoietic stem cell transplantation (allo-SCT). Morphologically confirmed with leukemic blasts in the bone marrow (>5%) or a quantifiable MRD load (by multiparameter flow cytometry and/or quantitative polymerase chain reaction) 2. CD7+ (>99%) leukaemia associated immunophenotype (LAIP) 3. Eligible and fit for allogeneic hematopoietic stem cells transplantation with suitable donor available 4. Estimated life expectancy ≥12 weeks 5. Lansky (age <16 years at the time of assent/consent) or Karnofsky (age ≥16 years at the time of assent/consent) performance status ≥70; Eastern Cooperative Oncology Group ECOG performance status < 2",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Safety and Efficacy of Ponatinib for Treatment of Pediatric Recurrent or Refractory Leukemias, Lymphomas or Solid Tumors",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=29249&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Lymphoma, Leukemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Histologically or cytologically confirmed diagnosis of the following malignancies: - Phase 1: CP-CML, BP-CML, AP-CML ALL. AML. Other leukemias. Lymphoma. Any other tumors, including tumors of the CNS, for which standard therapy is not available or is not indicated. - Phase 2, Group A with CP-CML: CP-CML at the time of study entry and must be resistant to or intolerant of at least 1 prior BCR-ABL-targeted TKI therapy or be in \"warning\" response status or have the T315I kinase domain mutation. Must have 1 bone marrow aspirate with documentation of BCR-ABL translocation by conventional cytogenetics, metaphase FISH, or q-PCR performed within 42 days before the first dose of ponatinib. - Phase 2, Group B with other leukemias or solid tumors: ALL. AML. Other leukemias. Lymphoma. Any other tumors, including tumors of the CNS, with mutations of RET, FLT3, KIT, FGFR, PDGFR, TIE2, VEGFR, or any other mutations where ponatinib may have biological activity (eg, EPH receptors and SRC families of kinases) as assessed on fresh or archived tumor tissue. Participants with solid tumors or with lymphoma must have measurable disease by CT or MRI based on RECIST v1.1 or the Lugano lymphoma guidelines as determined by site radiology. Prior therapies as follows: - Phase 1: Participants with CML who are resistant to or intolerant of (as defined Appendix F) to at least 1 prior BCR-ABL-targeted TKI therapy. Participants with ALL who have progressed on or after all available or indicated therapies, which may have included 1 prior BCR-ABL-targeted TKI therapy. Participants with AML or other leukemias who have progressed on or after at least 1 prior induction attempt (for France only) or for whom no effective standard therapy is available or indicated (other countries). Participants with solid tumors (including tumors of the CNS) or lymphomas who have progressed despite standard therapy or for whom no effective standard therapy is available or indicated. - Phase 2, Group A with CP-CML: Participants who are resistant to or intolerant of at least 1 prior BCR-ABL-targeted TKI therapy. - Phase 2, Group B with other leukemias or solid tumors: Participants with ALL who have progressed on or after all available or indicated therapies, which must have included 1 prior BCR-ABL-targeted TKI therapy. Participants with AML or other leukemias who have progressed on or after at least 1 prior induction attempt (for France only) or for whom no effective standard therapy is available or indicated (other countries). Participants with solid tumors (including tumors of the CNS) or lymphomas who progressed despite standard therapy or for whom no effective standard therapy is available or indicated. * Karnofsky performance status ≥ 40% for participants ≥ 16 years old or Lansky Play Scale ≥ 40% for pediatric participants \\ You can take part if: Inclusion Criteria: Histologically or cytologically confirmed diagnosis of the following malignancies: - Phase 1: CP-CML, BP-CML, AP-CML ALL. AML. Other leukemias. Lymphoma. Any other tumors, including tumors of the CNS, for which standard therapy is not available or is not indicated. - Phase 2, Group A with CP-CML: CP-CML at the time of study entry and must be resistant to or intolerant of at least 1 prior BCR-ABL-targeted TKI therapy or be in \"warning\" response status or have the T315I kinase domain mutation. Must have 1 bone marrow aspirate with documentation of BCR-ABL translocation by conventional cytogenetics, metaphase FISH, or q-PCR performed within 42 days before the first dose of ponatinib. - Phase 2, Group B with other leukemias or solid tumors: ALL. AML. Other leukemias. Lymphoma. Any other tumors, including tumors of the CNS, with mutations of RET, FLT3, KIT, FGFR, PDGFR, TIE2, VEGFR, or any other mutations where ponatinib may have biological activity (eg, EPH receptors and SRC families of kinases) as assessed on fresh or archived tumor tissue. Participants with solid tumors or with lymphoma must have measurable disease by CT or MRI based on RECIST v1.1 or the Lugano lymphoma guidelines as determined by site radiology. Prior therapies as follows: - Phase 1: Participants with CML who are resistant to or intolerant of (as defined Appendix F) to at least 1 prior BCR-ABL-targeted TKI therapy. Participants with ALL who have progressed on or after all available or indicated therapies, which may have included 1 prior BCR-ABL-targeted TKI therapy. Participants with AML or other leukemias who have progressed on or after at least 1 prior induction attempt (for France only) or for whom no effective standard therapy is available or indicated (other countries). Participants with solid tumors (including tumors of the CNS) or lymphomas who have progressed despite standard therapy or for whom no effective standard therapy is available or indicated. - Phase 2, Group A with CP-CML: Participants who are resistant to or intolerant of at least 1 prior BCR-ABL-targeted TKI therapy. - Phase 2, Group B with other leukemias or solid tumors: Participants with ALL who have progressed on or after all available or indicated therapies, which must have included 1 prior BCR-ABL-targeted TKI therapy. Participants with AML or other leukemias who have progressed on or after at least 1 prior induction attempt (for France only) or for whom no effective standard therapy is available or indicated (other countries). Participants with solid tumors (including tumors of the CNS) or lymphomas who progressed despite standard therapy or for whom no effective standard therapy is available or indicated. * Karnofsky performance status ≥ 40% for participants ≥ 16 years old or Lansky Play Scale ≥ 40% for pediatric participants < 16 years old. * Participants must have recovered to < Grade 2 per the NCI CTCAE v5.0 or to baseline from any non-hematologic toxicities (except alopecia) due to previous therapy. * Willingness to avoid pregnancy or fathering children. Prior therapies: - Participants with BP-CML, ALL, or AML who have received any of the following: Corticosteroids or hydroxyurea within 24 hours before the first dose of ponatinib. Vincristine within 7 days before the first dose of ponatinib. Other chemotherapy (excluding intrathecal chemotherapy) within 14 days before the first dose of ponatinib. - Participants (except the BP-CML, ALL, and AML participants described above) who: Have had cytotoxic chemotherapy within 21 days (or 42 days for nitrosoureas or mitomycin C) before the first dose of ponatinib. Prior radiation therapy or radio-isotope therapy within 6 weeks before the first dose of ponatinib except local radiotherapy for palliative indication within 14 days before the first dose of ponatinib. Autologous or allogeneic stem cell transplant < 3 months before the first dose of ponatinib. Major surgery within 14 days before the first dose of ponatinib. Inadequate recovery and/or complications from a major surgery before starting therapy. Prior treatment with any of the following: * Immunosuppressive therapy (including post stem cell transplant regimens) within 14 days before the first dose of ponatinib. * Any targeted cancer therapy (including TKIs) within 7 days before the first dose of ponatinib. * Any other investigational anticancer agents within 30 days or 5 half-lives, whichever is longer, before randomization. * Any monoclonal antibody-directed anticancer therapy within 5 half-lives of the first dose of ponatinib. * Any chimeric antigen receptor therapy within 28 days before the first dose of ponatinib * Ponatinib * Protocol-defined lab Values * Significant concurrent, uncontrolled medical condition, including but not limited to the following: * Pancreatic: clinical, radiological, or laboratory evidence of pancreatitis. * Cardiac: * SF < 27% by ECHO, OR EF < 50% by MUGA. * Abnormal QTcF on screening ECG, defined as QTcF of ≥ 450 ms. * Clinically significant or uncontrolled cardiovascular disease, including unstable angina, acute MI within 6 months from Day 1 of study drug administration, New York Heart Association Class III or IV CHF (see Appendix P), and arrhythmia requiring therapy unless approved by the medical monitor/sponsor. * Uncontrolled hypertension. * Currently taking drug(s) that are known to have a risk of causing prolonged QTc or TdP unless the drug(s) can be changed to acceptable alternatives (ie, an alternate class of agents that do not affect the cardiac conduction system), or the participant can safely discontinue the drug(s). * Cerebral: * Participants with solid tumors with intracranial metastasis OR participants with active CNS leukemia (ie, CNS-2 status [< 5/μL WBCs and cytospin positive for blasts, or ≥ 5 /μL WBCs but negative by Steinherz/Bleyer algorithm (equation used for traumatic lumbar punctures), disseminated leptomeningeal disease, or CNS chloroma. * Pre-existing significant CNS pathology including history of severe brain injury, dementia, cerebellar disease, organic brain syndrome, psychosis, coordination/movement disorder, or autoimmune disease with CNS involvement. * History of cerebrovascular ischemia/hemorrhage with residual deficits. * Note: Participants with a history of cerebrovascular ischemia/hemorrhage remain eligible provided all neurologic deficits have resolved clinically according to Inclusion Criterion 6. * Uncontrolled seizure disorder. * Coagulation: * Significant bleeding disorder or thrombophilia unrelated to the underlying malignancy indication for study participation. * Gastrointestinal: * Gastrointestinal disorders, such as malabsorption syndrome or any other illness that could affect oral absorption. * Genetic: * Participants with DNA fragility syndromes, such as Fanconi anemia and Bloom syndrome. * Participants with Down syndrome. * Participants with any active ≥ Grade 2 graft versus host disease. * Chronic or current active uncontrolled infectious disease requiring systemic antibiotics, antifungal, or antiviral treatment. * Active HBV or HCV infection that requires treatment or at risk for HBV reactivation. Hepatitis B virus DNA and HCV RNA must be undetectable upon testing. At risk for HBV reactivation is defined as hepatitis B surface antigen positive or anti-hepatitis B core antibody positive. * Known HIV infection. * Current use of prohibited medication (see Section 6.7.2). * Known hypersensitivity or severe reaction to ponatinib or excipients of ponatinib. * Receipt of live (including attenuated) vaccines or anticipation of need for such vaccines during the study. * Inability or unlikeliness to comply with the dose schedule and study evaluations, in the opinion of the investigator. * Females who are pregnant or lactating. * Other exclusions may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Methods of T Cell Depletion Trial (MoTD)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=35312&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Availability of suitably matched unrelated donor (9/10 or 10/10) * Planned to receive one of the following RIC protocols: * Fludarabine-Melphalan (Fludarabine 120-180mg/m2 IV; melphalan ≤ 150mg/m2 IV) * BEAM or LEAM (carmustine 300mg/m2 IV or lomustine 200mg/m2 IV with: etoposide 800 mg/m2 IV; cytarabine 1600mg/m2 IV; melphalan 140mg/m2 IV) * Fludarabine-Busulphan (Fludarabine 120-180mg/m2 IV; Busulphan ≤ 8mg/kg PO or 6.4mg/kg IV) * Fludarabine- Treosulfan (Fludarabine 150mg/m2 IV; Treosulfan 30g/m2 IV) * Planned use of PBSCs for transplantation * Planned allo-SCT for one of the following haematological malignancies: * AML in CR (patients enrolled onto the COSI trial are not eligible for this study) * ALL in CR (patients enrolled onto the ALL-RIC trial are not eligible for this study) * CMML \\ 50µmol/l * AST/ALT\\>3 x ULN * Participation in COSI or ALL-RIC trials * Contraindication to treatment with the study drugs (Thymoglobulin, cyclophosphamide, sirolimus, ciclosporin and mycophenolate mofetil) as detailed in each study drug SPC. * Patient has any other systemic dysfunction (e.g., gastrointestinal, renal, respiratory, cardiovascular) or significant disorder which, in the opinion of the investigator would jeopardise the safety of the patient by taking part in the trial.}') You can take part if: Inclusion Criteria: * Availability of suitably matched unrelated donor (9/10 or 10/10) * Planned to receive one of the following RIC protocols: * Fludarabine-Melphalan (Fludarabine 120-180mg/m2 IV; melphalan ≤ 150mg/m2 IV) * BEAM or LEAM (carmustine 300mg/m2 IV or lomustine 200mg/m2 IV with: etoposide 800 mg/m2 IV; cytarabine 1600mg/m2 IV; melphalan 140mg/m2 IV) * Fludarabine-Busulphan (Fludarabine 120-180mg/m2 IV; Busulphan ≤ 8mg/kg PO or 6.4mg/kg IV) * Fludarabine- Treosulfan (Fludarabine 150mg/m2 IV; Treosulfan 30g/m2 IV) * Planned use of PBSCs for transplantation * Planned allo-SCT for one of the following haematological malignancies: * AML in CR (patients enrolled onto the COSI trial are not eligible for this study) * ALL in CR (patients enrolled onto the ALL-RIC trial are not eligible for this study) * CMML <10% blasts * MDS <10% blasts (patients enrolled onto the COSI trial are not eligible for this study) * NHL in CR/PR * HL in CR/PR * MM in CR/PR * CLL in CR/PR * CML in 1st or 2nd chronic phase * Myelofibrosis * Age 16-70 years * Females of and male patients of reproductive potential (i.e., not post-menopausal or surgically sterilised) must agree to use appropriate, highly effective, contraception from the point of commencing therapy until 12 months after transplant Exclusion Criteria: * Use of any method of graft manipulation (excluding storage of future DLI) * Use of alemtuzumab or any method of T cell depletion except those that are protocol-defined * Known hypersensitivity to study drugs or history of hypersensitivity to rabbits * Pregnant or lactating women * Adults of reproductive potential not willing to use appropriate, highly effective, contraception during the specified period * Life expectancy <8 weeks * Active HBV or HCV infection * Organ dysfunction defined as: * LVEF <45% * GFR <50ml/min * Bilirubin >50µmol/l * AST/ALT>3 x ULN * Participation in COSI or ALL-RIC trials * Contraindication to treatment with the study drugs (Thymoglobulin, cyclophosphamide, sirolimus, ciclosporin and mycophenolate mofetil) as detailed in each study drug SPC. * Patient has any other systemic dysfunction (e.g., gastrointestinal, renal, respiratory, cardiovascular) or significant disorder which, in the opinion of the investigator would jeopardise the safety of the patient by taking part in the trial.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Optimising therapy in FLT3-mutated acute myeloid leukaemia",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=51605&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Leukaemia, Acute Myeloid Leukaemia",
    "locations": "Multiple healthcare locations around the world",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "criteria are met. Any patients who enter the trial and are subsequently found to have wild-type FLT3 will be considered evaluable for safety/toxicity analysis but will be replaced with additional FLT3-mutated cases to maintain statistical power for the clinical efficacy endpoints and equipoise between arms.}') <div class=\"",
    "location_panel": "Multiple healthcare locations around the world"
  },
  {
    "title": "A Study of AZD0486 Monotherapy or in Combination With Other Anti-Cancer Agents for Mature B-Cell Malignancies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56541&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "Master Inclusion Criteria applicable to all substudies: * Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2. * Contraception during treatment and at least 6 months after final dose. * Confirmed CD19 expression if prior anti-CD19 therapy. Substudy 1 Specific Inclusion Criteria: * Participants with CLL must require treatment according to the international workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria. * SLL: at least 1 measurable site per Lugano. * Absolute lymphocytes \\ 50%. * Contraception at least 12 months after last dose of R-CHOP or 6 months after last dose of AZD0486. Exclusion Criteria: Master Exclusion Criteria applicable to all substudies: * central nervous system (CNS) lymphoma. * Surgery within 14 days of study drug. * Clinically significant cardiovascular (CV) disease. * Unresolved Grade \\>2 AEs from prior anticancer therapy (except alopecia or fatigue). * Any anticancer therapy within 5 half-lives or 21 days (whichever is shorter) prior to treatment. * Radiation therapy within 28 days. * Prior CAR-T or auto-haematopoietic stem cell transplant (HSCT) within 12 weeks or prior T-cell engager (TCE) within 8 weeks. * Prior Grade \\> 3 cytokine release syndrome (CRS) or immune effector cell-associated neurotoxicity syndrome (ICANS) event. Substudy 1 Specific Exclusion Criteria: * CLL transformation to more aggressive lymphoma * Cohort 1B: bleeding diathesis, CYP3A inhibitor or inducer, history of ICH or stroke within 6 months, GI malabsorption, receiving vitamin K antagonist Substudy 2 Specific Exclusion Criteria: * Cohort 2B: bleeding diathesis, CYP3A inhibitor or inducer, history of ICH or stroke within 6 months, GI malabsorption, receiving vitamin K antagonist Substudy 3 Specific Exclusion Criteria: * Mediastinal grey-zone lymphoma, Burkitt, Richter's transformation, primary effusion large B-cell lymphoma (LBCL) * Cumulative dose of anthracycline \\>150 mg/m2}') You can take part if: Inclusion Criteria: Master Inclusion Criteria applicable to all substudies: * Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2. * Contraception during treatment and at least 6 months after final dose. * Confirmed CD19 expression if prior anti-CD19 therapy. Substudy 1 Specific Inclusion Criteria: * Participants with CLL must require treatment according to the international workshop on Chronic Lymphocytic Leukemia (iwCLL) criteria. * SLL: at least 1 measurable site per Lugano. * Absolute lymphocytes <10,000. * Cohort 1A: at least 2 prior lines of therapy, including a Bruton tyrosine kinase inhibitor (BTKi) and B-cell lymphoma 2 inhibitor (BCL2i). * Cohort 1B: at least 1 prior line of therapy and is BTKi-sensitive. Substudy 2 Specific Inclusion Criteria: * MCL diagnosis per WHO. * Clinical Stage II, III, or IV by Ann Arbor Classification. * At least 1 measurable site per Lugano * ALC < 10,000. * Cohort 2A: Relapse or progressed after 2 or more lines of therapy including BTKi. * Cohort 2B: Relapse or progressed after 1 or more line of therapy, not including a BTKi. Substudy 3 Specific Inclusion Criteria: * Large B-cell lymphoma per WHO 2022. * R/R B-NHL after at least 1 prior line of therapy. * International Prognostic Index (IPI) 2-5. * At least 1 measurable site as per Lugano. * Left ventricular ejection fraction (LVEF) >50%. * Contraception at least 12 months after last dose of R-CHOP or 6 months after last dose of AZD0486. Exclusion Criteria: Master Exclusion Criteria applicable to all substudies: * central nervous system (CNS) lymphoma. * Surgery within 14 days of study drug. * Clinically significant cardiovascular (CV) disease. * Unresolved Grade >2 AEs from prior anticancer therapy (except alopecia or fatigue). * Any anticancer therapy within 5 half-lives or 21 days (whichever is shorter) prior to treatment. * Radiation therapy within 28 days. * Prior CAR-T or auto-haematopoietic stem cell transplant (HSCT) within 12 weeks or prior T-cell engager (TCE) within 8 weeks. * Prior Grade > 3 cytokine release syndrome (CRS) or immune effector cell-associated neurotoxicity syndrome (ICANS) event. Substudy 1 Specific Exclusion Criteria: * CLL transformation to more aggressive lymphoma * Cohort 1B: bleeding diathesis, CYP3A inhibitor or inducer, history of ICH or stroke within 6 months, GI malabsorption, receiving vitamin K antagonist Substudy 2 Specific Exclusion Criteria: * Cohort 2B: bleeding diathesis, CYP3A inhibitor or inducer, history of ICH or stroke within 6 months, GI malabsorption, receiving vitamin K antagonist Substudy 3 Specific Exclusion Criteria: * Mediastinal grey-zone lymphoma, Burkitt, Richter's transformation, primary effusion large B-cell lymphoma (LBCL) * Cumulative dose of anthracycline >150 mg/m2",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "HEM ISMART-D: Trametinib + Dexamethasone + Chemotherapy in Children with Relapsed or Refractory Hematological Malignancies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=55782&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Hematological",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Children between 1 year (≥ 12 months) and 18 years of age at the time of first diagnosis and less than 21 years at the time of inclusion. Patients under 6 years old must weigh at least 7 kg at the time of enrollment. Patients over 6 years old must weigh at least 10 kg at the time of enrollment. 2. Performance status: Karnofsky performance status (for patients \\>12 years of age) or Lansky Play score (for patients * 12 years of age) ≥ 50% (Appendix I). 3. Written informed consent from parents/legal representative, patient, and age-appropriate assent before any study specific screening procedures are conducted, according to local, regional or national guidelines. 4. Patients must have had molecular profiling and flow-cytometric analysis of their recurrent or refractory disease at a time-point before the first inclusion into this trial (see section 9.1 of this protocol for detailed description of the molecular diagnostics required). Drug response profiling and methylation is highly recommended but not mandatory. Patients with molecular profiling at first diagnosis lacking molecular diagnostics at relapse or refractory disease may be allowed to be included after discussion with the sponsor. 5. Patients whose tumor present RAS pathway activating mutations including but not limited to KRAS, NRAS, HRAS, FLT3, PTPN11, MAP2K1, MP2K1 hotspot mutations, cCBL; NF1 del, as detected by molecular profiling. 6. Adequate organ function: * RENAL AND HEPATIC FUNCTION (Assessed within 48 hours prior to C1D1) : * Serum creatinine ≤ 1.5 x upper limit of normal (ULN) for age or calculated creatinine clearance as per the Schwartz formula or radioisotope glomerular filtration rate ≥ 60 mL/min/1.73 m2. * Direct bilirubin ≤ 2 x ULN (≤ 3.0 × ULN for patients with Gilbert's syndrome). * Alanine aminotransferase (ALT)/serum glutamic pyruvic transaminase (SGPT) ≤ 5 x ULN; aspartate aminotransferase (AST)/serum glutamic oxaloacetic transaminase/SGOT ≤ 5 x ULN. Note: Patients with hepatic disfunction related to the underling disease can be eligible even if they do not fulfill the aforementioned values for hepatic transaminases. In these cases, patients need to be discussed with the sponsor to confirm the eligibility. * CARDIAC FUNCTION: * Shortening fraction (SF) \\>29% (\\>35% for children \\ 450 msec on baseline ECG, using the Fridericia correction), or other clinically significant ventricular or atrial arrhythmia. Exclusion Criteria 7. Pregnancy or positive pregnancy test (urine or serum) in females of childbearing potential. Pregnancy test must be performed within 7 days prior to C1D1. 8. Sexually active participants not willing to use highly effective contraceptive method (pearl index \\ You can take part if: Inclusion criteria 1. Children between 1 year (≥ 12 months) and 18 years of age at the time of first diagnosis and less than 21 years at the time of inclusion. Patients under 6 years old must weigh at least 7 kg at the time of enrollment. Patients over 6 years old must weigh at least 10 kg at the time of enrollment. 2. Performance status: Karnofsky performance status (for patients >12 years of age) or Lansky Play score (for patients * 12 years of age) ≥ 50% (Appendix I). 3. Written informed consent from parents/legal representative, patient, and age-appropriate assent before any study specific screening procedures are conducted, according to local, regional or national guidelines. 4. Patients must have had molecular profiling and flow-cytometric analysis of their recurrent or refractory disease at a time-point before the first inclusion into this trial (see section 9.1 of this protocol for detailed description of the molecular diagnostics required). Drug response profiling and methylation is highly recommended but not mandatory. Patients with molecular profiling at first diagnosis lacking molecular diagnostics at relapse or refractory disease may be allowed to be included after discussion with the sponsor. 5. Patients whose tumor present RAS pathway activating mutations including but not limited to KRAS, NRAS, HRAS, FLT3, PTPN11, MAP2K1, MP2K1 hotspot mutations, cCBL; NF1 del, as detected by molecular profiling. 6. Adequate organ function: * RENAL AND HEPATIC FUNCTION (Assessed within 48 hours prior to C1D1) : * Serum creatinine ≤ 1.5 x upper limit of normal (ULN) for age or calculated creatinine clearance as per the Schwartz formula or radioisotope glomerular filtration rate ≥ 60 mL/min/1.73 m2. * Direct bilirubin ≤ 2 x ULN (≤ 3.0 × ULN for patients with Gilbert's syndrome). * Alanine aminotransferase (ALT)/serum glutamic pyruvic transaminase (SGPT) ≤ 5 x ULN; aspartate aminotransferase (AST)/serum glutamic oxaloacetic transaminase/SGOT ≤ 5 x ULN. Note: Patients with hepatic disfunction related to the underling disease can be eligible even if they do not fulfill the aforementioned values for hepatic transaminases. In these cases, patients need to be discussed with the sponsor to confirm the eligibility. * CARDIAC FUNCTION: * Shortening fraction (SF) >29% (>35% for children < 3 years) and/or left ventricular ejection fraction (LVEF) ≥50% at baseline, as determined by echocardiography or MUGA. * Absence of QTcF prolongation (QTc prolongation is defined as >450 msec on baseline ECG, using the Fridericia correction), or other clinically significant ventricular or atrial arrhythmia. Exclusion Criteria 7. Pregnancy or positive pregnancy test (urine or serum) in females of childbearing potential. Pregnancy test must be performed within 7 days prior to C1D1. 8. Sexually active participants not willing to use highly effective contraceptive method (pearl index <1) as defined in CTFG HMA 2020 (Appendix II) during trial participation and until 6 months after end of antileukemic therapy. 9. Breast feeding. 10. Impairment of gastrointestinal (GI) function or GI disease that may significantly alter drug absorption of oral drugs (e.g., ulcerative diseases, uncontrolled nausea, vomiting, diarrhea, or malabsorption syndrome) in case of oral IMPs. 11. Have a known immediate or delayed hypersensitivity reaction or idiosyncrasy to the study drugs, or drugs chemically related to study treatment or excipients that contraindicate their participation, including conventional chemotherapeutics (i.e. cytarabine and cyclophosphamide, intrathecal agents) and corticoids. 12. Known active viral hepatitis or known human immunodeficiency virus (HIV) infection or any other uncontrolled infection. 13. Severe concomitant disease that does not allow treatment according to the protocol at the investigator's discretion. 14. Subjects unwilling or unable to comply with the study procedures. 15. Previous treatment with trametinib. 16. Current use of a prohibited medication or herbal preparation or requires any of these medications during the study. See Section 7 and Appendix III for details. Drugs inducing QTc changes (prolongation of the QT interval or inducing Torsade de Points) are not permitted. 17. Unresolved toxicity greater than NCI CTCAE v 5.0 ≥ grade 2 from previous anti-cancer therapy, including major surgery, except those that in the opinion of the investigator are not clinically relevant given the known safety/toxicity profile of the study treatment (e.g., alopecia and/or peripheral neuropathy related to platinum or vinca alkaloid based chemotherapy) (Common Terminology Criteria for Adverse Events (CTCAE) (cancer.gov). 18. Active acute graft versus host disease (GvHD) of any grade or chronic GvHD of grade 2 or higher. Patients receiving any agent to treat or prevent GvHD post bone marrow transplant are not eligible for this trial. 19. Received immunosuppression post allogenic HSCT within one moth of study entry. 20. History or current evidence of retina vein occlusion (RVO) or central serous retinopathy are excluded. 21. Wash-out periods of prior medication: 1. CHEMOTHERAPY: At least 7 days must have elapsed since the completion of cytotoxic therapy, with the exception of hydroxyurea, 6-mercaptopurine, oral methotrexate and steroids which are permitted up until 48 hours prior to initiating protocol therapy. Patients may have received intrathecal therapy (IT) at any time prior to study entry. 2. RADIOTHERAPY: Radiotherapy (non-palliative) within 21 days prior to the first dose of drug. Palliative radiation in past 21 days is allowed. 3. HEMATOPOIETIC STEM CELL TRANSPLANTATION (HSCT): Autologous HSCT within 2 months prior to the first study drug dose; Allogeneic HSCT within 3 months prior to the first study drug dose. 4. IMMUNOTHERAPY: At least 42 days must have elapsed after the completion of any type of immunotherapy other than monoclonal antibodies (e.g. CAR-T therapy) 5. MONOCLONAL ANTIBODIES AND INVESTIGATIONAL DRUGS: At least 21 days or 5 times the half-life (whichever is shorter) from prior treatment with monoclonal antibodies or any investigational drug under investigation must have elapsed before the first study drug. 6. SURGERY: Major surgery within 21 days of the first dose. Gastrostomy, ventriculo-peritoneal shunt, endoscopic ventriculostomy, tumor biopsy and insertion of central venous access devices are not considered major surgery.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Mocravimod as Adjunctive and Maintenance Treatment in AML Patients Undergoing Allo-HCT",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=39141&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml, All",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Diagnosis of AML (excluding acute promyelocytic leukemia) according to the WHO 2022 classification of AML and related precursor neoplasm, including AML with myelodysplasia-related gene mutations * European Leukemia Net (ELN) high-risk or intermediate-risk AML in CR1, or AML of any risk in CR2, \\[CRi\\] is also allowable * Planned allogeneic HCT from fully matched related or unrelated donor with no more than 1 antigen mismatch or planned use of haploidentical donor using PBSC graft * Any conditioning regimen with a Transplant Conditioning Score (TCI) ≥ 1.5 * Planned use of TAC-based GvHD prophylaxis * age ≥ 18 years and ≤ 75 years * Eastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 Exclusion Criteria: * Use of CsA, anti-thymocyte globulin (ATG), alemtuzumab, abatacept for GvHD prophylaxis * Diagnosis of macular edema during screening * Cardiac/pulmonary/hepatic/renal dysfunction * Hepatic dysfunction as defined by aspartate aminotransferase (AST) and/or alanine aminotransferase (ALT) \\> 2.5 x upper limit of normal (ULN); or total bilirubin \\> 1.5 mg/dL * Renal dysfunction with estimated creatinine clearance \\ You can take part if: Inclusion Criteria: * Diagnosis of AML (excluding acute promyelocytic leukemia) according to the WHO 2022 classification of AML and related precursor neoplasm, including AML with myelodysplasia-related gene mutations * European Leukemia Net (ELN) high-risk or intermediate-risk AML in CR1, or AML of any risk in CR2, [CRi] is also allowable * Planned allogeneic HCT from fully matched related or unrelated donor with no more than 1 antigen mismatch or planned use of haploidentical donor using PBSC graft * Any conditioning regimen with a Transplant Conditioning Score (TCI) ≥ 1.5 * Planned use of TAC-based GvHD prophylaxis * age ≥ 18 years and ≤ 75 years * Eastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 Exclusion Criteria: * Use of CsA, anti-thymocyte globulin (ATG), alemtuzumab, abatacept for GvHD prophylaxis * Diagnosis of macular edema during screening * Cardiac/pulmonary/hepatic/renal dysfunction * Hepatic dysfunction as defined by aspartate aminotransferase (AST) and/or alanine aminotransferase (ALT) > 2.5 x upper limit of normal (ULN); or total bilirubin > 1.5 mg/dL * Renal dysfunction with estimated creatinine clearance < 45 mL/min by the Cockcroft-Gault formula * Diabetes mellitus * History or presence of uveitis at screening * History or diagnosis of macular edema",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "(Apex) Bezuclastinib in Patients With Advanced Systemic Mastocytosis",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=46639&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "for Main Study: 1. Diagnosed with one of the following advanced mastocytosis diagnoses by Eligibility Committee 1. Aggressive Systemic Mastocytosis (ASM) 2. Systemic Mastocytosis with an Associated Hematologic Neoplasm (SM-AHN) 3. Mast Cell Leukemia (MCL) 2. Measurable disease according to modified IWG-MRT-ECNM criteria. (A subset of patients inevaluble per mIWG-MRT-ECNM will be included in the study). 3. ECOG (0 to 3) 4. Have clinically acceptable local laboratory screening results (clinical chemistry, hematology) within certain limits Key Exclusion Criteria for Main Study: 1. Persistent toxicity from previous therapy for AdvSM that has not resolved to ≤ Grade 1 2. Associated hematologic neoplasm requiring immediate antineoplastic therapy 3. Clinically significant cardiac disease 4. Known positivity for the FIP1L1 PDGFRA fusion. Patients with eosinophilia without detectable KIT D816V mutation must demonstrate lack of PDGFRA fusion mutation prior to enrollment 5. Seropositive for human immunodeficiency virus (HIV) 1 or 2, or positive for hepatitis B surface antigen or hepatitis C virus (HCV) antibody 6. History of clinically significant bleeding event within 30 days before the first dose of study drug or need for therapeutic anticoagulation on study 7. Diagnosed with or treated for malignancy other than the disease under study within the prior 3 years before enrollment 8. Received any cytoreductive therapy or any investigational agent less than 14 days, and for cladribine, interferon alpha, pegylated interferon, and any antibody therapy less than 28 days, before screening bone marrow biopsy 9. Received hematopoietic growth factor support within 14 days before the first dose of study drug 10. Received strong CYP3A4 inhibitors or inducers within 14 days or 5 drug half-lives, whichever is longer, before the first dose of study drug 11. Need for treatment with high dose steroids Key Inclusion Criteria for Substudy Population: Rollover Cohort 1. Demonstrate AHN progression requiring immediate AHN-directed therapy while receiving bezuclastinib 2. Demonstrated clinical benefit from bezuclastinib therapy 3. Have clinically acceptable local laboratory screening results (clinical chemistry, hematology) within certain limits High-Risk Cohort 1. Receiving or indicated for AHN-directed therapy. 2. Diagnosed with one of the following pathologic diagnoses of SM-AHN: 1. Myelodysplastic syndrome (MDS) that is high- or very high-risk 2. Accelerated phase myeloproliferative neoplasm (MPN) 3. MDS with excessive blasts in bone marrow or peripheral blood 4. Chronic myelomonocytic leukemia-2 (CMML-2) 3. Have clinically acceptable local laboratory screening results (clinical chemistry, hematology) within certain limits. Key Exclusion Criteria for Substudy Population: 1. Diagnosis of Philadelphia chromosome-positive malignancy 2. Diagnosis of acute myeloid leukemia (AML) 3. Appropriate for allogenic hematopoietic stem cell transplantation 4. Any contraindication to selected concomitant therapy 5. Rollover Cohort: Have not demonstrated acceptable tolerability of previous bezuclastinib therapy 6. High-Risk Cohort: Previously treated with investigational therapy for AdvSM 7. High-Risk Cohort: Previously treated with cytoreductive therapy and discontinued due to treatment-related toxicity 8. High-Risk Cohort: Received any cytoreductive therapy or any investigational agent less than 14 days, and for cladribine, interferon alpha, pegylated interferon, and any antibody therapy less than 28 days, before screening or archival bone marrow biopsy}') You can take part if: Key Inclusion Criteria for Main Study: 1. Diagnosed with one of the following advanced mastocytosis diagnoses by Eligibility Committee 1. Aggressive Systemic Mastocytosis (ASM) 2. Systemic Mastocytosis with an Associated Hematologic Neoplasm (SM-AHN) 3. Mast Cell Leukemia (MCL) 2. Measurable disease according to modified IWG-MRT-ECNM criteria. (A subset of patients inevaluble per mIWG-MRT-ECNM will be included in the study). 3. ECOG (0 to 3) 4. Have clinically acceptable local laboratory screening results (clinical chemistry, hematology) within certain limits Key Exclusion Criteria for Main Study: 1. Persistent toxicity from previous therapy for AdvSM that has not resolved to ≤ Grade 1 2. Associated hematologic neoplasm requiring immediate antineoplastic therapy 3. Clinically significant cardiac disease 4. Known positivity for the FIP1L1 PDGFRA fusion. Patients with eosinophilia without detectable KIT D816V mutation must demonstrate lack of PDGFRA fusion mutation prior to enrollment 5. Seropositive for human immunodeficiency virus (HIV) 1 or 2, or positive for hepatitis B surface antigen or hepatitis C virus (HCV) antibody 6. History of clinically significant bleeding event within 30 days before the first dose of study drug or need for therapeutic anticoagulation on study 7. Diagnosed with or treated for malignancy other than the disease under study within the prior 3 years before enrollment 8. Received any cytoreductive therapy or any investigational agent less than 14 days, and for cladribine, interferon alpha, pegylated interferon, and any antibody therapy less than 28 days, before screening bone marrow biopsy 9. Received hematopoietic growth factor support within 14 days before the first dose of study drug 10. Received strong CYP3A4 inhibitors or inducers within 14 days or 5 drug half-lives, whichever is longer, before the first dose of study drug 11. Need for treatment with high dose steroids Key Inclusion Criteria for Substudy Population: Rollover Cohort 1. Demonstrate AHN progression requiring immediate AHN-directed therapy while receiving bezuclastinib 2. Demonstrated clinical benefit from bezuclastinib therapy 3. Have clinically acceptable local laboratory screening results (clinical chemistry, hematology) within certain limits High-Risk Cohort 1. Receiving or indicated for AHN-directed therapy. 2. Diagnosed with one of the following pathologic diagnoses of SM-AHN: 1. Myelodysplastic syndrome (MDS) that is high- or very high-risk 2. Accelerated phase myeloproliferative neoplasm (MPN) 3. MDS with excessive blasts in bone marrow or peripheral blood 4. Chronic myelomonocytic leukemia-2 (CMML-2) 3. Have clinically acceptable local laboratory screening results (clinical chemistry, hematology) within certain limits. Key Exclusion Criteria for Substudy Population: 1. Diagnosis of Philadelphia chromosome-positive malignancy 2. Diagnosis of acute myeloid leukemia (AML) 3. Appropriate for allogenic hematopoietic stem cell transplantation 4. Any contraindication to selected concomitant therapy 5. Rollover Cohort: Have not demonstrated acceptable tolerability of previous bezuclastinib therapy 6. High-Risk Cohort: Previously treated with investigational therapy for AdvSM 7. High-Risk Cohort: Previously treated with cytoreductive therapy and discontinued due to treatment-related toxicity 8. High-Risk Cohort: Received any cytoreductive therapy or any investigational agent less than 14 days, and for cladribine, interferon alpha, pegylated interferon, and any antibody therapy less than 28 days, before screening or archival bone marrow biopsy",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study to Investigate APL-4098 Alone and/or in Combination With Azacitidine in R/R AML and High-Risk MDS",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=57191&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Aml, Mds",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* 18 years or older * Confirmed diagnosis of relapsed refractory acute myeloid leukemia (R/R AML), myelodysplastic syndrome (MDS)/ AML, or MDS-excess blasts (MDS-EB) with the following characteristics: - R/R AML (primary or secondary, including treatment-related), participant is intolerant to, or considered ineligible for available therapies known to provide clinical benefit. * WBC count ≤ 25,000/microliter * ECOG Performance Status of ≤ 2 * Weight ≥ 40kg * Female participants of childbearing potential must have negative serum pregnancy test at screening; must not plan to become pregnant or have ova harvested or breastfeed while on study; must we willing to use specific contraception or avoid intercourse * Male participants must be willing to use specific contraception and not plan to impregnant a female partner or donate sperm while on study * Participant must be willing and able to provide written informed consent and to comply with the requirements of the trial Exclusion Criteria: * Certain prior therapies such as: received an allogeneic stem cell transplant within 6 months of screening, received an autologous stem cell transplant within 3 months of screening, received any anti-cancer treatments within 2 weeks of Cycle 1 Day 1, prior radiation therapy within 4 weeks of screening * Certain medical conditions such as: other malignancies, myocardial infarction within 6 months of screening, symptomatic congestive heart failure, uncontrolled active infection, history of arterial thrombosis within 6 months of screening * Diagnostic assessments: Left ventricular ejection fraction \\ 470msec, Aspartate aminotransferase and/or alanine aminotransferase \\> 3 x upper limit of normal (ULN), total bilirubin \\> 1.5 x ULN, calculated or measured creatinine clearance \\ You can take part if: Inclusion Criteria: * 18 years or older * Confirmed diagnosis of relapsed refractory acute myeloid leukemia (R/R AML), myelodysplastic syndrome (MDS)/ AML, or MDS-excess blasts (MDS-EB) with the following characteristics: - R/R AML (primary or secondary, including treatment-related), participant is intolerant to, or considered ineligible for available therapies known to provide clinical benefit. * WBC count ≤ 25,000/microliter * ECOG Performance Status of ≤ 2 * Weight ≥ 40kg * Female participants of childbearing potential must have negative serum pregnancy test at screening; must not plan to become pregnant or have ova harvested or breastfeed while on study; must we willing to use specific contraception or avoid intercourse * Male participants must be willing to use specific contraception and not plan to impregnant a female partner or donate sperm while on study * Participant must be willing and able to provide written informed consent and to comply with the requirements of the trial Exclusion Criteria: * Certain prior therapies such as: received an allogeneic stem cell transplant within 6 months of screening, received an autologous stem cell transplant within 3 months of screening, received any anti-cancer treatments within 2 weeks of Cycle 1 Day 1, prior radiation therapy within 4 weeks of screening * Certain medical conditions such as: other malignancies, myocardial infarction within 6 months of screening, symptomatic congestive heart failure, uncontrolled active infection, history of arterial thrombosis within 6 months of screening * Diagnostic assessments: Left ventricular ejection fraction < 45%, Fridericia's corrected QT interval > 470msec, Aspartate aminotransferase and/or alanine aminotransferase > 3 x upper limit of normal (ULN), total bilirubin > 1.5 x ULN, calculated or measured creatinine clearance < 45 mL/minute (multiply by 0.85 if female) * Infectious disease: HIV positive, active hepatitis B and/or C",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study to Investigate the Safety of Novel Dose Ramp-up Schedule(s) When Initiating Sonrotoclax in Participants Treated for Blood Cancers.",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56434&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood Cancer",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Stable ECOG Performance Status ≤ 2. 2. Adequate organ function and no very recent transfusion or blood growth factor 3. Participants of childbearing potential must be willing to use a highly effective method of birth control and refrain from egg donation for the duration of the study and for ≥ 90 days after the last dose of sonrotoclax or ≥ 30 days after the last dose of zanubrutinib, whichever is later. 4. Confirmed diagnosis of CLL, based on Hallek et al 2018, and requiring treatment due to certain features of their disease 5. At least 1 measurable lesion based on computed tomography (CT)/magnetic resonance imaging (MRI) and no history of prolymphocytic leukemia or Richter's transformation. Exclusion Criteria: 1. Participants unable to comply with the requirements of the protocol 2. Serologic status reflecting active viral HBV or HCV infection 3. Positive HIV serology (HIVAb) status unless certain conditions are met. 4. Participants with any major surgical procedure ≤ 28 days before first dose of study treatment 5. Prior systemic treatment for the CLL 6. Uncontrolled autoimmune hemolytic anemia or immune thrombocytopenia requiring treatment NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.}') You can take part if: Inclusion Criteria: 1. Stable ECOG Performance Status ≤ 2. 2. Adequate organ function and no very recent transfusion or blood growth factor 3. Participants of childbearing potential must be willing to use a highly effective method of birth control and refrain from egg donation for the duration of the study and for ≥ 90 days after the last dose of sonrotoclax or ≥ 30 days after the last dose of zanubrutinib, whichever is later. 4. Confirmed diagnosis of CLL, based on Hallek et al 2018, and requiring treatment due to certain features of their disease 5. At least 1 measurable lesion based on computed tomography (CT)/magnetic resonance imaging (MRI) and no history of prolymphocytic leukemia or Richter's transformation. Exclusion Criteria: 1. Participants unable to comply with the requirements of the protocol 2. Serologic status reflecting active viral HBV or HCV infection 3. Positive HIV serology (HIVAb) status unless certain conditions are met. 4. Participants with any major surgical procedure ≤ 28 days before first dose of study treatment 5. Prior systemic treatment for the CLL 6. Uncontrolled autoimmune hemolytic anemia or immune thrombocytopenia requiring treatment NOTE: Other protocol defined Inclusion/Exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "International Study for Treatment of High Risk Childhood Relapsed ALL 2010",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=46899&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "All",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Morphologically confirmed diagnosis of 1st relapsed precursor B-cell or T-cell ALL * Children less than 18 years of age at date of inclusion into the study * Meeting HR criteria any BM relapse, early/very early isolated BM relapse, very early isolated/combined extramedullary relapse) * Patient enrolled in a participating centre * Written informed consent * Start of treatment falling into the study period * No participation in other clinical trials 30 day prior to study enrolment that interfere with this protocol, except trials for primary ALL Exclusion Criteria: * Breakpoint cluster region-Abelson (BCR-ABL)/ t(9;22) positive ALL * Pregnancy or positive pregnancy test (urine sample positive for β-humane choriongonadotropin (HCG) \\> 10 U/l) * Sexually active adolescents not willing to use highly effective contraceptive method (pearl index \\ II° * The whole protocol or essential parts are declined either by patient himself/herself or the respective legal guardian * Objection to the study participation by a minor patient, able to object * Any patient being dependent on the investigator * No consent is given for saving and propagation of pseudonymized medical data for study reasons * Severe concomitant disease that does not allow treatment according to the protocol at the investigator's discretion (e.g. malformation syndromes, cardiac malformations, metabolic disorders) * Subjects unwilling or unable to comply with the study procedures * Subjects who are legally detained in an official institute}') You can take part if: Inclusion Criteria: * Morphologically confirmed diagnosis of 1st relapsed precursor B-cell or T-cell ALL * Children less than 18 years of age at date of inclusion into the study * Meeting HR criteria any BM relapse, early/very early isolated BM relapse, very early isolated/combined extramedullary relapse) * Patient enrolled in a participating centre * Written informed consent * Start of treatment falling into the study period * No participation in other clinical trials 30 day prior to study enrolment that interfere with this protocol, except trials for primary ALL Exclusion Criteria: * Breakpoint cluster region-Abelson (BCR-ABL)/ t(9;22) positive ALL * Pregnancy or positive pregnancy test (urine sample positive for β-humane choriongonadotropin (HCG) > 10 U/l) * Sexually active adolescents not willing to use highly effective contraceptive method (pearl index <1) until 12 months after end of anti-leukemic therapy * Breast feeding * Relapse post allogeneic stem-cell transplantation * Neuropathy > II° * The whole protocol or essential parts are declined either by patient himself/herself or the respective legal guardian * Objection to the study participation by a minor patient, able to object * Any patient being dependent on the investigator * No consent is given for saving and propagation of pseudonymized medical data for study reasons * Severe concomitant disease that does not allow treatment according to the protocol at the investigator's discretion (e.g. malformation syndromes, cardiac malformations, metabolic disorders) * Subjects unwilling or unable to comply with the study procedures * Subjects who are legally detained in an official institute",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Musculoskeletal Health in Adult Haematological Cancer Survivors",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=41808&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Haematological",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "1. Age 18 or above at diagnosis of haematological cancer 2. Diagnosis of haematological cancers: lymphoma or leukaemia 3. Cancer survivors as recorded in the local database of lymphoma and haematopoietic stem cell transplant database 4. Able to give written informed consent 5. Able to read and understand English Exclusion Criteria: 1.Currently receiving any active cancer treatment Interview study Inclusion Criteria: 1. Age 18 or above at diagnosis of haematological cancer 2. Diagnosis of haematological cancers: lymphoma or leukaemia 3. Cancer survivors as recorded in the local database of lymphoma and haematopoietic stem cell transplant database 4. Able to give written or verbal informed consent 5. Able to read and understand English Exclusion Criteria: 1 .Currently receiving any active cancer treatment}') You can take part if: Questionnaire study Inclusion Criteria: 1. Age 18 or above at diagnosis of haematological cancer 2. Diagnosis of haematological cancers: lymphoma or leukaemia 3. Cancer survivors as recorded in the local database of lymphoma and haematopoietic stem cell transplant database 4. Able to give written informed consent 5. Able to read and understand English Exclusion Criteria: 1.Currently receiving any active cancer treatment Interview study Inclusion Criteria: 1. Age 18 or above at diagnosis of haematological cancer 2. Diagnosis of haematological cancers: lymphoma or leukaemia 3. Cancer survivors as recorded in the local database of lymphoma and haematopoietic stem cell transplant database 4. Able to give written or verbal informed consent 5. Able to read and understand English Exclusion Criteria: 1 .Currently receiving any active cancer treatment",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of PRT2527 as Monotherapy and in Combination With Zanubrutinib or Venetoclax in Participants With R/R Hematologic Malignancies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=50793&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Willing and able to comply with all scheduled visits, treatment plan, laboratory tests, lifestyle considerations, and other study procedures * Histologically or cytologically confirmed diagnosis of aggressive B-cell lymphoma subtypes, MCL, MZL, or CLL/SLL (including Richter's syndrome) based on local testing, or TCL (monotherapy only), AML, CMML, MDS, or MDS/MPN overlap syndrome that have relapsed or become refractory to or be ineligible for standard-of-care therapy * Eastern Cooperative Oncology Group (ECOG) Performance Status of \\ 1 at study entry * Have severe pulmonary disease with hypoxemia * History of another malignancy except for adequately treated non-melanoma skin cancer or lentigo maligna, superficial bladder cancer, and carcinoma in situ of the cervix without evidence of disease, and asymptomatic prostate cancer without known metastatic disease and no requirement for therapy * Concurrent treatment or within 15 days of starting study treatment with strong CYP3A4 inhibitors * Prior exposure to a CDK9 inhibitor * Wait at least 5 half-lives of the agent or 14 days after their investigational or approved therapies before start of study treatment, whichever is shorter * Mean corrected QT interval of \\> 470 msec following triplicate ECG measurement or history of long QT syndrome * T-Cell leukemias}') You can take part if: Inclusion Criteria: * Willing and able to comply with all scheduled visits, treatment plan, laboratory tests, lifestyle considerations, and other study procedures * Histologically or cytologically confirmed diagnosis of aggressive B-cell lymphoma subtypes, MCL, MZL, or CLL/SLL (including Richter's syndrome) based on local testing, or TCL (monotherapy only), AML, CMML, MDS, or MDS/MPN overlap syndrome that have relapsed or become refractory to or be ineligible for standard-of-care therapy * Eastern Cooperative Oncology Group (ECOG) Performance Status of < 2. * Adequate organ function (hematology, renal, and hepatic) * Echocardiogram (or multigated acquisition [MUGA] scan) indicating a left ventricular ejection fraction of ≥ 50% Exclusion Criteria: * Have active central nervous system involvement by malignancy, uncontrolled intercurrent illnesses, and active infections requiring systemic therapy * Have undergone HSCT within the last 90 days or have graft versus host disease (GvHD) Grade > 1 at study entry * Have severe pulmonary disease with hypoxemia * History of another malignancy except for adequately treated non-melanoma skin cancer or lentigo maligna, superficial bladder cancer, and carcinoma in situ of the cervix without evidence of disease, and asymptomatic prostate cancer without known metastatic disease and no requirement for therapy * Concurrent treatment or within 15 days of starting study treatment with strong CYP3A4 inhibitors * Prior exposure to a CDK9 inhibitor * Wait at least 5 half-lives of the agent or 14 days after their investigational or approved therapies before start of study treatment, whichever is shorter * Mean corrected QT interval of > 470 msec following triplicate ECG measurement or history of long QT syndrome * T-Cell leukemias",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A rollover study for continued study treatment and ongoing safety monitoring",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=56205&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Multiple healthcare locations around the world",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "3. Sign an informed consent form (ICF) (or their legally acceptable representative must sign) indicating that the participant understands the purpose of, and procedures required for, the study and is willing to participate in the platform study with details per the relevant ISA}') You can take part if: 1. Have participated in a parent study, with a linked intervention specific appendix (ISA) within this platform study, in which they initially received study treatment(s) prior to rolling over to this platform study 2. Satisfy all ISA specific inclusion criteria 3. Sign an informed consent form (ICF) (or their legally acceptable representative must sign) indicating that the participant understands the purpose of, and procedures required for, the study and is willing to participate in the platform study with details per the relevant ISA",
    "location_panel": "Multiple healthcare locations around the world"
  },
  {
    "title": "A Study of Zilovertamab Vedotin (MK-2140) as Monotherapy and in Combination in Participants With Aggressive and Indolent B-cell Malignancies (MK-2140-006)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=39976&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "include, but are not limited to the following: Inclusion Criteria: * For aggressive B-cell malignancies mantle cell lymphoma (MCL): Has histologically confirmed biopsy according to the 2016 World Health Organization (WHO) classification of neoplasms of the hematopoietic and lymphoid tissues and has relapsed or refractory disease after at least 2 prior systemic therapies including a Bruton's tyrosine kinase inhibition/inhibitor(s) (BTKi), and is post chimeric antigen receptor T (CAR-T) cell therapy or is ineligible for CAR-T cell therapy. * For aggressive B-cell malignancies MCL Cohort C: Has histologically confirmed biopsy according to the 2016 World Health Organization (WHO) classification of neoplasms of the hematopoietic and lymphoid tissues and has relapsed or refractory disease after at least 1 prior systemic therapy and has no prior exposure to a non-covalent BTKi. * For aggressive B-cell malignancies Richter transformation lymphoma (RTL): Has histologically confirmed biopsy according to the 2016 World Health Organization (WHO) classification of neoplasms of the hematopoietic and lymphoid tissues and has relapsed or refractory disease. * For indolent B-cell malignancies follicular lymphoma (FL) and chronic lymphocytic leukemia (CLL): Has histologically confirmed biopsy and has relapsed or refractory disease after at least 2 prior systemic therapies and no other available therapy. * Participants who are hepatitis B surface antigen (HBsAg) positive are eligible if they have received hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV viral load prior to randomization/allocation. * Have an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 assessed within 7 days before cycle 1 day 1. Exclusion Criteria: * Has received solid organ transplant at any time. * Has clinically significant (ie, active) cardiovascular disease: cerebral vascular accident/stroke (\\ 1 peripheral neuropathy. * Has a demyelinating form of Charcot-Marie-Tooth disease. * Has a history of a second malignancy, unless potentially curative treatment has been completed with no evidence of malignancy for 2 years. * Participants with FL who have transformed to a more aggressive type of lymphoma. * Has received prior systemic anticancer therapy within 5 half-lives or 4 weeks (if prior therapy was a monoclonal antibodies) or 2 weeks (if prior therapy was small molecules like kinase inhibitors) prior to the first dose of study intervention. * Has received prior radiotherapy within 28 days of start of study intervention. Participants must have recovered from all radiation-related toxicities. * Has ongoing corticosteroid therapy exceeding 30 mg daily of prednisone equivalent. * Has received a live or live-attenuated vaccine within 30 days before the first dose of study intervention. * Has known active central nervous system (CNS) lymphoma involvement or active CNS involvement by lymphoma. * Has an active infection requiring systemic therapy. * Has a known history of human immunodeficiency virus (HIV) infection. * Active HBV or hepatitis C virus (HCV) infection. * For Cohort C only: has any clinically significant gastrointestinal abnormalities that might alter absorption.}') You can take part if: The main inclusion criteria include, but are not limited to the following: Inclusion Criteria: * For aggressive B-cell malignancies mantle cell lymphoma (MCL): Has histologically confirmed biopsy according to the 2016 World Health Organization (WHO) classification of neoplasms of the hematopoietic and lymphoid tissues and has relapsed or refractory disease after at least 2 prior systemic therapies including a Bruton's tyrosine kinase inhibition/inhibitor(s) (BTKi), and is post chimeric antigen receptor T (CAR-T) cell therapy or is ineligible for CAR-T cell therapy. * For aggressive B-cell malignancies MCL Cohort C: Has histologically confirmed biopsy according to the 2016 World Health Organization (WHO) classification of neoplasms of the hematopoietic and lymphoid tissues and has relapsed or refractory disease after at least 1 prior systemic therapy and has no prior exposure to a non-covalent BTKi. * For aggressive B-cell malignancies Richter transformation lymphoma (RTL): Has histologically confirmed biopsy according to the 2016 World Health Organization (WHO) classification of neoplasms of the hematopoietic and lymphoid tissues and has relapsed or refractory disease. * For indolent B-cell malignancies follicular lymphoma (FL) and chronic lymphocytic leukemia (CLL): Has histologically confirmed biopsy and has relapsed or refractory disease after at least 2 prior systemic therapies and no other available therapy. * Participants who are hepatitis B surface antigen (HBsAg) positive are eligible if they have received hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV viral load prior to randomization/allocation. * Have an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 assessed within 7 days before cycle 1 day 1. Exclusion Criteria: * Has received solid organ transplant at any time. * Has clinically significant (ie, active) cardiovascular disease: cerebral vascular accident/stroke (<6 months prior to enrollment), myocardial infarction (<6 months prior to enrollment), unstable angina (<6 months prior to enrollment), congestive heart failure (New York Heart Association Classification Class ≥II), or serious cardiac arrhythmia requiring medication. * Has pericardial effusion or clinically significant pleural effusion. * Has ongoing Grade >1 peripheral neuropathy. * Has a demyelinating form of Charcot-Marie-Tooth disease. * Has a history of a second malignancy, unless potentially curative treatment has been completed with no evidence of malignancy for 2 years. * Participants with FL who have transformed to a more aggressive type of lymphoma. * Has received prior systemic anticancer therapy within 5 half-lives or 4 weeks (if prior therapy was a monoclonal antibodies) or 2 weeks (if prior therapy was small molecules like kinase inhibitors) prior to the first dose of study intervention. * Has received prior radiotherapy within 28 days of start of study intervention. Participants must have recovered from all radiation-related toxicities. * Has ongoing corticosteroid therapy exceeding 30 mg daily of prednisone equivalent. * Has received a live or live-attenuated vaccine within 30 days before the first dose of study intervention. * Has known active central nervous system (CNS) lymphoma involvement or active CNS involvement by lymphoma. * Has an active infection requiring systemic therapy. * Has a known history of human immunodeficiency virus (HIV) infection. * Active HBV or hepatitis C virus (HCV) infection. * For Cohort C only: has any clinically significant gastrointestinal abnormalities that might alter absorption.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Study to Evaluate Adverse Events and Change in Disease Activity in Adult Participants With B-Cell Malignancies Receiving Oral ABBV-525 Tablets",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=31047&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Dose Escalation (Part 1) Only: Participants with a documented diagnosis of one of the following third line or later of treatment (3L)+ mature B-cell malignancies, from the World Health Organization (WHO)-defined histologies as defined in the protocol. * Dose Optimization (Part 2) Only: Participants with documented diagnosis of chronic lymphocytic leukemia (CLL) who are 3L+, +/- cysteine-to-serine point mutation at residue 481 of BTK-domain active site (C481S with histology based on WHO criteria, with measurable disease requiring treatment as defined by the International Workshop on Chronic Lymphocytic Leukemia (iwCLL). * Dose Expansion (Part 3) Only: Participants with documented diagnosis of non-germinal center B cell (GCB) Diffuse large B-cell lymphoma (DLBCL) who are 3L+ chimeric antigen receptor T-cells (CAR-T)/Hematopoietic cell transplant (HCT) relapsed/refractory (R/R) and/or ineligible with histology based on WHO criteria, with measurable disease requiring treatment. * Participant has an Eastern Cooperative Oncology Group (ECOG) Performance Status (PS) of 0 or 1. * Participant has a life expectancy \\>= 12 weeks. * Adequate hematological and hepatic function as defined in the protocol. * Must have archival or freshly collected tumor tissue for correlative studies before study enrollment. * Participants with prior central nervous system (CNS) disease that has been effectively treated may be eligible. * Participants with resolved coronavirus disease 2019 (COVID-19) infection are eligible. Exclusion Criteria: * Known active CNS disease, or primary CNS lymphoma. * Known bleeding disorders. * Known history of stroke or intracranial hemorrhage within 12 months prior to first dose of study treatment. * Uncontrolled active systemic infection, or active cytomegalovirus infection. * Active hepatitis B or C infection. * Known history of human immunodeficiency virus (HIV). * Known active COVID-19 infection. Participant must not have signs/symptoms associated with COVID-19 infection or known exposure to a confirmed case of COVID-19 infection during screening. If participant has signs/symptoms suggestive of COVID-19 infection, the participant must have a negative molecular (eg, polymerase chain reaction) test or 3 negative antigen test results at least 24 hours apart.}') You can take part if: Inclusion Criteria: * Dose Escalation (Part 1) Only: Participants with a documented diagnosis of one of the following third line or later of treatment (3L)+ mature B-cell malignancies, from the World Health Organization (WHO)-defined histologies as defined in the protocol. * Dose Optimization (Part 2) Only: Participants with documented diagnosis of chronic lymphocytic leukemia (CLL) who are 3L+, +/- cysteine-to-serine point mutation at residue 481 of BTK-domain active site (C481S with histology based on WHO criteria, with measurable disease requiring treatment as defined by the International Workshop on Chronic Lymphocytic Leukemia (iwCLL). * Dose Expansion (Part 3) Only: Participants with documented diagnosis of non-germinal center B cell (GCB) Diffuse large B-cell lymphoma (DLBCL) who are 3L+ chimeric antigen receptor T-cells (CAR-T)/Hematopoietic cell transplant (HCT) relapsed/refractory (R/R) and/or ineligible with histology based on WHO criteria, with measurable disease requiring treatment. * Participant has an Eastern Cooperative Oncology Group (ECOG) Performance Status (PS) of 0 or 1. * Participant has a life expectancy >= 12 weeks. * Adequate hematological and hepatic function as defined in the protocol. * Must have archival or freshly collected tumor tissue for correlative studies before study enrollment. * Participants with prior central nervous system (CNS) disease that has been effectively treated may be eligible. * Participants with resolved coronavirus disease 2019 (COVID-19) infection are eligible. Exclusion Criteria: * Known active CNS disease, or primary CNS lymphoma. * Known bleeding disorders. * Known history of stroke or intracranial hemorrhage within 12 months prior to first dose of study treatment. * Uncontrolled active systemic infection, or active cytomegalovirus infection. * Active hepatitis B or C infection. * Known history of human immunodeficiency virus (HIV). * Known active COVID-19 infection. Participant must not have signs/symptoms associated with COVID-19 infection or known exposure to a confirmed case of COVID-19 infection during screening. If participant has signs/symptoms suggestive of COVID-19 infection, the participant must have a negative molecular (eg, polymerase chain reaction) test or 3 negative antigen test results at least 24 hours apart.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Efficacy and Safety of Nemtabrutinib (MK-1026) in Participants With Hematologic Malignancies (MK-1026-003)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=30665&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days prior to allocation * Has a life expectancy of at least 3 months, based on the investigator assessment * Has the ability to swallow and retain oral medication * Participants who are Hepatitis B surface antigen (HBsAg)-positive are eligible if they have received Hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV viral load prior to randomization * Participants with history of Hepatitis C virus (HCV) infection are eligible if HCV viral load is undetectable at screening * Has adequate organ function * Male participants agree to refrain from donating sperm and agree to either remain abstinent from penile-vaginal intercourse as their preferred and usual lifestyle OR agree to use contraception, during the intervention period and for at least the time required to eliminate the study intervention after last dose of study intervention * Female participants assigned female sex at birth who are not pregnant or breastfeeding are eligible to participate if not a participant of childbearing potential (POCBP), or if a POCBP they either use a contraceptive method that is highly effective OR remain abstinent from penile-vaginal intercourse as their preferred and usual lifestyle during the intervention period and for at least to eliminate study intervention after the last dose of study intervention * Participants with HIV are eligible if they meet all of the following: the CD4 count is \\>350 cells/uL at screening, the HIV viral load is below the detectable level, are on a stable ART regimen for at least 4 weeks prior to study entry, and are compliant with their ART Part 1 and Part 2 (Cohorts A to C and J) * Has a confirmed diagnosis of CLL/SLL with * At least 2 lines of prior therapy (Part 1 only) * Part 2 Cohort A: CLL/SLL participants who are relapsed or refractory to prior therapy with a covalent, irreversible Bruton's tyrosine kinase inhibitor (BTKi), and a B-cell lymphoma 2 inhibitor (BCL2i). CLL participants must have received and failed, been intolerant to, or determined by their treating physician to be a poor phosphoinositide 3-kinase inhibitor (PI3Ki) candidate or ineligible for a PI3Ki per local guidelines * Part 2 Cohort B: CLL/SLL participants who are relapsed or refractory following at least 1 line of prior therapy and are BTKi treatment naive * Part 2 Cohort C: CLL/SLL participants with 17p deletion or tumor protein p53 (TP53) mutation who are relapsed or refractory following at least 1 line of prior therapy * Part 2 Cohort J: CLL/SLL participants whose disease relapsed or was refractory to prior therapy with a covalent/irreversible BTKi and BCL2i * Has active disease for CLL/SLL clearly documented to initiate therapy * Has evaluable core or excisional lymph node biopsy for biomarker analysis from an archival or newly obtained biopsy or bone marrow aspirate at Screening (optional for participants enrolling in Part 1) Part 2 (Cohorts D to G) * Has a confirmed diagnosis of and meets the following prior therapy requirements: * Participants with Richter's transformation who are relapsed or refractory following at least 1 line of prior therapy (Cohort D) * Participants with pathologically confirmed MCL, documented by either overexpression of cyclin D1 or t(11;14), who are relapsed or are refractory to chemoimmunotherapy and a covalent irreversible BTKi (Cohort E) * Participants with MZL (including splenic, nodal, and extra nodal MZL) who are relapsed or refractory to chemoimmunotherapy and a covalent irreversible BTKi (Cohort F) * Participants with FL who are relapsed or refractory to chemoimmunotherapy, immunomodulatory agents (i.e. lenalidomide plus rituximab) (Cohort G) * Have measurable disease defined as at least 1 lesion that can be accurately measured in at least 2 dimensions with spiral CT scan * Has a lymph node biopsy for biomarker analysis from an archival or newly obtained biopsy or bone marrow aspirate (Cohort D) at Screening Part 2 (Cohort H): confirmed diagnosis of WM; participants who are relapsed or refractory to standard therapies for WM including chemoimmunotherapy and a covalent irreversible BTKi * Has active disease defined as 1 of the following: systemic symptoms, physical findings, laboratory abnormalities, coexisting disease * Has measurable disease, satisfying any of the following: at least 1 lesion that can be accurately measured in at least 2 dimensions with spiral CT scan (minimum measurement must be \\>15 mm in the longest diameter or \\>10 mm in the short axis); IgM ≥450 mg/dL; or bone marrow infiltration of 10% * Has fresh bone marrow aspirate or a lymph node biopsy for biomarker analysis at Screening or a lymph node biopsy from an archival Exclusion Criteria: * Has active HBV/HCV infection (Part 1 and Part 2) * Has a history of malignancy ≤3 years before providing documented informed consent. Participants with basal cell carcinoma of skin, squamous cell carcinoma of skin, or carcinoma in situ (eg, breast carcinoma, cervical cancer in situ) that have undergone potential curative therapy are not excluded. Participants with low-risk, early-stage prostate cancer (T1-T2a, Gleason score ≤6, and prostate-specific antigen \\ You can take part if: Inclusion Criteria: * Has an Eastern Cooperative Oncology Group (ECOG) performance status of 0 to 2 within 7 days prior to allocation * Has a life expectancy of at least 3 months, based on the investigator assessment * Has the ability to swallow and retain oral medication * Participants who are Hepatitis B surface antigen (HBsAg)-positive are eligible if they have received Hepatitis B virus (HBV) antiviral therapy for at least 4 weeks and have undetectable HBV viral load prior to randomization * Participants with history of Hepatitis C virus (HCV) infection are eligible if HCV viral load is undetectable at screening * Has adequate organ function * Male participants agree to refrain from donating sperm and agree to either remain abstinent from penile-vaginal intercourse as their preferred and usual lifestyle OR agree to use contraception, during the intervention period and for at least the time required to eliminate the study intervention after last dose of study intervention * Female participants assigned female sex at birth who are not pregnant or breastfeeding are eligible to participate if not a participant of childbearing potential (POCBP), or if a POCBP they either use a contraceptive method that is highly effective OR remain abstinent from penile-vaginal intercourse as their preferred and usual lifestyle during the intervention period and for at least to eliminate study intervention after the last dose of study intervention * Participants with HIV are eligible if they meet all of the following: the CD4 count is >350 cells/uL at screening, the HIV viral load is below the detectable level, are on a stable ART regimen for at least 4 weeks prior to study entry, and are compliant with their ART Part 1 and Part 2 (Cohorts A to C and J) * Has a confirmed diagnosis of CLL/SLL with * At least 2 lines of prior therapy (Part 1 only) * Part 2 Cohort A: CLL/SLL participants who are relapsed or refractory to prior therapy with a covalent, irreversible Bruton's tyrosine kinase inhibitor (BTKi), and a B-cell lymphoma 2 inhibitor (BCL2i). CLL participants must have received and failed, been intolerant to, or determined by their treating physician to be a poor phosphoinositide 3-kinase inhibitor (PI3Ki) candidate or ineligible for a PI3Ki per local guidelines * Part 2 Cohort B: CLL/SLL participants who are relapsed or refractory following at least 1 line of prior therapy and are BTKi treatment naive * Part 2 Cohort C: CLL/SLL participants with 17p deletion or tumor protein p53 (TP53) mutation who are relapsed or refractory following at least 1 line of prior therapy * Part 2 Cohort J: CLL/SLL participants whose disease relapsed or was refractory to prior therapy with a covalent/irreversible BTKi and BCL2i * Has active disease for CLL/SLL clearly documented to initiate therapy * Has evaluable core or excisional lymph node biopsy for biomarker analysis from an archival or newly obtained biopsy or bone marrow aspirate at Screening (optional for participants enrolling in Part 1) Part 2 (Cohorts D to G) * Has a confirmed diagnosis of and meets the following prior therapy requirements: * Participants with Richter's transformation who are relapsed or refractory following at least 1 line of prior therapy (Cohort D) * Participants with pathologically confirmed MCL, documented by either overexpression of cyclin D1 or t(11;14), who are relapsed or are refractory to chemoimmunotherapy and a covalent irreversible BTKi (Cohort E) * Participants with MZL (including splenic, nodal, and extra nodal MZL) who are relapsed or refractory to chemoimmunotherapy and a covalent irreversible BTKi (Cohort F) * Participants with FL who are relapsed or refractory to chemoimmunotherapy, immunomodulatory agents (i.e. lenalidomide plus rituximab) (Cohort G) * Have measurable disease defined as at least 1 lesion that can be accurately measured in at least 2 dimensions with spiral CT scan * Has a lymph node biopsy for biomarker analysis from an archival or newly obtained biopsy or bone marrow aspirate (Cohort D) at Screening Part 2 (Cohort H): confirmed diagnosis of WM; participants who are relapsed or refractory to standard therapies for WM including chemoimmunotherapy and a covalent irreversible BTKi * Has active disease defined as 1 of the following: systemic symptoms, physical findings, laboratory abnormalities, coexisting disease * Has measurable disease, satisfying any of the following: at least 1 lesion that can be accurately measured in at least 2 dimensions with spiral CT scan (minimum measurement must be >15 mm in the longest diameter or >10 mm in the short axis); IgM ≥450 mg/dL; or bone marrow infiltration of 10% * Has fresh bone marrow aspirate or a lymph node biopsy for biomarker analysis at Screening or a lymph node biopsy from an archival Exclusion Criteria: * Has active HBV/HCV infection (Part 1 and Part 2) * Has a history of malignancy ≤3 years before providing documented informed consent. Participants with basal cell carcinoma of skin, squamous cell carcinoma of skin, or carcinoma in situ (eg, breast carcinoma, cervical cancer in situ) that have undergone potential curative therapy are not excluded. Participants with low-risk, early-stage prostate cancer (T1-T2a, Gleason score ≤6, and prostate-specific antigen <10 ng/mL) either treated with definitive intent or untreated in active surveillance with SD are not excluded * Has active central nervous system (CNS) disease * Has an active infection requiring systemic therapy * Has received prior systemic anti-cancer therapy within 4 weeks prior to allocation * Is currently participating in or has participated in a study of an investigational agent or has used an investigational device within 4 weeks prior to the first dose of study intervention * Has any clinically significant gastrointestinal abnormalities that might alter absorption * History of severe bleeding disorders",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Long-term Extension Study of PCI-32765 (Ibrutinib)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=41991&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Participants must be currently participating in an ibrutinib clinical study considered complete and have received at least 6 months of treatment with ibrutinib. At study entry, participants must be actively receiving treatment with single-agent ibrutinib; or participants must have participated in an ibrutinib randomized clinical study in which they initially received comparator treatment and now cross-over to ibrutinib. Note: A minimum of 6 months requirement for prior ibrutinib treatment will not be mandatory in this case and participants with less than 6 months will be required to have more frequent initial safety assessments; or participants must be currently participating in study PCI-32765LYM1002. At study entry, participants must be actively receiving combination treatment with ibrutinib and nivolumab or single-agent ibrutinib * Investigator's assessment that the benefit of continued ibrutinib therapy as a single agent or in combination with nivolumab will outweigh the risks * Agrees to protocol-defined use of effective contraception * Negative blood or urine pregnancy test at screening Exclusion Criteria: * Requires anticoagulation with warfarin or equivalent vitamin K antagonists * Requires treatment with strong cytochrome P450 (CYP)3A4/5 inhibitors, unless previously approved by sponsor * Any condition or situation which, in the opinion of the investigator, may put the participant at significant risk, may confound the study results, or may interfere significantly with volunteer's participation in the study}') You can take part if: Inclusion Criteria: * Participants must be currently participating in an ibrutinib clinical study considered complete and have received at least 6 months of treatment with ibrutinib. At study entry, participants must be actively receiving treatment with single-agent ibrutinib; or participants must have participated in an ibrutinib randomized clinical study in which they initially received comparator treatment and now cross-over to ibrutinib. Note: A minimum of 6 months requirement for prior ibrutinib treatment will not be mandatory in this case and participants with less than 6 months will be required to have more frequent initial safety assessments; or participants must be currently participating in study PCI-32765LYM1002. At study entry, participants must be actively receiving combination treatment with ibrutinib and nivolumab or single-agent ibrutinib * Investigator's assessment that the benefit of continued ibrutinib therapy as a single agent or in combination with nivolumab will outweigh the risks * Agrees to protocol-defined use of effective contraception * Negative blood or urine pregnancy test at screening Exclusion Criteria: * Requires anticoagulation with warfarin or equivalent vitamin K antagonists * Requires treatment with strong cytochrome P450 (CYP)3A4/5 inhibitors, unless previously approved by sponsor * Any condition or situation which, in the opinion of the investigator, may put the participant at significant risk, may confound the study results, or may interfere significantly with volunteer's participation in the study",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "First in Human Study of NVG-111 in Relapsed/Refractory ROR1+ Malignancies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=47668&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Personally signed informed consent document. * Male or female, age ≥18 years. * Relapsed or refractory ROR1+ malignancies * ECOG performance status ≤2. * Adequate organ function. * Bilirubin ≤1.5 x ULN (unless Gilbert's syndrome). * AST and ALT ≤2.5 x ULN (if no hepatic CLL or MCL), or AST and ALT ≤5 x ULN (if hepatic CLL or MCL). * APTT and PT ≤1.5 x ULN. * ANC ≥0.5 x 10\\^9 /L (without growth factors) and platelets ≥ 30 x 10\\^9 /L (without transfusion). * Serum creatinine ≤2 x ULN. * Estimated creatinine clearance ≥30 mL/min. * In females of childbearing potential, a negative serum pregnancy test. * For both males and females, willingness to use adequate contraception. * Willingness and ability to comply with study procedures. Exclusion Criteria: * Richter's transformation. * CNS or leptomeningeal active disease. * High tumour bulk as defined in the protocol. * Allogeneic or autologous organ transplant within prior 6 months. * Uncontrolled autoimmune haemolytic anaemia or idiopathic thrombocytopenic purpura within 8 weeks of screening. * Clinically significant neurological disease. * Clinically significant cardiovascular disease or ECG abnormalities. * Severe chronic lung disease. * Positive test at Screening for HIV, hepatitis B or hepatitis C infection. * Any other concurrent cancer or cancer treatments. * Uncontrolled ongoing infection * Recent major surgery * Concurrent participation in another clinical trial, or experimental therapy within 5 half-lives of Screening * Pregnant or currently breastfeeding. * Any other medical condition that in the opinion of the investigator contraindicates participation in the study.}') You can take part if: Inclusion criteria: * Personally signed informed consent document. * Male or female, age ≥18 years. * Relapsed or refractory ROR1+ malignancies * ECOG performance status ≤2. * Adequate organ function. * Bilirubin ≤1.5 x ULN (unless Gilbert's syndrome). * AST and ALT ≤2.5 x ULN (if no hepatic CLL or MCL), or AST and ALT ≤5 x ULN (if hepatic CLL or MCL). * APTT and PT ≤1.5 x ULN. * ANC ≥0.5 x 10^9 /L (without growth factors) and platelets ≥ 30 x 10^9 /L (without transfusion). * Serum creatinine ≤2 x ULN. * Estimated creatinine clearance ≥30 mL/min. * In females of childbearing potential, a negative serum pregnancy test. * For both males and females, willingness to use adequate contraception. * Willingness and ability to comply with study procedures. Exclusion Criteria: * Richter's transformation. * CNS or leptomeningeal active disease. * High tumour bulk as defined in the protocol. * Allogeneic or autologous organ transplant within prior 6 months. * Uncontrolled autoimmune haemolytic anaemia or idiopathic thrombocytopenic purpura within 8 weeks of screening. * Clinically significant neurological disease. * Clinically significant cardiovascular disease or ECG abnormalities. * Severe chronic lung disease. * Positive test at Screening for HIV, hepatitis B or hepatitis C infection. * Any other concurrent cancer or cancer treatments. * Uncontrolled ongoing infection * Recent major surgery * Concurrent participation in another clinical trial, or experimental therapy within 5 half-lives of Screening * Pregnant or currently breastfeeding. * Any other medical condition that in the opinion of the investigator contraindicates participation in the study.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Study of NX-5948 in Adults With Relapsed/Refractory B-cell Malignancies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=37679&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* Age ≥18 years * Patients in Phase 1a (Dose Escalation) must have histologically confirmed R/R CLL, SLL, DLBCL (subgroups include Richter-transformed DLBCL, germinal center B-cell type, activated B-cell type, high-grade B-cell lymphoma with MYC and BCL-2 and/or BCL-6 rearrangements, high-grade B-cell lymphomas NOS), FL, MCL, MZL (subtypes include EMZL, MALT, NMZL, SMZL), WM, or PCNSL. * Patients in Phase 1a must meet the following: o For non-PCNSL indications, received at least 2 prior lines of therapy and have no other available therapies known to provide clinical benefit. For PCNSL, received at least 1 prior line of therapy * Patients in Phase 1b (Safety and Cohort Expansion) must have 1 of the following histologically documented B-cell malignancies, must meet criteria for systemic treatment, and must have received prior therapies and/or molecular features based on details described for each cohort: CLL or SLL, DLBCL, MCL, FL, MZL, WM, or PCNSL/SCNSL. * Measurable disease per response criteria specific to the malignancy. * Eastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 (0-2 for patients with PCNSL and secondary CNS involvement). * Adequate organ and bone marrow function Key Exclusion Criteria: * Known or suspected active prolymphocytic leukemia or Richter's transformation to Hodgkin's lymphoma prior to study enrollment * Prior treatment for the indication under study for anti-cancer intent that includes: 1. Radiotherapy within 2 weeks of planned start of study drug (excluding limited palliative radiation). 2. Prior systemic chemotherapy within 2 weeks of planned start of study drug. 3. Prior monoclonal antibody therapy within 4 weeks of planned start of study drug, except for patients enrolling in Cohort 16 (CLL with secondary wAIHA) where a 16-week washout period is required. 4. Prior small molecule therapy within 2 weeks or 5 half-lives (whichever is shorter) of planned start of study drug. 5. Autologous or allogeneic stem cell transplant within 100 days prior to planned start of study drug. 6. Chimeric antigen receptor (CAR) T-cell therapy within 100 days prior to start of study drug (within 60 days prior to start of study drug for Phase 1b). 7. Use of systemic corticosteroids outside of dosing limits described below and within 7 days prior to initiation of study treatment excepting those used as prophylaxis for radio diagnostic contrast. Patients with PCNSL/SCNSL: no greater than 40 mg/day prednisone, or equivalent. Patients with PCNSL/SCNSL using greater than 20 mg/day prednisone, or equivalent, must be clinically stable at that dose for 7 days. All other diagnoses: no greater than 20 mg/day prednisone or equivalent. 8. Use of systemic immunosuppressive drugs other than systemic corticosteroids for any medical condition within 60 days prior to first dose of study drug 9. Previously treated with a BTK degrader * Active, uncontrolled autoimmune hemolytic anemia (except for patients enrolling in Cohort 16) or active, uncontrolled autoimmune thrombocytopenia. * Patient has any of the following within 6 months of planned start of study drug: 1. Myocardial infarction, unstable angina, unstable symptomatic ischemic heart disease, or placement of a coronary arterial stent 2. Uncontrolled atrial fibrillation or other clinically significant arrhythmias, conduction abnormalities, or New York Heart Association (NYHA) class III or IV heart failure 3. Thromboembolic events (e.g., deep vein thrombosis, pulmonary embolism, or symptomatic cerebrovascular events), stroke, or intracranial hemorrhage 4. Any other significant cardiac condition (e.g., pericardial effusion, restrictive cardiomyopathy, severe untreated valvular stenosis, severe congenital heart disease, or persistent uncontrolled hypertension defined as systolic blood pressure \\> 160 mmHg or diastolic blood pressure \\> 100 mmHg despite optimal medical management) * Bleeding diathesis, or other known risk for acute blood loss. * History of Grade ≥ 2 hemorrhage within 28 days of planned start of study drug. * Active known concurrent malignancy or malignancy other than the one under study within the past 3 years. (Exceptions include, but are not limited to, patients with more recent history of basal or squamous cell skin cancer, superficial bladder cancer, or carcinoma in situ of the cervix or breast may enroll if they have undergone curative therapy and have no evidence of disease).}') You can take part if: Key Inclusion Criteria: * Age ≥18 years * Patients in Phase 1a (Dose Escalation) must have histologically confirmed R/R CLL, SLL, DLBCL (subgroups include Richter-transformed DLBCL, germinal center B-cell type, activated B-cell type, high-grade B-cell lymphoma with MYC and BCL-2 and/or BCL-6 rearrangements, high-grade B-cell lymphomas NOS), FL, MCL, MZL (subtypes include EMZL, MALT, NMZL, SMZL), WM, or PCNSL. * Patients in Phase 1a must meet the following: o For non-PCNSL indications, received at least 2 prior lines of therapy and have no other available therapies known to provide clinical benefit. For PCNSL, received at least 1 prior line of therapy * Patients in Phase 1b (Safety and Cohort Expansion) must have 1 of the following histologically documented B-cell malignancies, must meet criteria for systemic treatment, and must have received prior therapies and/or molecular features based on details described for each cohort: CLL or SLL, DLBCL, MCL, FL, MZL, WM, or PCNSL/SCNSL. * Measurable disease per response criteria specific to the malignancy. * Eastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 (0-2 for patients with PCNSL and secondary CNS involvement). * Adequate organ and bone marrow function Key Exclusion Criteria: * Known or suspected active prolymphocytic leukemia or Richter's transformation to Hodgkin's lymphoma prior to study enrollment * Prior treatment for the indication under study for anti-cancer intent that includes: 1. Radiotherapy within 2 weeks of planned start of study drug (excluding limited palliative radiation). 2. Prior systemic chemotherapy within 2 weeks of planned start of study drug. 3. Prior monoclonal antibody therapy within 4 weeks of planned start of study drug, except for patients enrolling in Cohort 16 (CLL with secondary wAIHA) where a 16-week washout period is required. 4. Prior small molecule therapy within 2 weeks or 5 half-lives (whichever is shorter) of planned start of study drug. 5. Autologous or allogeneic stem cell transplant within 100 days prior to planned start of study drug. 6. Chimeric antigen receptor (CAR) T-cell therapy within 100 days prior to start of study drug (within 60 days prior to start of study drug for Phase 1b). 7. Use of systemic corticosteroids outside of dosing limits described below and within 7 days prior to initiation of study treatment excepting those used as prophylaxis for radio diagnostic contrast. Patients with PCNSL/SCNSL: no greater than 40 mg/day prednisone, or equivalent. Patients with PCNSL/SCNSL using greater than 20 mg/day prednisone, or equivalent, must be clinically stable at that dose for 7 days. All other diagnoses: no greater than 20 mg/day prednisone or equivalent. 8. Use of systemic immunosuppressive drugs other than systemic corticosteroids for any medical condition within 60 days prior to first dose of study drug 9. Previously treated with a BTK degrader * Active, uncontrolled autoimmune hemolytic anemia (except for patients enrolling in Cohort 16) or active, uncontrolled autoimmune thrombocytopenia. * Patient has any of the following within 6 months of planned start of study drug: 1. Myocardial infarction, unstable angina, unstable symptomatic ischemic heart disease, or placement of a coronary arterial stent 2. Uncontrolled atrial fibrillation or other clinically significant arrhythmias, conduction abnormalities, or New York Heart Association (NYHA) class III or IV heart failure 3. Thromboembolic events (e.g., deep vein thrombosis, pulmonary embolism, or symptomatic cerebrovascular events), stroke, or intracranial hemorrhage 4. Any other significant cardiac condition (e.g., pericardial effusion, restrictive cardiomyopathy, severe untreated valvular stenosis, severe congenital heart disease, or persistent uncontrolled hypertension defined as systolic blood pressure > 160 mmHg or diastolic blood pressure > 100 mmHg despite optimal medical management) * Bleeding diathesis, or other known risk for acute blood loss. * History of Grade ≥ 2 hemorrhage within 28 days of planned start of study drug. * Active known concurrent malignancy or malignancy other than the one under study within the past 3 years. (Exceptions include, but are not limited to, patients with more recent history of basal or squamous cell skin cancer, superficial bladder cancer, or carcinoma in situ of the cervix or breast may enroll if they have undergone curative therapy and have no evidence of disease).",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "A Dose-Escalation and Expansion Study of BGB-16673 in Participants With B-Cell Malignancies",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=51097&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": ": 1. Confirmed diagnosis (per World Health Organization (WHO) guidelines, unless otherwise noted) of one of the following: Marginal Zone Lymphoma (MZL) , Follicular Lymphoma (FL), R/R Mantle Cell Lymphoma (MCL), R/R chronic lymphocytic leukemia and small lymphocytic lymphoma (CLL/SLL), Waldenström macroglobulinemia (WM), Diffuse large B-cell lymphoma (DLBCL), or \\>2 treatments per the Richter's transformation to DLBCL. 2. Participants who have previously received a covalently-binding Bruton´s tyrosine kinase (BTK) inhibitor (BTKi) in any line of therapy must have received treatment with the BTK inhibitor for ≥ 8 weeks (unless reason for discontinuation is intolerance). 3. For dose-finding and dose-expansion, participants who had previously received a covalently-binding BTK inhibitor as monotherapy or in combination with other anticancer agents are eligible for the study if they meet any of the following criteria: discontinued the previous BTK inhibitor due to disease progression, experienced disease progression after completing treatment with a BTK inhibitor or discontinued the BTK inhibitor due to toxicity or intolerance. 4. Measurable disease by radiographic assessment or serum IgM level (WM only) 5. Eastern Cooperative Oncology Group (ECOG) Performance Status of 0 to 2 6. Participants enrolling in the dose finding phase of the study may be previously treated with a BTKi or may be naïve to BTKi therapy depending on the diagnosis and country of enrollment; participants with MCL enrolling in the expansion cohorts (Phase 2) must have been treated with a BTKi in a prior line of therapy; CLL/SLL participants, in addition to being treated with a BTKi in a prior line of therapy, must also have received a Bcl-2 inhibitor in a prior line of therapy as well (Phase 2). Exclusion Criteria: 1. Prior malignancy (other than the disease under study) within the past 2 years, except in situ malignancies that have been curatively resected, localized breast cancer treated with curative intent with no evidence of breast active disease for more than 3 years and receiving adjuvant hormonal therapy, localized Gleason score ≤ 6 prostate cancer undergoing observation or treatment with androgen depravation, or any other cancer treated with curative intent, not on adjuvant treatment, and in the opinion of the investigator is unlikely to recur. 2. Requires ongoing systemic treatment for any other malignancy 3. Requires ongoing systemic (defined as ≥ 10 mg/day of prednisone or equivalent) corticosteroid treatment. 4. Current or history of central nervous system involvement including the brain, spinal cord, leptomeninges, and cerebrospinal fluid (as documented by imaging, cytology, or biopsy) by B-cell malignancy, regardless of whether participants had received treatment for central nervous system disease 5. Known active plasma cell neoplasm, prolymphocytic leukemia, T-cell lymphoma, Burkitt lymphoma, acquired immunodeficiency syndrome (AIDS)-related B-cell lymphoma, Castleman disease, post-transplant lymphoproliferative disorders, hairy cell leukemia, germinal center B-cell (GCB), DLBCL, EBV+ DLBCL NOS, primary DLBCL of the central nervous system (CNS), primary cutaneous DLBCL - leg type, DLBCL associated with chronic inflammation, primary mediastinal (thymic) large B-cell lymphoma, intravascular large B-cell lymphoma, ALK+ large B-cell lymphoma, primary effusion lymphoma, high-grade B-cell lymphoma with MYC and BCL2 and/or BCL6 rearrangements, high-grade B-cell lymphoma - NOS, B-cell lymphoma unclassifiable with features intermediate between DLBCL and classical Hodgkin lymphoma, or history of or currently suspected transformation of an indolent lymphoma to an aggressive histology (except for participants with Richter Transformation to DLBCL are eligible for Part 1a, 1c, or Phase 2 and participants with history of follicular lymphoma transforming to non-GCB DLBCL who are eligible for Part 1a, 1c, or Phase 2). Note: Other protocol defined Inclusion/Exclusion criteria may apply.}') You can take part if: Inclusion Criteria : 1. Confirmed diagnosis (per World Health Organization (WHO) guidelines, unless otherwise noted) of one of the following: Marginal Zone Lymphoma (MZL) , Follicular Lymphoma (FL), R/R Mantle Cell Lymphoma (MCL), R/R chronic lymphocytic leukemia and small lymphocytic lymphoma (CLL/SLL), Waldenström macroglobulinemia (WM), Diffuse large B-cell lymphoma (DLBCL), or >2 treatments per the Richter's transformation to DLBCL. 2. Participants who have previously received a covalently-binding Bruton´s tyrosine kinase (BTK) inhibitor (BTKi) in any line of therapy must have received treatment with the BTK inhibitor for ≥ 8 weeks (unless reason for discontinuation is intolerance). 3. For dose-finding and dose-expansion, participants who had previously received a covalently-binding BTK inhibitor as monotherapy or in combination with other anticancer agents are eligible for the study if they meet any of the following criteria: discontinued the previous BTK inhibitor due to disease progression, experienced disease progression after completing treatment with a BTK inhibitor or discontinued the BTK inhibitor due to toxicity or intolerance. 4. Measurable disease by radiographic assessment or serum IgM level (WM only) 5. Eastern Cooperative Oncology Group (ECOG) Performance Status of 0 to 2 6. Participants enrolling in the dose finding phase of the study may be previously treated with a BTKi or may be naïve to BTKi therapy depending on the diagnosis and country of enrollment; participants with MCL enrolling in the expansion cohorts (Phase 2) must have been treated with a BTKi in a prior line of therapy; CLL/SLL participants, in addition to being treated with a BTKi in a prior line of therapy, must also have received a Bcl-2 inhibitor in a prior line of therapy as well (Phase 2). Exclusion Criteria: 1. Prior malignancy (other than the disease under study) within the past 2 years, except in situ malignancies that have been curatively resected, localized breast cancer treated with curative intent with no evidence of breast active disease for more than 3 years and receiving adjuvant hormonal therapy, localized Gleason score ≤ 6 prostate cancer undergoing observation or treatment with androgen depravation, or any other cancer treated with curative intent, not on adjuvant treatment, and in the opinion of the investigator is unlikely to recur. 2. Requires ongoing systemic treatment for any other malignancy 3. Requires ongoing systemic (defined as ≥ 10 mg/day of prednisone or equivalent) corticosteroid treatment. 4. Current or history of central nervous system involvement including the brain, spinal cord, leptomeninges, and cerebrospinal fluid (as documented by imaging, cytology, or biopsy) by B-cell malignancy, regardless of whether participants had received treatment for central nervous system disease 5. Known active plasma cell neoplasm, prolymphocytic leukemia, T-cell lymphoma, Burkitt lymphoma, acquired immunodeficiency syndrome (AIDS)-related B-cell lymphoma, Castleman disease, post-transplant lymphoproliferative disorders, hairy cell leukemia, germinal center B-cell (GCB), DLBCL, EBV+ DLBCL NOS, primary DLBCL of the central nervous system (CNS), primary cutaneous DLBCL - leg type, DLBCL associated with chronic inflammation, primary mediastinal (thymic) large B-cell lymphoma, intravascular large B-cell lymphoma, ALK+ large B-cell lymphoma, primary effusion lymphoma, high-grade B-cell lymphoma with MYC and BCL2 and/or BCL6 rearrangements, high-grade B-cell lymphoma - NOS, B-cell lymphoma unclassifiable with features intermediate between DLBCL and classical Hodgkin lymphoma, or history of or currently suspected transformation of an indolent lymphoma to an aggressive histology (except for participants with Richter Transformation to DLBCL are eligible for Part 1a, 1c, or Phase 2 and participants with history of follicular lymphoma transforming to non-GCB DLBCL who are eligible for Part 1a, 1c, or Phase 2). Note: Other protocol defined Inclusion/Exclusion criteria may apply.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Substudy 01A: Zilovertamab Vedotin in Pediatric and Young Adult Participants With Hematologic Malignancies or Solid Tumors (MK-9999-01A/LIGHTBEAM-U01)",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=51622&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "* For hematological malignancies: Confirmed diagnosis of B-precursor B-ALL or DLBCL/Burkitt lymphoma according to World Health Organization (WHO) classification of neoplasms of the lymphoid tissues. * For solid tumor malignancies: Histologically confirmed diagnosis of neuroblastoma or Ewing sarcoma. Exclusion Criteria: * History of solid organ transplant. * Clinically significant (ie, active) cardiovascular disease. * Known history of liver cirrhosis. * Ongoing Grade \\>1 peripheral neuropathy. * Demyelinating form of Charcot-Marie-Tooth disease. * Diagnosed with Down syndrome. * Ongoing graft-versus-host disease (GVHD) of any grade or receiving systemic GVHD treatment or prophylaxis. * History of human immunodeficiency virus (HIV) infection. * Contraindication or hypersensitivity to any of the study intervention components. * Received prior radiotherapy within 4 weeks of start of study intervention. Participants must have recovered from all radiation-related toxicities. * Ongoing, chronic corticosteroid therapy (exceeding 10 mg daily of prednisone equivalent). Prednisone equivalent dosing must have been stable for at least 4 weeks before Cycle 1 Day 1 (C1D1). * Received a strong cytochrome P450 3A4 (CYP3A4) inhibitor within 7 days or a strong CYP3A4 inducer within 14 days before the start of study intervention or expected requirement for chronic use of a strong CYP3A4 inhibitor or inducer during the study intervention period and for 30 days after the last dose of study intervention * Received prior systemic anticancer therapy including investigational agents within 4 weeks before the first dose of study intervention (except for prophylactic intrathecal chemotherapy and/or cytoreductive therapy with steroids/hydroxyurea. * Received a live or live-attenuated vaccine within 30 days before the first dose of study intervention. Administration of killed vaccines is allowed. * Has received an investigational agent or has used an investigational device within 4 weeks prior to study intervention administration. * Known additional malignancy that is progressing or has required active treatment within the past 1 year. * Active infection requiring systemic therapy. * Known history of Hepatitis B or known active Hepatitis C virus infection. * Participants who have not adequately recovered from major surgery or have ongoing surgical complications.}') You can take part if: The main inclusion and exclusion criteria include but are not limited to the following: Inclusion Criteria: * For hematological malignancies: Confirmed diagnosis of B-precursor B-ALL or DLBCL/Burkitt lymphoma according to World Health Organization (WHO) classification of neoplasms of the lymphoid tissues. * For solid tumor malignancies: Histologically confirmed diagnosis of neuroblastoma or Ewing sarcoma. Exclusion Criteria: * History of solid organ transplant. * Clinically significant (ie, active) cardiovascular disease. * Known history of liver cirrhosis. * Ongoing Grade >1 peripheral neuropathy. * Demyelinating form of Charcot-Marie-Tooth disease. * Diagnosed with Down syndrome. * Ongoing graft-versus-host disease (GVHD) of any grade or receiving systemic GVHD treatment or prophylaxis. * History of human immunodeficiency virus (HIV) infection. * Contraindication or hypersensitivity to any of the study intervention components. * Received prior radiotherapy within 4 weeks of start of study intervention. Participants must have recovered from all radiation-related toxicities. * Ongoing, chronic corticosteroid therapy (exceeding 10 mg daily of prednisone equivalent). Prednisone equivalent dosing must have been stable for at least 4 weeks before Cycle 1 Day 1 (C1D1). * Received a strong cytochrome P450 3A4 (CYP3A4) inhibitor within 7 days or a strong CYP3A4 inducer within 14 days before the start of study intervention or expected requirement for chronic use of a strong CYP3A4 inhibitor or inducer during the study intervention period and for 30 days after the last dose of study intervention * Received prior systemic anticancer therapy including investigational agents within 4 weeks before the first dose of study intervention (except for prophylactic intrathecal chemotherapy and/or cytoreductive therapy with steroids/hydroxyurea. * Received a live or live-attenuated vaccine within 30 days before the first dose of study intervention. Administration of killed vaccines is allowed. * Has received an investigational agent or has used an investigational device within 4 weeks prior to study intervention administration. * Known additional malignancy that is progressing or has required active treatment within the past 1 year. * Active infection requiring systemic therapy. * Known history of Hepatitis B or known active Hepatitis C virus infection. * Participants who have not adequately recovered from major surgery or have ongoing surgical complications.",
    "location_panel": "Cities/Towns"
  },
  {
    "title": "Comparing interventions for the prevention of graft-versus-host disease after unrelated donor stem cell transplantation",
    "link": "https://bepartofresearch.nihr.ac.uk/trial-details/trial-detail?trialId=544&location=&distance=",
    "description": "Recruiting",
    "type": "Clinical trial",
    "status": "Open",
    "cancer_types": "Blood cancers, Leukaemia",
    "locations": "Cities/Towns",
    "recruitment_start": "",
    "recruitment_start_iso": "",
    "recruitment_end": "",
    "recruitment_end_iso": "",
    "chief_investigator": "",
    "supported_by": "",
    "contact_phone": "",
    "contact_email": "",
    "who_can_enter": "as of 29/08/2023: 1. Availability of suitably matched unrelated donor (9/10 or 10/10) 2. Planned to receive one of the following reduced-intensity conditioning (RIC) protocols: 2.1. Fludarabine-melphalan (fludarabine 120-180 mg/m²; melphalan ≤150 mg/m²) 2.2. BEAM or LEAM (carmustine 300 mg/m² or lomustine 200 mg/m² with: etoposide 800 mg/m²; cytarabine 1600 mg/m²; melphalan 140 mg/m²) 2.3. Fludarabine-busulphan (fludarabine 120-180 mg/m²; busulphan ≤8 mg/kg PO or 6.4 mg/kg IV) 2.4. Fludarabine-treosulfan (fludarabine 150 mg/m² IV; treosulfan 30 g/m² IV) 3. Planned use of peripheral blood stem cells (PBSCs) for transplantation 4. Planned allo-SCT for one of the following haematological malignancies: 4.1. AML in complete remission (CR) 4.2. ALL in CR 4.3. CMML You can take part if: Current inclusion criteria as of 29/08/2023: 1. Availability of suitably matched unrelated donor (9/10 or 10/10) 2. Planned to receive one of the following reduced-intensity conditioning (RIC) protocols: 2.1. Fludarabine-melphalan (fludarabine 120-180 mg/m²; melphalan ≤150 mg/m²) 2.2. BEAM or LEAM (carmustine 300 mg/m² or lomustine 200 mg/m² with: etoposide 800 mg/m²; cytarabine 1600 mg/m²; melphalan 140 mg/m²) 2.3. Fludarabine-busulphan (fludarabine 120-180 mg/m²; busulphan ≤8 mg/kg PO or 6.4 mg/kg IV) 2.4. Fludarabine-treosulfan (fludarabine 150 mg/m² IV; treosulfan 30 g/m² IV) 3. Planned use of peripheral blood stem cells (PBSCs) for transplantation 4. Planned allo-SCT for one of the following haematological malignancies: 4.1. AML in complete remission (CR) 4.2. ALL in CR 4.3. CMML <10% blasts 4.4. MDS <10% blasts 4.5. NHL in CR/partial remission (PR) 4.6. HL in CR/PR 4.7. MM in CR/PR 4.8. CLL in CR/PR 4.9. CML in 1st or 2nd chronic phase 4.10. Myelofibrosis 5. Age 16-70 years 6. Females of and male patients of reproductive potential (i.e., not post-menopausal or surgically sterilised) must agree to use appropriate, highly effective, contraception from the point of",
    "location_panel": "Cities/Towns"
  }
]